[Killed] BlockStatement
src/posts/bookmarks.js:7:48
 const plugins = require('../plugins');
 
 module.exports = function (Posts) {
-    Posts.bookmark = async function (pid, uid) {
-        return await toggleBookmark('bookmark', pid, uid);
-    };
+    Posts.bookmark = async function (pid, uid) {};
 
     Posts.unbookmark = async function (pid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/bookmarks.js:11:50
         return await toggleBookmark('bookmark', pid, uid);
     };
 
-    Posts.unbookmark = async function (pid, uid) {
-        return await toggleBookmark('unbookmark', pid, uid);
-    };
+    Posts.unbookmark = async function (pid, uid) {};
 
     async function toggleBookmark(type, pid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/bookmarks.js:12:37
     };
 
     Posts.unbookmark = async function (pid, uid) {
-        return await toggleBookmark('unbookmark', pid, uid);
+        return await toggleBookmark("", pid, uid);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/bookmarks.js:16:13
     };
 
     async function toggleBookmark(type, pid, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (false) {
             throw new Error('[[error:not-logged-in]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/bookmarks.js:16:13
     };
 
     async function toggleBookmark(type, pid, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (parseInt(uid, 10) > 0) {
             throw new Error('[[error:not-logged-in]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/bookmarks.js:17:29
 
     async function toggleBookmark(type, pid, uid) {
         if (parseInt(uid, 10) <= 0) {
-            throw new Error('[[error:not-logged-in]]');
+            throw new Error("");
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/bookmarks.js:20:31
             throw new Error('[[error:not-logged-in]]');
         }
 
-        const isBookmarking = type === 'bookmark';
+        const isBookmarking = true;
 
         const [postData, hasBookmarked] = await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/bookmarks.js:20:31
             throw new Error('[[error:not-logged-in]]');
         }
 
-        const isBookmarking = type === 'bookmark';
+        const isBookmarking = type !== 'bookmark';
 
         const [postData, hasBookmarked] = await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/bookmarks.js:23:38
         const isBookmarking = type === 'bookmark';
 
         const [postData, hasBookmarked] = await Promise.all([
-            Posts.getPostFields(pid, ['pid', 'uid']),
+            Posts.getPostFields(pid, []),
             Posts.hasBookmarked(pid, uid),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/bookmarks.js:27:13
             Posts.hasBookmarked(pid, uid),
         ]);
 
-        if (isBookmarking && hasBookmarked) {
+        if (false) {
             throw new Error('[[error:already-bookmarked]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/bookmarks.js:27:13
             Posts.hasBookmarked(pid, uid),
         ]);
 
-        if (isBookmarking && hasBookmarked) {
+        if (isBookmarking || hasBookmarked) {
             throw new Error('[[error:already-bookmarked]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/bookmarks.js:28:29
         ]);
 
         if (isBookmarking && hasBookmarked) {
-            throw new Error('[[error:already-bookmarked]]');
+            throw new Error("");
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/bookmarks.js:31:13
             throw new Error('[[error:already-bookmarked]]');
         }
 
-        if (!isBookmarking && !hasBookmarked) {
+        if (false) {
             throw new Error('[[error:already-unbookmarked]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/bookmarks.js:31:47
             throw new Error('[[error:already-bookmarked]]');
         }
 
-        if (!isBookmarking && !hasBookmarked) {
-            throw new Error('[[error:already-unbookmarked]]');
-        }
+        if (!isBookmarking && !hasBookmarked) {}
 
         if (isBookmarking) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/bookmarks.js:32:29
         }
 
         if (!isBookmarking && !hasBookmarked) {
-            throw new Error('[[error:already-unbookmarked]]');
+            throw new Error("");
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/bookmarks.js:35:28
             throw new Error('[[error:already-unbookmarked]]');
         }
 
-        if (isBookmarking) {
-            await db.sortedSetAdd(`uid:${uid}:bookmarks`, Date.now(), pid);
-        } else {
+        if (isBookmarking) {} else {
             await db.sortedSetRemove(`uid:${uid}:bookmarks`, pid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/bookmarks.js:35:13
             throw new Error('[[error:already-unbookmarked]]');
         }
 
-        if (isBookmarking) {
+        if (false) {
             await db.sortedSetAdd(`uid:${uid}:bookmarks`, Date.now(), pid);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/bookmarks.js:36:35
         }
 
         if (isBookmarking) {
-            await db.sortedSetAdd(`uid:${uid}:bookmarks`, Date.now(), pid);
+            await db.sortedSetAdd(``, Date.now(), pid);
         } else {
             await db.sortedSetRemove(`uid:${uid}:bookmarks`, pid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/bookmarks.js:37:16
 
         if (isBookmarking) {
             await db.sortedSetAdd(`uid:${uid}:bookmarks`, Date.now(), pid);
-        } else {
-            await db.sortedSetRemove(`uid:${uid}:bookmarks`, pid);
-        }
+        } else {}
         await db[isBookmarking ? 'setAdd' : 'setRemove'](`pid:${pid}:users_bookmarked`, uid);
         postData.bookmarks = await db.setCount(`pid:${pid}:users_bookmarked`);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/bookmarks.js:40:34
         } else {
             await db.sortedSetRemove(`uid:${uid}:bookmarks`, pid);
         }
-        await db[isBookmarking ? 'setAdd' : 'setRemove'](`pid:${pid}:users_bookmarked`, uid);
+        await db[isBookmarking ? "" : 'setRemove'](`pid:${pid}:users_bookmarked`, uid);
         postData.bookmarks = await db.setCount(`pid:${pid}:users_bookmarked`);
         await Posts.setPostField(pid, 'bookmarks', postData.bookmarks);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/bookmarks.js:42:39
         }
         await db[isBookmarking ? 'setAdd' : 'setRemove'](`pid:${pid}:users_bookmarked`, uid);
         postData.bookmarks = await db.setCount(`pid:${pid}:users_bookmarked`);
-        await Posts.setPostField(pid, 'bookmarks', postData.bookmarks);
+        await Posts.setPostField(pid, "", postData.bookmarks);
 
         plugins.hooks.fire(`action:post.${type}`, {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/bookmarks.js:44:51
         postData.bookmarks = await db.setCount(`pid:${pid}:users_bookmarked`);
         await Posts.setPostField(pid, 'bookmarks', postData.bookmarks);
 
-        plugins.hooks.fire(`action:post.${type}`, {
-            pid: pid,
-            uid: uid,
-            owner: postData.uid,
-            current: hasBookmarked ? 'bookmarked' : 'unbookmarked',
-        });
+        plugins.hooks.fire(`action:post.${type}`, {});
 
         return {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/bookmarks.js:48:53
             pid: pid,
             uid: uid,
             owner: postData.uid,
-            current: hasBookmarked ? 'bookmarked' : 'unbookmarked',
+            current: hasBookmarked ? 'bookmarked' : "",
         });
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/bookmarks.js:48:38
             pid: pid,
             uid: uid,
             owner: postData.uid,
-            current: hasBookmarked ? 'bookmarked' : 'unbookmarked',
+            current: hasBookmarked ? "" : 'unbookmarked',
         });
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/bookmarks.js:57:53
         };
     }
 
-    Posts.hasBookmarked = async function (pid, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return Array.isArray(pid) ? pid.map(() => false) : false;
-        }
-
-        if (Array.isArray(pid)) {
-            const sets = pid.map(pid => `pid:${pid}:users_bookmarked`);
-            return await db.isMemberOfSets(sets, uid);
-        }
-        return await db.isSetMember(`pid:${pid}:users_bookmarked`, uid);
-    };
+    Posts.hasBookmarked = async function (pid, uid) {};
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/bookmarks.js:58:13
     }
 
     Posts.hasBookmarked = async function (pid, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (parseInt(uid, 10) > 0) {
             return Array.isArray(pid) ? pid.map(() => false) : false;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/bookmarks.js:58:37
     }
 
     Posts.hasBookmarked = async function (pid, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return Array.isArray(pid) ? pid.map(() => false) : false;
-        }
+        if (parseInt(uid, 10) <= 0) {}
 
         if (Array.isArray(pid)) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/bookmarks.js:59:64
 
     Posts.hasBookmarked = async function (pid, uid) {
         if (parseInt(uid, 10) <= 0) {
-            return Array.isArray(pid) ? pid.map(() => false) : false;
+            return Array.isArray(pid) ? pid.map(() => false) : true;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/bookmarks.js:59:55
 
     Posts.hasBookmarked = async function (pid, uid) {
         if (parseInt(uid, 10) <= 0) {
-            return Array.isArray(pid) ? pid.map(() => false) : false;
+            return Array.isArray(pid) ? pid.map(() => true) : false;
         }
 
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-privileges]]

[Killed] BlockStatement
src/posts/bookmarks.js:62:33
             return Array.isArray(pid) ? pid.map(() => false) : false;
         }
 
-        if (Array.isArray(pid)) {
-            const sets = pid.map(pid => `pid:${pid}:users_bookmarked`);
-            return await db.isMemberOfSets(sets, uid);
-        }
+        if (Array.isArray(pid)) {}
         return await db.isSetMember(`pid:${pid}:users_bookmarked`, uid);
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/bookmarks.js:62:13
             return Array.isArray(pid) ? pid.map(() => false) : false;
         }
 
-        if (Array.isArray(pid)) {
+        if (true) {
             const sets = pid.map(pid => `pid:${pid}:users_bookmarked`);
             return await db.isMemberOfSets(sets, uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/bookmarks.js:63:34
         }
 
         if (Array.isArray(pid)) {
-            const sets = pid.map(pid => `pid:${pid}:users_bookmarked`);
+            const sets = pid.map(() => undefined);
             return await db.isMemberOfSets(sets, uid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
