[Killed] BlockStatement
src/posts/edit.js:18:37
 const translator = require('../translator');
 
 module.exports = function (Posts) {
-    pubsub.on('post:edit', (pid) => {
-        require('./cache').del(pid);
-    });
+    pubsub.on('post:edit', (pid) => {});
 
     Posts.edit = async function (data) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/edit.js:18:15
 const translator = require('../translator');
 
 module.exports = function (Posts) {
-    pubsub.on('post:edit', (pid) => {
+    pubsub.on("", (pid) => {
         require('./cache').del(pid);
     });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:24:13
 
     Posts.edit = async function (data) {
         const canEdit = await privileges.posts.canEdit(data.pid, data.uid);
-        if (!canEdit.flag) {
+        if (true) {
             throw new Error(canEdit.message);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/edit.js:24:13
 
     Posts.edit = async function (data) {
         const canEdit = await privileges.posts.canEdit(data.pid, data.uid);
-        if (!canEdit.flag) {
+        if (canEdit.flag) {
             throw new Error(canEdit.message);
         }
killedBy: GET /ping: should not error out when called
statusReason: Error

[Killed] BooleanLiteral
src/posts/edit.js:28:13
             throw new Error(canEdit.message);
         }
         const postData = await Posts.getPostData(data.pid);
-        if (!postData) {
+        if (postData) {
             throw new Error('[[error:no-post]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:28:13
             throw new Error(canEdit.message);
         }
         const postData = await Posts.getPostData(data.pid);
-        if (!postData) {
+        if (false) {
             throw new Error('[[error:no-post]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/edit.js:33:66
         }
 
         const topicData = await topics.getTopicFields(postData.tid, [
-            'cid', 'mainPid', 'title', 'timestamp', 'scheduled', 'slug', 'tags',
+            'cid', 'mainPid', 'title', 'timestamp', 'scheduled', "", 'tags',
         ]);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:41:13
         const oldContent = postData.content; // for diffing purposes
         const editPostData = getEditPostData(data, topicData, postData);
 
-        if (data.handle) {
+        if (false) {
             editPostData.handle = data.handle;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:41:13
         const oldContent = postData.content; // for diffing purposes
         const editPostData = getEditPostData(data, topicData, postData);
 
-        if (data.handle) {
+        if (true) {
             editPostData.handle = data.handle;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/edit.js:45:49
             editPostData.handle = data.handle;
         }
 
-        const result = await plugins.hooks.fire('filter:post.edit', {
+        const result = await plugins.hooks.fire("", {
             req: data.req,
             post: editPostData,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/edit.js:53:55
         });
 
         const [editor, topic] = await Promise.all([
-            user.getUserFields(data.uid, ['username', 'userslug']),
+            user.getUserFields(data.uid, ['username', ""]),
             editMainPost(data, postData, topicData),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/edit.js:58:32
         ]);
 
         await Posts.setPostFields(data.pid, result.post);
-        const contentChanged = data.content !== oldContent ||
+        const contentChanged = data.content === oldContent ||
             topic.renamed ||
             topic.tagsupdated;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/edit.js:58:32
         ]);
 
         await Posts.setPostFields(data.pid, result.post);
-        const contentChanged = data.content !== oldContent ||
-            topic.renamed ||
+        const contentChanged = data.content !== oldContent && topic.renamed ||
             topic.tagsupdated;
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/edit.js:62:13
             topic.renamed ||
             topic.tagsupdated;
 
-        if (meta.config.enablePostHistory === 1 && contentChanged) {
+        if (meta.config.enablePostHistory !== 1 && contentChanged) {
             await Posts.diffs.save({
                 pid: data.pid,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:62:13
             topic.renamed ||
             topic.tagsupdated;
 
-        if (meta.config.enablePostHistory === 1 && contentChanged) {
+        if (false) {
             await Posts.diffs.save({
                 pid: data.pid,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/edit.js:75:28
         await Posts.uploads.sync(data.pid);
 
         // Normalize data prior to constructing returnPostData (match types with getPostSummaryByPids)
-        postData.deleted = !!postData.deleted;
+        postData.deleted = !postData.deleted;
 
         const returnPostData = { ...postData, ...result.post };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/edit.js:108:36
 
     async function editMainPost(data, postData, topicData) {
         const { tid } = postData;
-        const title = data.title ? data.title.trim() : '';
+        const title = data.title ? data.title : '';
 
         const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/edit.js:108:56
 
     async function editMainPost(data, postData, topicData) {
         const { tid } = postData;
-        const title = data.title ? data.title.trim() : '';
+        const title = data.title ? data.title.trim() : "Stryker was here!";
 
         const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/edit.js:110:24
         const { tid } = postData;
         const title = data.title ? data.title.trim() : '';
 
-        const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
+        const isMain = parseInt(data.pid, 10) !== parseInt(topicData.mainPid, 10);
         if (!isMain) {
             return {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:110:24
         const { tid } = postData;
         const title = data.title ? data.title.trim() : '';
 
-        const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
+        const isMain = true;
         if (!isMain) {
             return {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:111:13
         const title = data.title ? data.title.trim() : '';
 
         const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
-        if (!isMain) {
+        if (false) {
             return {
                 tid: tid,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/edit.js:111:22
         const title = data.title ? data.title.trim() : '';
 
         const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
-        if (!isMain) {
-            return {
-                tid: tid,
-                cid: topicData.cid,
-                title: validator.escape(String(topicData.title)),
-                isMainPost: false,
-                renamed: false,
-                tagsupdated: false,
-            };
-        }
+        if (!isMain) {}
 
         const newTopicData = {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/edit.js:116:29
                 tid: tid,
                 cid: topicData.cid,
                 title: validator.escape(String(topicData.title)),
-                isMainPost: false,
+                isMainPost: true,
                 renamed: false,
                 tagsupdated: false,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/edit.js:117:26
                 cid: topicData.cid,
                 title: validator.escape(String(topicData.title)),
                 isMainPost: false,
-                renamed: false,
+                renamed: true,
                 tagsupdated: false,
             };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/edit.js:118:30
                 title: validator.escape(String(topicData.title)),
                 isMainPost: false,
                 renamed: false,
-                tagsupdated: false,
+                tagsupdated: true,
             };
         }
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] ConditionalExpression
src/posts/edit.js:129:13
             mainPid: data.pid,
             timestamp: rescheduling(data, topicData) ? data.timestamp : topicData.timestamp,
         };
-        if (title) {
+        if (true) {
             newTopicData.title = title;
             newTopicData.slug = `${tid}/${slugify(title) || 'topic'}`;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/edit.js:129:20
             mainPid: data.pid,
             timestamp: rescheduling(data, topicData) ? data.timestamp : topicData.timestamp,
         };
-        if (title) {
-            newTopicData.title = title;
-            newTopicData.slug = `${tid}/${slugify(title) || 'topic'}`;
-        }
+        if (title) {}
 
         const tagsupdated = Array.isArray(data.tags) &&
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/edit.js:131:43
         };
         if (title) {
             newTopicData.title = title;
-            newTopicData.slug = `${tid}/${slugify(title) || 'topic'}`;
+            newTopicData.slug = `${tid}/${slugify(title) && 'topic'}`;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:131:43
         };
         if (title) {
             newTopicData.title = title;
-            newTopicData.slug = `${tid}/${slugify(title) || 'topic'}`;
+            newTopicData.slug = `${tid}/${true}`;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:134:29
             newTopicData.slug = `${tid}/${slugify(title) || 'topic'}`;
         }
 
-        const tagsupdated = Array.isArray(data.tags) &&
-            !_.isEqual(data.tags, topicData.tags.map(tag => tag.value));
+        const tagsupdated = true;
 
         if (tagsupdated) {
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] ConditionalExpression
src/posts/edit.js:134:29
             newTopicData.slug = `${tid}/${slugify(title) || 'topic'}`;
         }
 
-        const tagsupdated = Array.isArray(data.tags) &&
-            !_.isEqual(data.tags, topicData.tags.map(tag => tag.value));
+        const tagsupdated = false;
 
         if (tagsupdated) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/edit.js:135:13
         }
 
         const tagsupdated = Array.isArray(data.tags) &&
-            !_.isEqual(data.tags, topicData.tags.map(tag => tag.value));
+            _.isEqual(data.tags, topicData.tags.map(tag => tag.value));
 
         if (tagsupdated) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/edit.js:135:54
         }
 
         const tagsupdated = Array.isArray(data.tags) &&
-            !_.isEqual(data.tags, topicData.tags.map(tag => tag.value));
+            !_.isEqual(data.tags, topicData.tags.map(() => undefined));
 
         if (tagsupdated) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:137:13
         const tagsupdated = Array.isArray(data.tags) &&
             !_.isEqual(data.tags, topicData.tags.map(tag => tag.value));
 
-        if (tagsupdated) {
+        if (true) {
             const canTag = await privileges.categories.can('topics:tag', topicData.cid, data.uid);
             if (!canTag) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:137:13
         const tagsupdated = Array.isArray(data.tags) &&
             !_.isEqual(data.tags, topicData.tags.map(tag => tag.value));
 
-        if (tagsupdated) {
+        if (false) {
             const canTag = await privileges.categories.can('topics:tag', topicData.cid, data.uid);
             if (!canTag) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:139:17
 
         if (tagsupdated) {
             const canTag = await privileges.categories.can('topics:tag', topicData.cid, data.uid);
-            if (!canTag) {
+            if (false) {
                 throw new Error('[[error:no-privileges]]');
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/edit.js:139:17
 
         if (tagsupdated) {
             const canTag = await privileges.categories.can('topics:tag', topicData.cid, data.uid);
-            if (!canTag) {
+            if (canTag) {
                 throw new Error('[[error:no-privileges]]');
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/edit.js:145:50
             await topics.validateTags(data.tags, topicData.cid, data.uid, tid);
         }
 
-        const results = await plugins.hooks.fire('filter:topic.edit', {
+        const results = await plugins.hooks.fire("", {
             req: data.req,
             topic: newTopicData,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/edit.js:150:28
             topic: newTopicData,
             data: data,
         });
-        await db.setObject(`topic:${tid}`, results.topic);
+        await db.setObject(``, results.topic);
         if (tagsupdated) {
             await topics.updateTopicTags(tid, data.tags);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:151:13
             data: data,
         });
         await db.setObject(`topic:${tid}`, results.topic);
-        if (tagsupdated) {
+        if (true) {
             await topics.updateTopicTags(tid, data.tags);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:151:13
             data: data,
         });
         await db.setObject(`topic:${tid}`, results.topic);
-        if (tagsupdated) {
+        if (false) {
             await topics.updateTopicTags(tid, data.tags);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/edit.js:156:44
         }
         const tags = await topics.getTopicTagsObjects(tid);
 
-        if (rescheduling(data, topicData)) {
-            await topics.scheduled.reschedule(newTopicData);
-        }
+        if (rescheduling(data, topicData)) {}
 
         newTopicData.tags = data.tags;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:156:13
         }
         const tags = await topics.getTopicTagsObjects(tid);
 
-        if (rescheduling(data, topicData)) {
+        if (true) {
             await topics.scheduled.reschedule(newTopicData);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:162:25
 
         newTopicData.tags = data.tags;
         newTopicData.oldTitle = topicData.title;
-        const renamed = title && translator.escape(validator.escape(String(title))) !== topicData.title;
+        const renamed = false;
         plugins.hooks.fire('action:topic.edit', { topic: newTopicData, uid: data.uid });
         return {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:162:25
 
         newTopicData.tags = data.tags;
         newTopicData.oldTitle = topicData.title;
-        const renamed = title && translator.escape(validator.escape(String(title))) !== topicData.title;
+        const renamed = true;
         plugins.hooks.fire('action:topic.edit', { topic: newTopicData, uid: data.uid });
         return {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/edit.js:163:49
         newTopicData.tags = data.tags;
         newTopicData.oldTitle = topicData.title;
         const renamed = title && translator.escape(validator.escape(String(title))) !== topicData.title;
-        plugins.hooks.fire('action:topic.edit', { topic: newTopicData, uid: data.uid });
+        plugins.hooks.fire('action:topic.edit', {});
         return {
             tid: tid,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:170:19
             uid: postData.uid,
             title: validator.escape(String(title)),
             oldTitle: topicData.title,
-            slug: newTopicData.slug || topicData.slug,
+            slug: true,
             isMainPost: true,
             renamed: renamed,
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] ConditionalExpression
src/posts/edit.js:170:19
             uid: postData.uid,
             title: validator.escape(String(title)),
             oldTitle: topicData.title,
-            slug: newTopicData.slug || topicData.slug,
+            slug: false,
             isMainPost: true,
             renamed: renamed,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/edit.js:171:25
             title: validator.escape(String(title)),
             oldTitle: topicData.title,
             slug: newTopicData.slug || topicData.slug,
-            isMainPost: true,
+            isMainPost: false,
             renamed: renamed,
             tagsupdated: tagsupdated,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/edit.js:180:57
         };
     }
 
-    async function scheduledTopicCheck(data, topicData) {
-        if (!topicData.scheduled) {
-            return;
-        }
-        const canSchedule = await privileges.categories.can('topics:schedule', topicData.cid, data.uid);
-        if (!canSchedule) {
-            throw new Error('[[error:no-privileges]]');
-        }
-        const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
-        if (isMain && (isNaN(data.timestamp) || data.timestamp < Date.now())) {
-            throw new Error('[[error:invalid-data]]');
-        }
-    }
+    async function scheduledTopicCheck(data, topicData) {}
 
     function getEditPostData(data, topicData, postData) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:181:13
     }
 
     async function scheduledTopicCheck(data, topicData) {
-        if (!topicData.scheduled) {
+        if (true) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/edit.js:181:35
     }
 
     async function scheduledTopicCheck(data, topicData) {
-        if (!topicData.scheduled) {
-            return;
-        }
+        if (!topicData.scheduled) {}
         const canSchedule = await privileges.categories.can('topics:schedule', topicData.cid, data.uid);
         if (!canSchedule) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:185:13
             return;
         }
         const canSchedule = await privileges.categories.can('topics:schedule', topicData.cid, data.uid);
-        if (!canSchedule) {
+        if (true) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:185:13
             return;
         }
         const canSchedule = await privileges.categories.can('topics:schedule', topicData.cid, data.uid);
-        if (!canSchedule) {
+        if (false) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:188:24
         if (!canSchedule) {
             throw new Error('[[error:no-privileges]]');
         }
-        const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
+        const isMain = true;
         if (isMain && (isNaN(data.timestamp) || data.timestamp < Date.now())) {
             throw new Error('[[error:invalid-data]]');
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/edit.js:188:24
         if (!canSchedule) {
             throw new Error('[[error:no-privileges]]');
         }
-        const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
+        const isMain = parseInt(data.pid, 10) !== parseInt(topicData.mainPid, 10);
         if (isMain && (isNaN(data.timestamp) || data.timestamp < Date.now())) {
             throw new Error('[[error:invalid-data]]');
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/edit.js:189:79
             throw new Error('[[error:no-privileges]]');
         }
         const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
-        if (isMain && (isNaN(data.timestamp) || data.timestamp < Date.now())) {
-            throw new Error('[[error:invalid-data]]');
-        }
+        if (isMain && (isNaN(data.timestamp) || data.timestamp < Date.now())) {}
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:189:49
             throw new Error('[[error:no-privileges]]');
         }
         const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
-        if (isMain && (isNaN(data.timestamp) || data.timestamp < Date.now())) {
+        if (isMain && (isNaN(data.timestamp) || false)) {
             throw new Error('[[error:invalid-data]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/edit.js:190:29
         }
         const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
         if (isMain && (isNaN(data.timestamp) || data.timestamp < Date.now())) {
-            throw new Error('[[error:invalid-data]]');
+            throw new Error("");
         }
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/edit.js:194:57
         }
     }
 
-    function getEditPostData(data, topicData, postData) {
-        const editPostData = {
-            content: data.content,
-            editor: data.uid,
-        };
-
-        // For posts in scheduled topics, if edited before, use edit timestamp
-        editPostData.edited = topicData.scheduled ? (postData.edited || postData.timestamp) + 1 : Date.now();
-
-        // if rescheduling the main post
-        if (rescheduling(data, topicData)) {
-            // For main posts, use timestamp coming from user (otherwise, it is ignored)
-            editPostData.edited = data.timestamp;
-            editPostData.timestamp = data.timestamp;
-        }
-
-        return editPostData;
-    }
+    function getEditPostData(data, topicData, postData) {}
 
     function rescheduling(data, topicData) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/edit.js:195:30
     }
 
     function getEditPostData(data, topicData, postData) {
-        const editPostData = {
-            content: data.content,
-            editor: data.uid,
-        };
+        const editPostData = {};
 
         // For posts in scheduled topics, if edited before, use edit timestamp
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/edit.js:201:53
         };
 
         // For posts in scheduled topics, if edited before, use edit timestamp
-        editPostData.edited = topicData.scheduled ? (postData.edited || postData.timestamp) + 1 : Date.now();
+        editPostData.edited = topicData.scheduled ? (postData.edited || postData.timestamp) - 1 : Date.now();
 
         // if rescheduling the main post
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:201:54
         };
 
         // For posts in scheduled topics, if edited before, use edit timestamp
-        editPostData.edited = topicData.scheduled ? (postData.edited || postData.timestamp) + 1 : Date.now();
+        editPostData.edited = topicData.scheduled ? (true) + 1 : Date.now();
 
         // if rescheduling the main post
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]
