[Killed] StringLiteral
src/posts/cache.js:7:11
 const meta = require('../meta');
 
 module.exports = cacheCreate({
-    name: 'post',
+    name: "",
     maxSize: meta.config.postCacheSize,
     sizeCalculation: function (n) { return n.length || 1; },
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/cache.js:9:44
 module.exports = cacheCreate({
     name: 'post',
     maxSize: meta.config.postCacheSize,
-    sizeCalculation: function (n) { return n.length || 1; },
+    sizeCalculation: function (n) { return n.length && 1; },
     ttl: 0,
     enabled: global.env === 'production',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/cache.js:9:44
 module.exports = cacheCreate({
     name: 'post',
     maxSize: meta.config.postCacheSize,
-    sizeCalculation: function (n) { return n.length || 1; },
+    sizeCalculation: function (n) { return true; },
     ttl: 0,
     enabled: global.env === 'production',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/cache.js:11:14
     maxSize: meta.config.postCacheSize,
     sizeCalculation: function (n) { return n.length || 1; },
     ttl: 0,
-    enabled: global.env === 'production',
+    enabled: global.env !== 'production',
 });
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/cache.js:11:14
     maxSize: meta.config.postCacheSize,
     sizeCalculation: function (n) { return n.length || 1; },
     ttl: 0,
-    enabled: global.env === 'production',
+    enabled: false,
 });
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
