[Killed] ConditionalExpression
src/posts/edit.js:204:13
         editPostData.edited = topicData.scheduled ? (postData.edited || postData.timestamp) + 1 : Date.now();
 
         // if rescheduling the main post
-        if (rescheduling(data, topicData)) {
+        if (false) {
             // For main posts, use timestamp coming from user (otherwise, it is ignored)
             editPostData.edited = data.timestamp;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/edit.js:204:44
         editPostData.edited = topicData.scheduled ? (postData.edited || postData.timestamp) + 1 : Date.now();
 
         // if rescheduling the main post
-        if (rescheduling(data, topicData)) {
-            // For main posts, use timestamp coming from user (otherwise, it is ignored)
-            editPostData.edited = data.timestamp;
-            editPostData.timestamp = data.timestamp;
-        }
+        if (rescheduling(data, topicData)) {}
 
         return editPostData;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/edit.js:213:44
         return editPostData;
     }
 
-    function rescheduling(data, topicData) {
-        const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
-        return isMain && topicData.scheduled && topicData.timestamp !== data.timestamp;
-    }
+    function rescheduling(data, topicData) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:214:24
     }
 
     function rescheduling(data, topicData) {
-        const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
+        const isMain = true;
         return isMain && topicData.scheduled && topicData.timestamp !== data.timestamp;
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:214:24
     }
 
     function rescheduling(data, topicData) {
-        const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
+        const isMain = false;
         return isMain && topicData.scheduled && topicData.timestamp !== data.timestamp;
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/edit.js:215:16
 
     function rescheduling(data, topicData) {
         const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
-        return isMain && topicData.scheduled && topicData.timestamp !== data.timestamp;
+        return isMain && topicData.scheduled || topicData.timestamp !== data.timestamp;
     }
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/edit.js:215:16
 
     function rescheduling(data, topicData) {
         const isMain = parseInt(data.pid, 10) === parseInt(topicData.mainPid, 10);
-        return isMain && topicData.scheduled && topicData.timestamp !== data.timestamp;
+        return false;
     }
 };
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-user]]
