[Killed] BlockStatement
src/posts/index.js:31:38
 require('./uploads')(Posts);
 require('./endorse')(Posts);
 
-Posts.exists = async function (pids) {
-    return await db.exists(
-        Array.isArray(pids) ? pids.map(pid => `post:${pid}`) : `post:${pids}`
-    );
-};
+Posts.exists = async function (pids) {};
 
 Posts.getPidsFromSet = async function (set, start, stop, reverse) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/index.js:33:40
 
 Posts.exists = async function (pids) {
     return await db.exists(
-        Array.isArray(pids) ? pids.map(pid => `post:${pid}`) : `post:${pids}`
+        Array.isArray(pids) ? pids.map(() => undefined) : `post:${pids}`
     );
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/index.js:37:67
     );
 };
 
-Posts.getPidsFromSet = async function (set, start, stop, reverse) {
-    if (isNaN(start) || isNaN(stop)) {
-        return [];
-    }
-    return await db[reverse ? 'getSortedSetRevRange' : 'getSortedSetRange'](set, start, stop);
-};
+Posts.getPidsFromSet = async function (set, start, stop, reverse) {};
 
 Posts.getPostsByPids = async function (pids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/index.js:38:9
 };
 
 Posts.getPidsFromSet = async function (set, start, stop, reverse) {
-    if (isNaN(start) || isNaN(stop)) {
+    if (isNaN(start) && isNaN(stop)) {
         return [];
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/index.js:38:38
 };
 
 Posts.getPidsFromSet = async function (set, start, stop, reverse) {
-    if (isNaN(start) || isNaN(stop)) {
-        return [];
-    }
+    if (isNaN(start) || isNaN(stop)) {}
     return await db[reverse ? 'getSortedSetRevRange' : 'getSortedSetRange'](set, start, stop);
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/index.js:44:51
     return await db[reverse ? 'getSortedSetRevRange' : 'getSortedSetRange'](set, start, stop);
 };
 
-Posts.getPostsByPids = async function (pids, uid) {
-    if (!Array.isArray(pids) || !pids.length) {
-        return [];
-    }
-    let posts = await Posts.getPostsData(pids);
-    posts = await Promise.all(posts.map(Posts.parsePost));
-    const data = await plugins.hooks.fire('filter:post.getPosts', { posts: posts, uid: uid });
-    if (!data || !Array.isArray(data.posts)) {
-        return [];
-    }
-    return data.posts.filter(Boolean);
-};
+Posts.getPostsByPids = async function (pids, uid) {};
 
 Posts.getPostSummariesFromSet = async function (set, uid, start, stop) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/index.js:45:33
 };
 
 Posts.getPostsByPids = async function (pids, uid) {
-    if (!Array.isArray(pids) || !pids.length) {
+    if (!Array.isArray(pids) || pids.length) {
         return [];
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/index.js:45:9
 };
 
 Posts.getPostsByPids = async function (pids, uid) {
-    if (!Array.isArray(pids) || !pids.length) {
+    if (false) {
         return [];
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/index.js:50:43
     }
     let posts = await Posts.getPostsData(pids);
     posts = await Promise.all(posts.map(Posts.parsePost));
-    const data = await plugins.hooks.fire('filter:post.getPosts', { posts: posts, uid: uid });
+    const data = await plugins.hooks.fire("", { posts: posts, uid: uid });
     if (!data || !Array.isArray(data.posts)) {
         return [];
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-category]]

[Killed] BooleanLiteral
src/posts/index.js:51:9
     let posts = await Posts.getPostsData(pids);
     posts = await Promise.all(posts.map(Posts.parsePost));
     const data = await plugins.hooks.fire('filter:post.getPosts', { posts: posts, uid: uid });
-    if (!data || !Array.isArray(data.posts)) {
+    if (data || !Array.isArray(data.posts)) {
         return [];
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/index.js:51:46
     let posts = await Posts.getPostsData(pids);
     posts = await Promise.all(posts.map(Posts.parsePost));
     const data = await plugins.hooks.fire('filter:post.getPosts', { posts: posts, uid: uid });
-    if (!data || !Array.isArray(data.posts)) {
-        return [];
-    }
+    if (!data || !Array.isArray(data.posts)) {}
     return data.posts.filter(Boolean);
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/index.js:54:12
     if (!data || !Array.isArray(data.posts)) {
         return [];
     }
-    return data.posts.filter(Boolean);
+    return data.posts;
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/index.js:57:72
     return data.posts.filter(Boolean);
 };
 
-Posts.getPostSummariesFromSet = async function (set, uid, start, stop) {
-    let pids = await db.getSortedSetRevRange(set, start, stop);
-    pids = await privileges.posts.filter('topics:read', pids, uid);
-    const posts = await Posts.getPostSummaryByPids(pids, uid, { stripTags: false });
-    return { posts: posts, nextStart: stop + 1 };
-};
+Posts.getPostSummariesFromSet = async function (set, uid, start, stop) {};
 
 Posts.getPidIndex = async function (pid, tid, topicPostSort) {
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-user]]

[Killed] MethodExpression
src/posts/index.js:59:18
 
 Posts.getPostSummariesFromSet = async function (set, uid, start, stop) {
     let pids = await db.getSortedSetRevRange(set, start, stop);
-    pids = await privileges.posts.filter('topics:read', pids, uid);
+    pids = await privileges.posts;
     const posts = await Posts.getPostSummaryByPids(pids, uid, { stripTags: false });
     return { posts: posts, nextStart: stop + 1 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/index.js:60:76
 Posts.getPostSummariesFromSet = async function (set, uid, start, stop) {
     let pids = await db.getSortedSetRevRange(set, start, stop);
     pids = await privileges.posts.filter('topics:read', pids, uid);
-    const posts = await Posts.getPostSummaryByPids(pids, uid, { stripTags: false });
+    const posts = await Posts.getPostSummaryByPids(pids, uid, { stripTags: true });
     return { posts: posts, nextStart: stop + 1 };
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/index.js:61:39
     let pids = await db.getSortedSetRevRange(set, start, stop);
     pids = await privileges.posts.filter('topics:read', pids, uid);
     const posts = await Posts.getPostSummaryByPids(pids, uid, { stripTags: false });
-    return { posts: posts, nextStart: stop + 1 };
+    return { posts: posts, nextStart: stop - 1 };
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/index.js:64:62
     return { posts: posts, nextStart: stop + 1 };
 };
 
-Posts.getPidIndex = async function (pid, tid, topicPostSort) {
-    const set = topicPostSort === 'most_votes' ? `tid:${tid}:posts:votes` : `tid:${tid}:posts`;
-    const reverse = topicPostSort === 'newest_to_oldest' || topicPostSort === 'most_votes';
-    const index = await db[reverse ? 'sortedSetRevRank' : 'sortedSetRank'](set, pid);
-    if (!utils.isNumber(index)) {
-        return 0;
-    }
-    return utils.isNumber(index) ? parseInt(index, 10) + 1 : 0;
-};
+Posts.getPidIndex = async function (pid, tid, topicPostSort) {};
 
 Posts.getPostIndices = async function (posts, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/index.js:65:17
 };
 
 Posts.getPidIndex = async function (pid, tid, topicPostSort) {
-    const set = topicPostSort === 'most_votes' ? `tid:${tid}:posts:votes` : `tid:${tid}:posts`;
+    const set = false ? `tid:${tid}:posts:votes` : `tid:${tid}:posts`;
     const reverse = topicPostSort === 'newest_to_oldest' || topicPostSort === 'most_votes';
     const index = await db[reverse ? 'sortedSetRevRank' : 'sortedSetRank'](set, pid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/index.js:65:17
 };
 
 Posts.getPidIndex = async function (pid, tid, topicPostSort) {
-    const set = topicPostSort === 'most_votes' ? `tid:${tid}:posts:votes` : `tid:${tid}:posts`;
+    const set = true ? `tid:${tid}:posts:votes` : `tid:${tid}:posts`;
     const reverse = topicPostSort === 'newest_to_oldest' || topicPostSort === 'most_votes';
     const index = await db[reverse ? 'sortedSetRevRank' : 'sortedSetRank'](set, pid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/index.js:66:21
 
 Posts.getPidIndex = async function (pid, tid, topicPostSort) {
     const set = topicPostSort === 'most_votes' ? `tid:${tid}:posts:votes` : `tid:${tid}:posts`;
-    const reverse = topicPostSort === 'newest_to_oldest' || topicPostSort === 'most_votes';
+    const reverse = topicPostSort !== 'newest_to_oldest' || topicPostSort === 'most_votes';
     const index = await db[reverse ? 'sortedSetRevRank' : 'sortedSetRank'](set, pid);
     if (!utils.isNumber(index)) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/index.js:66:61
 
 Posts.getPidIndex = async function (pid, tid, topicPostSort) {
     const set = topicPostSort === 'most_votes' ? `tid:${tid}:posts:votes` : `tid:${tid}:posts`;
-    const reverse = topicPostSort === 'newest_to_oldest' || topicPostSort === 'most_votes';
+    const reverse = topicPostSort === 'newest_to_oldest' || topicPostSort !== 'most_votes';
     const index = await db[reverse ? 'sortedSetRevRank' : 'sortedSetRank'](set, pid);
     if (!utils.isNumber(index)) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/index.js:67:59
 Posts.getPidIndex = async function (pid, tid, topicPostSort) {
     const set = topicPostSort === 'most_votes' ? `tid:${tid}:posts:votes` : `tid:${tid}:posts`;
     const reverse = topicPostSort === 'newest_to_oldest' || topicPostSort === 'most_votes';
-    const index = await db[reverse ? 'sortedSetRevRank' : 'sortedSetRank'](set, pid);
+    const index = await db[reverse ? 'sortedSetRevRank' : ""](set, pid);
     if (!utils.isNumber(index)) {
         return 0;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/index.js:67:38
 Posts.getPidIndex = async function (pid, tid, topicPostSort) {
     const set = topicPostSort === 'most_votes' ? `tid:${tid}:posts:votes` : `tid:${tid}:posts`;
     const reverse = topicPostSort === 'newest_to_oldest' || topicPostSort === 'most_votes';
-    const index = await db[reverse ? 'sortedSetRevRank' : 'sortedSetRank'](set, pid);
+    const index = await db[reverse ? "" : 'sortedSetRank'](set, pid);
     if (!utils.isNumber(index)) {
         return 0;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/index.js:68:9
     const set = topicPostSort === 'most_votes' ? `tid:${tid}:posts:votes` : `tid:${tid}:posts`;
     const reverse = topicPostSort === 'newest_to_oldest' || topicPostSort === 'most_votes';
     const index = await db[reverse ? 'sortedSetRevRank' : 'sortedSetRank'](set, pid);
-    if (!utils.isNumber(index)) {
+    if (true) {
         return 0;
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/index.js:68:9
     const set = topicPostSort === 'most_votes' ? `tid:${tid}:posts:votes` : `tid:${tid}:posts`;
     const reverse = topicPostSort === 'newest_to_oldest' || topicPostSort === 'most_votes';
     const index = await db[reverse ? 'sortedSetRevRank' : 'sortedSetRank'](set, pid);
-    if (!utils.isNumber(index)) {
+    if (false) {
         return 0;
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/index.js:71:36
     if (!utils.isNumber(index)) {
         return 0;
     }
-    return utils.isNumber(index) ? parseInt(index, 10) + 1 : 0;
+    return utils.isNumber(index) ? parseInt(index, 10) - 1 : 0;
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/index.js:74:52
     return utils.isNumber(index) ? parseInt(index, 10) + 1 : 0;
 };
 
-Posts.getPostIndices = async function (posts, uid) {
-    if (!Array.isArray(posts) || !posts.length) {
-        return [];
-    }
-    const settings = await user.getSettings(uid);
-
-    const byVotes = settings.topicPostSort === 'most_votes';
-    let sets = posts.map(p => (byVotes ? `tid:${p.tid}:posts:votes` : `tid:${p.tid}:posts`));
-    const reverse = settings.topicPostSort === 'newest_to_oldest' || settings.topicPostSort === 'most_votes';
-
-    const uniqueSets = _.uniq(sets);
-    let method = reverse ? 'sortedSetsRevRanks' : 'sortedSetsRanks';
-    if (uniqueSets.length === 1) {
-        method = reverse ? 'sortedSetRevRanks' : 'sortedSetRanks';
-        sets = uniqueSets[0];
-    }
-
-    const pids = posts.map(post => post.pid);
-    const indices = await db[method](sets, pids);
-    return indices.map(index => (utils.isNumber(index) ? parseInt(index, 10) + 1 : 0));
-};
+Posts.getPostIndices = async function (posts, uid) {};
 
 Posts.modifyPostByPrivilege = function (post, privileges) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/index.js:75:9
 };
 
 Posts.getPostIndices = async function (posts, uid) {
-    if (!Array.isArray(posts) || !posts.length) {
+    if (false) {
         return [];
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/index.js:75:9
 };
 
 Posts.getPostIndices = async function (posts, uid) {
-    if (!Array.isArray(posts) || !posts.length) {
+    if (Array.isArray(posts) || !posts.length) {
         return [];
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/index.js:80:21
     }
     const settings = await user.getSettings(uid);
 
-    const byVotes = settings.topicPostSort === 'most_votes';
+    const byVotes = true;
     let sets = posts.map(p => (byVotes ? `tid:${p.tid}:posts:votes` : `tid:${p.tid}:posts`));
     const reverse = settings.topicPostSort === 'newest_to_oldest' || settings.topicPostSort === 'most_votes';
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/index.js:80:21
     }
     const settings = await user.getSettings(uid);
 
-    const byVotes = settings.topicPostSort === 'most_votes';
+    const byVotes = false;
     let sets = posts.map(p => (byVotes ? `tid:${p.tid}:posts:votes` : `tid:${p.tid}:posts`));
     const reverse = settings.topicPostSort === 'newest_to_oldest' || settings.topicPostSort === 'most_votes';
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/index.js:81:26
     const settings = await user.getSettings(uid);
 
     const byVotes = settings.topicPostSort === 'most_votes';
-    let sets = posts.map(p => (byVotes ? `tid:${p.tid}:posts:votes` : `tid:${p.tid}:posts`));
+    let sets = posts.map(() => undefined);
     const reverse = settings.topicPostSort === 'newest_to_oldest' || settings.topicPostSort === 'most_votes';
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/index.js:82:21
 
     const byVotes = settings.topicPostSort === 'most_votes';
     let sets = posts.map(p => (byVotes ? `tid:${p.tid}:posts:votes` : `tid:${p.tid}:posts`));
-    const reverse = settings.topicPostSort === 'newest_to_oldest' || settings.topicPostSort === 'most_votes';
+    const reverse = settings.topicPostSort === 'newest_to_oldest' && settings.topicPostSort === 'most_votes';
 
     const uniqueSets = _.uniq(sets);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/index.js:82:21
 
     const byVotes = settings.topicPostSort === 'most_votes';
     let sets = posts.map(p => (byVotes ? `tid:${p.tid}:posts:votes` : `tid:${p.tid}:posts`));
-    const reverse = settings.topicPostSort === 'newest_to_oldest' || settings.topicPostSort === 'most_votes';
+    const reverse = false;
 
     const uniqueSets = _.uniq(sets);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/index.js:86:9
 
     const uniqueSets = _.uniq(sets);
     let method = reverse ? 'sortedSetsRevRanks' : 'sortedSetsRanks';
-    if (uniqueSets.length === 1) {
+    if (false) {
         method = reverse ? 'sortedSetRevRanks' : 'sortedSetRanks';
         sets = uniqueSets[0];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/index.js:86:9
 
     const uniqueSets = _.uniq(sets);
     let method = reverse ? 'sortedSetsRevRanks' : 'sortedSetsRanks';
-    if (uniqueSets.length === 1) {
+    if (true) {
         method = reverse ? 'sortedSetRevRanks' : 'sortedSetRanks';
         sets = uniqueSets[0];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/index.js:87:50
     const uniqueSets = _.uniq(sets);
     let method = reverse ? 'sortedSetsRevRanks' : 'sortedSetsRanks';
     if (uniqueSets.length === 1) {
-        method = reverse ? 'sortedSetRevRanks' : 'sortedSetRanks';
+        method = reverse ? 'sortedSetRevRanks' : "";
         sets = uniqueSets[0];
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/index.js:91:28
         sets = uniqueSets[0];
     }
 
-    const pids = posts.map(post => post.pid);
+    const pids = posts.map(() => undefined);
     const indices = await db[method](sets, pids);
     return indices.map(index => (utils.isNumber(index) ? parseInt(index, 10) + 1 : 0));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/index.js:93:58
 
     const pids = posts.map(post => post.pid);
     const indices = await db[method](sets, pids);
-    return indices.map(index => (utils.isNumber(index) ? parseInt(index, 10) + 1 : 0));
+    return indices.map(index => (utils.isNumber(index) ? parseInt(index, 10) - 1 : 0));
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/index.js:93:24
 
     const pids = posts.map(post => post.pid);
     const indices = await db[method](sets, pids);
-    return indices.map(index => (utils.isNumber(index) ? parseInt(index, 10) + 1 : 0));
+    return indices.map(() => undefined);
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/index.js:96:59
     return indices.map(index => (utils.isNumber(index) ? parseInt(index, 10) + 1 : 0));
 };
 
-Posts.modifyPostByPrivilege = function (post, privileges) {
-    if (post && post.deleted && !(post.selfPost || privileges['posts:view_deleted'])) {
-        post.content = '[[topic:post_is_deleted]]';
-        if (post.user) {
-            post.user.signature = '';
-        }
-    }
-};
+Posts.modifyPostByPrivilege = function (post, privileges) {};
 
 require('../promisify')(Posts);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/index.js:97:35
 };
 
 Posts.modifyPostByPrivilege = function (post, privileges) {
-    if (post && post.deleted && !(post.selfPost || privileges['posts:view_deleted'])) {
+    if (post && post.deleted && !(true)) {
         post.content = '[[topic:post_is_deleted]]';
         if (post.user) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/index.js:97:9
 };
 
 Posts.modifyPostByPrivilege = function (post, privileges) {
-    if (post && post.deleted && !(post.selfPost || privileges['posts:view_deleted'])) {
+    if (false) {
         post.content = '[[topic:post_is_deleted]]';
         if (post.user) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/index.js:99:24
 Posts.modifyPostByPrivilege = function (post, privileges) {
     if (post && post.deleted && !(post.selfPost || privileges['posts:view_deleted'])) {
         post.content = '[[topic:post_is_deleted]]';
-        if (post.user) {
-            post.user.signature = '';
-        }
+        if (post.user) {}
     }
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/index.js:99:13
 Posts.modifyPostByPrivilege = function (post, privileges) {
     if (post && post.deleted && !(post.selfPost || privileges['posts:view_deleted'])) {
         post.content = '[[topic:post_is_deleted]]';
-        if (post.user) {
+        if (true) {
             post.user.signature = '';
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
