[Killed] BlockStatement
src/posts/category.js:11:46
 const topics = require('../topics');
 
 module.exports = function (Posts) {
-    Posts.getCidByPid = async function (pid) {
-        const tid = await Posts.getPostField(pid, 'tid');
-        return await topics.getTopicField(tid, 'cid');
-    };
+    Posts.getCidByPid = async function (pid) {};
 
     Posts.getCidsByPids = async function (pids) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/category.js:13:48
 module.exports = function (Posts) {
     Posts.getCidByPid = async function (pid) {
         const tid = await Posts.getPostField(pid, 'tid');
-        return await topics.getTopicField(tid, 'cid');
+        return await topics.getTopicField(tid, "");
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/category.js:16:49
         return await topics.getTopicField(tid, 'cid');
     };
 
-    Posts.getCidsByPids = async function (pids) {
-        const postData = await Posts.getPostsFields(pids, ['tid']);
-        const tids = _.uniq(postData.map(post => post && post.tid).filter(Boolean));
-        const topicData = await topics.getTopicsFields(tids, ['cid']);
-        const tidToTopic = _.zipObject(tids, topicData);
-        const cids = postData.map(post => tidToTopic[post.tid] && tidToTopic[post.tid].cid);
-        return cids;
-    };
+    Posts.getCidsByPids = async function (pids) {};
 
     Posts.filterPidsByCid = async function (pids, cid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/category.js:18:50
 
     Posts.getCidsByPids = async function (pids) {
         const postData = await Posts.getPostsFields(pids, ['tid']);
-        const tids = _.uniq(postData.map(post => post && post.tid).filter(Boolean));
+        const tids = _.uniq(postData.map(post => true).filter(Boolean));
         const topicData = await topics.getTopicsFields(tids, ['cid']);
         const tidToTopic = _.zipObject(tids, topicData);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/category.js:18:50
 
     Posts.getCidsByPids = async function (pids) {
         const postData = await Posts.getPostsFields(pids, ['tid']);
-        const tids = _.uniq(postData.map(post => post && post.tid).filter(Boolean));
+        const tids = _.uniq(postData.map(post => post || post.tid).filter(Boolean));
         const topicData = await topics.getTopicsFields(tids, ['cid']);
         const tidToTopic = _.zipObject(tids, topicData);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/category.js:21:43
         const tids = _.uniq(postData.map(post => post && post.tid).filter(Boolean));
         const topicData = await topics.getTopicsFields(tids, ['cid']);
         const tidToTopic = _.zipObject(tids, topicData);
-        const cids = postData.map(post => tidToTopic[post.tid] && tidToTopic[post.tid].cid);
+        const cids = postData.map(post => tidToTopic[post.tid] || tidToTopic[post.tid].cid);
         return cids;
     };
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] ArrowFunction
src/posts/category.js:21:35
         const tids = _.uniq(postData.map(post => post && post.tid).filter(Boolean));
         const topicData = await topics.getTopicsFields(tids, ['cid']);
         const tidToTopic = _.zipObject(tids, topicData);
-        const cids = postData.map(post => tidToTopic[post.tid] && tidToTopic[post.tid].cid);
+        const cids = postData.map(() => undefined);
         return cids;
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/category.js:25:56
         return cids;
     };
 
-    Posts.filterPidsByCid = async function (pids, cid) {
-        if (!cid) {
-            return pids;
-        }
-
-        if (!Array.isArray(cid) || cid.length === 1) {
-            return await filterPidsBySingleCid(pids, cid);
-        }
-        const pidsArr = await Promise.all(cid.map(c => Posts.filterPidsByCid(pids, c)));
-        return _.union(...pidsArr);
-    };
+    Posts.filterPidsByCid = async function (pids, cid) {};
 
     async function filterPidsBySingleCid(pids, cid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/category.js:26:13
     };
 
     Posts.filterPidsByCid = async function (pids, cid) {
-        if (!cid) {
+        if (true) {
             return pids;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/category.js:26:13
     };
 
     Posts.filterPidsByCid = async function (pids, cid) {
-        if (!cid) {
+        if (false) {
             return pids;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/category.js:30:13
             return pids;
         }
 
-        if (!Array.isArray(cid) || cid.length === 1) {
+        if (Array.isArray(cid) || cid.length === 1) {
             return await filterPidsBySingleCid(pids, cid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/category.js:30:13
             return pids;
         }
 
-        if (!Array.isArray(cid) || cid.length === 1) {
+        if (false) {
             return await filterPidsBySingleCid(pids, cid);
         }
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-user]]

[Killed] ArrowFunction
src/posts/category.js:33:51
         if (!Array.isArray(cid) || cid.length === 1) {
             return await filterPidsBySingleCid(pids, cid);
         }
-        const pidsArr = await Promise.all(cid.map(c => Posts.filterPidsByCid(pids, c)));
+        const pidsArr = await Promise.all(cid.map(() => undefined));
         return _.union(...pidsArr);
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/category.js:37:53
         return _.union(...pidsArr);
     };
 
-    async function filterPidsBySingleCid(pids, cid) {
-        const isMembers = await db.isSortedSetMembers(`cid:${parseInt(cid, 10)}:pids`, pids);
-        return pids.filter((pid, index) => pid && isMembers[index]);
-    }
+    async function filterPidsBySingleCid(pids, cid) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/category.js:38:55
     };
 
     async function filterPidsBySingleCid(pids, cid) {
-        const isMembers = await db.isSortedSetMembers(`cid:${parseInt(cid, 10)}:pids`, pids);
+        const isMembers = await db.isSortedSetMembers(``, pids);
         return pids.filter((pid, index) => pid && isMembers[index]);
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/category.js:39:44
 
     async function filterPidsBySingleCid(pids, cid) {
         const isMembers = await db.isSortedSetMembers(`cid:${parseInt(cid, 10)}:pids`, pids);
-        return pids.filter((pid, index) => pid && isMembers[index]);
+        return pids.filter((pid, index) => true);
     }
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/category.js:39:28
 
     async function filterPidsBySingleCid(pids, cid) {
         const isMembers = await db.isSortedSetMembers(`cid:${parseInt(cid, 10)}:pids`, pids);
-        return pids.filter((pid, index) => pid && isMembers[index]);
+        return pids.filter(() => undefined);
     }
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
