[Killed] BooleanLiteral
src/posts/queue.js:22:31
 
 module.exports = function (Posts) {
     Posts.getQueuedPosts = async (filter = {}, options = {}) => {
-        options = { metadata: true, ...options }; // defaults
+        options = { metadata: false, ...options }; // defaults
         let postData = _.cloneDeep(cache.get('post-queue'));
         if (!postData) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/queue.js:22:19
 
 module.exports = function (Posts) {
     Posts.getQueuedPosts = async (filter = {}, options = {}) => {
-        options = { metadata: true, ...options }; // defaults
+        options = {}; // defaults
         let postData = _.cloneDeep(cache.get('post-queue'));
         if (!postData) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:24:13
     Posts.getQueuedPosts = async (filter = {}, options = {}) => {
         options = { metadata: true, ...options }; // defaults
         let postData = _.cloneDeep(cache.get('post-queue'));
-        if (!postData) {
+        if (true) {
             const ids = await db.getSortedSetRange('post:queue', 0, -1);
             const keys = ids.map(id => `post:queue:${id}`);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:24:13
     Posts.getQueuedPosts = async (filter = {}, options = {}) => {
         options = { metadata: true, ...options }; // defaults
         let postData = _.cloneDeep(cache.get('post-queue'));
-        if (!postData) {
+        if (false) {
             const ids = await db.getSortedSetRange('post:queue', 0, -1);
             const keys = ids.map(id => `post:queue:${id}`);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] UnaryOperator
src/posts/queue.js:25:69
         options = { metadata: true, ...options }; // defaults
         let postData = _.cloneDeep(cache.get('post-queue'));
         if (!postData) {
-            const ids = await db.getSortedSetRange('post:queue', 0, -1);
+            const ids = await db.getSortedSetRange('post:queue', 0, +1);
             const keys = ids.map(id => `post:queue:${id}`);
             postData = await db.getObjects(keys);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/queue.js:26:34
         let postData = _.cloneDeep(cache.get('post-queue'));
         if (!postData) {
             const ids = await db.getSortedSetRange('post:queue', 0, -1);
-            const keys = ids.map(id => `post:queue:${id}`);
+            const keys = ids.map(() => undefined);
             postData = await db.getObjects(keys);
             postData.forEach((data) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:28:40
             const ids = await db.getSortedSetRange('post:queue', 0, -1);
             const keys = ids.map(id => `post:queue:${id}`);
             postData = await db.getObjects(keys);
-            postData.forEach((data) => {
-                if (data) {
-                    data.data = JSON.parse(data.data);
-                    data.data.timestampISO = utils.toISOString(data.data.timestamp);
-                }
-            });
+            postData.forEach((data) => {});
             const uids = postData.map(data => data && data.uid);
             const userData = await user.getUsersFields(uids, ['username', 'userslug', 'picture']);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:29:21
             const keys = ids.map(id => `post:queue:${id}`);
             postData = await db.getObjects(keys);
             postData.forEach((data) => {
-                if (data) {
+                if (false) {
                     data.data = JSON.parse(data.data);
                     data.data.timestampISO = utils.toISOString(data.data.timestamp);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:29:27
             const keys = ids.map(id => `post:queue:${id}`);
             postData = await db.getObjects(keys);
             postData.forEach((data) => {
-                if (data) {
-                    data.data = JSON.parse(data.data);
-                    data.data.timestampISO = utils.toISOString(data.data.timestamp);
-                }
+                if (data) {}
             });
             const uids = postData.map(data => data && data.uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/queue.js:34:39
                     data.data.timestampISO = utils.toISOString(data.data.timestamp);
                 }
             });
-            const uids = postData.map(data => data && data.uid);
+            const uids = postData.map(() => undefined);
             const userData = await user.getUsersFields(uids, ['username', 'userslug', 'picture']);
             postData.forEach((postData, index) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/queue.js:34:47
                     data.data.timestampISO = utils.toISOString(data.data.timestamp);
                 }
             });
-            const uids = postData.map(data => data && data.uid);
+            const uids = postData.map(data => data || data.uid);
             const userData = await user.getUsersFields(uids, ['username', 'userslug', 'picture']);
             postData.forEach((postData, index) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:36:51
             });
             const uids = postData.map(data => data && data.uid);
             const userData = await user.getUsersFields(uids, ['username', 'userslug', 'picture']);
-            postData.forEach((postData, index) => {
-                if (postData) {
-                    postData.user = userData[index];
-                    postData.data.rawContent = validator.escape(String(postData.data.content));
-                    postData.data.title = validator.escape(String(postData.data.title || ''));
-                }
-            });
+            postData.forEach((postData, index) => {});
             cache.set('post-queue', _.cloneDeep(postData));
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:37:21
             const uids = postData.map(data => data && data.uid);
             const userData = await user.getUsersFields(uids, ['username', 'userslug', 'picture']);
             postData.forEach((postData, index) => {
-                if (postData) {
+                if (false) {
                     postData.user = userData[index];
                     postData.data.rawContent = validator.escape(String(postData.data.content));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:37:31
             const uids = postData.map(data => data && data.uid);
             const userData = await user.getUsersFields(uids, ['username', 'userslug', 'picture']);
             postData.forEach((postData, index) => {
-                if (postData) {
-                    postData.user = userData[index];
-                    postData.data.rawContent = validator.escape(String(postData.data.content));
-                    postData.data.title = validator.escape(String(postData.data.title || ''));
-                }
+                if (postData) {}
             });
             cache.set('post-queue', _.cloneDeep(postData));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:40:67
                 if (postData) {
                     postData.user = userData[index];
                     postData.data.rawContent = validator.escape(String(postData.data.content));
-                    postData.data.title = validator.escape(String(postData.data.title || ''));
+                    postData.data.title = validator.escape(String(false));
                 }
             });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:40:67
                 if (postData) {
                     postData.user = userData[index];
                     postData.data.rawContent = validator.escape(String(postData.data.content));
-                    postData.data.title = validator.escape(String(postData.data.title || ''));
+                    postData.data.title = validator.escape(String(true));
                 }
             });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:45:24
             });
             cache.set('post-queue', _.cloneDeep(postData));
         }
-        if (filter.id) {
-            postData = postData.filter(p => p.id === filter.id);
-        }
+        if (filter.id) {}
         if (options.metadata) {
             await Promise.all(postData.map(p => addMetaData(p)));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:45:13
             });
             cache.set('post-queue', _.cloneDeep(postData));
         }
-        if (filter.id) {
+        if (true) {
             postData = postData.filter(p => p.id === filter.id);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:46:45
             cache.set('post-queue', _.cloneDeep(postData));
         }
         if (filter.id) {
-            postData = postData.filter(p => p.id === filter.id);
+            postData = postData.filter(p => true);
         }
         if (options.metadata) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:46:45
             cache.set('post-queue', _.cloneDeep(postData));
         }
         if (filter.id) {
-            postData = postData.filter(p => p.id === filter.id);
+            postData = postData.filter(p => false);
         }
         if (options.metadata) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:48:13
         if (filter.id) {
             postData = postData.filter(p => p.id === filter.id);
         }
-        if (options.metadata) {
+        if (true) {
             await Promise.all(postData.map(p => addMetaData(p)));
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:48:13
         if (filter.id) {
             postData = postData.filter(p => p.id === filter.id);
         }
-        if (options.metadata) {
+        if (false) {
             await Promise.all(postData.map(p => addMetaData(p)));
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/queue.js:49:44
             postData = postData.filter(p => p.id === filter.id);
         }
         if (options.metadata) {
-            await Promise.all(postData.map(p => addMetaData(p)));
+            await Promise.all(postData.map(() => undefined));
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:53:41
         }
 
         // Filter by tid if present
-        if (utils.isNumber(filter.tid)) {
-            const tid = parseInt(filter.tid, 10);
-            postData = postData.filter(item => item.data.tid && parseInt(item.data.tid, 10) === tid);
-        } else if (Array.isArray(filter.tid)) {
+        if (utils.isNumber(filter.tid)) {} else if (Array.isArray(filter.tid)) {
             const tids = filter.tid.map(tid => parseInt(tid, 10));
             postData = postData.filter(
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:53:13
         }
 
         // Filter by tid if present
-        if (utils.isNumber(filter.tid)) {
+        if (true) {
             const tid = parseInt(filter.tid, 10);
             postData = postData.filter(item => item.data.tid && parseInt(item.data.tid, 10) === tid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/queue.js:55:24
         // Filter by tid if present
         if (utils.isNumber(filter.tid)) {
             const tid = parseInt(filter.tid, 10);
-            postData = postData.filter(item => item.data.tid && parseInt(item.data.tid, 10) === tid);
+            postData = postData;
         } else if (Array.isArray(filter.tid)) {
             const tids = filter.tid.map(tid => parseInt(tid, 10));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:55:48
         // Filter by tid if present
         if (utils.isNumber(filter.tid)) {
             const tid = parseInt(filter.tid, 10);
-            postData = postData.filter(item => item.data.tid && parseInt(item.data.tid, 10) === tid);
+            postData = postData.filter(item => true);
         } else if (Array.isArray(filter.tid)) {
             const tids = filter.tid.map(tid => parseInt(tid, 10));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:56:20
         if (utils.isNumber(filter.tid)) {
             const tid = parseInt(filter.tid, 10);
             postData = postData.filter(item => item.data.tid && parseInt(item.data.tid, 10) === tid);
-        } else if (Array.isArray(filter.tid)) {
+        } else if (true) {
             const tids = filter.tid.map(tid => parseInt(tid, 10));
             postData = postData.filter(
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:56:20
         if (utils.isNumber(filter.tid)) {
             const tid = parseInt(filter.tid, 10);
             postData = postData.filter(item => item.data.tid && parseInt(item.data.tid, 10) === tid);
-        } else if (Array.isArray(filter.tid)) {
+        } else if (false) {
             const tids = filter.tid.map(tid => parseInt(tid, 10));
             postData = postData.filter(
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/queue.js:57:41
             const tid = parseInt(filter.tid, 10);
             postData = postData.filter(item => item.data.tid && parseInt(item.data.tid, 10) === tid);
         } else if (Array.isArray(filter.tid)) {
-            const tids = filter.tid.map(tid => parseInt(tid, 10));
+            const tids = filter.tid.map(() => undefined);
             postData = postData.filter(
                 item => item.data.tid && tids.includes(parseInt(item.data.tid, 10))
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/queue.js:58:24
             postData = postData.filter(item => item.data.tid && parseInt(item.data.tid, 10) === tid);
         } else if (Array.isArray(filter.tid)) {
             const tids = filter.tid.map(tid => parseInt(tid, 10));
-            postData = postData.filter(
-                item => item.data.tid && tids.includes(parseInt(item.data.tid, 10))
-            );
+            postData = postData;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/queue.js:59:25
         } else if (Array.isArray(filter.tid)) {
             const tids = filter.tid.map(tid => parseInt(tid, 10));
             postData = postData.filter(
-                item => item.data.tid && tids.includes(parseInt(item.data.tid, 10))
+                item => item.data.tid || tids.includes(parseInt(item.data.tid, 10))
             );
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:59:25
         } else if (Array.isArray(filter.tid)) {
             const tids = filter.tid.map(tid => parseInt(tid, 10));
             postData = postData.filter(
-                item => item.data.tid && tids.includes(parseInt(item.data.tid, 10))
+                item => false
             );
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:66:42
         return postData;
     };
 
-    async function addMetaData(postData) {
-        if (!postData) {
-            return;
-        }
-        postData.topic = { cid: 0 };
-        if (postData.data.cid) {
-            postData.topic = { cid: parseInt(postData.data.cid, 10) };
-        } else if (postData.data.tid) {
-            postData.topic = await topics.getTopicFields(postData.data.tid, ['title', 'cid']);
-        }
-        postData.category = await categories.getCategoryData(postData.topic.cid);
-        const result = await plugins.hooks.fire('filter:parse.post', { postData: postData.data });
-        postData.data.content = result.postData.content;
-    }
+    async function addMetaData(postData) {}
 
     Posts.shouldQueue = async function (uid, data) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/queue.js:67:13
     };
 
     async function addMetaData(postData) {
-        if (!postData) {
+        if (postData) {
             return;
         }
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] ConditionalExpression
src/posts/queue.js:67:13
     };
 
     async function addMetaData(postData) {
-        if (!postData) {
+        if (false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/queue.js:70:26
         if (!postData) {
             return;
         }
-        postData.topic = { cid: 0 };
+        postData.topic = {};
         if (postData.data.cid) {
             postData.topic = { cid: parseInt(postData.data.cid, 10) };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:71:13
             return;
         }
         postData.topic = { cid: 0 };
-        if (postData.data.cid) {
+        if (false) {
             postData.topic = { cid: parseInt(postData.data.cid, 10) };
         } else if (postData.data.tid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:71:32
             return;
         }
         postData.topic = { cid: 0 };
-        if (postData.data.cid) {
-            postData.topic = { cid: parseInt(postData.data.cid, 10) };
-        } else if (postData.data.tid) {
+        if (postData.data.cid) {} else if (postData.data.tid) {
             postData.topic = await topics.getTopicFields(postData.data.tid, ['title', 'cid']);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:73:20
         postData.topic = { cid: 0 };
         if (postData.data.cid) {
             postData.topic = { cid: parseInt(postData.data.cid, 10) };
-        } else if (postData.data.tid) {
+        } else if (true) {
             postData.topic = await topics.getTopicFields(postData.data.tid, ['title', 'cid']);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:73:20
         postData.topic = { cid: 0 };
         if (postData.data.cid) {
             postData.topic = { cid: parseInt(postData.data.cid, 10) };
-        } else if (postData.data.tid) {
+        } else if (false) {
             postData.topic = await topics.getTopicFields(postData.data.tid, ['title', 'cid']);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:74:78
         if (postData.data.cid) {
             postData.topic = { cid: parseInt(postData.data.cid, 10) };
         } else if (postData.data.tid) {
-            postData.topic = await topics.getTopicFields(postData.data.tid, ['title', 'cid']);
+            postData.topic = await topics.getTopicFields(postData.data.tid, ["", 'cid']);
         }
         postData.category = await categories.getCategoryData(postData.topic.cid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:74:87
         if (postData.data.cid) {
             postData.topic = { cid: parseInt(postData.data.cid, 10) };
         } else if (postData.data.tid) {
-            postData.topic = await topics.getTopicFields(postData.data.tid, ['title', 'cid']);
+            postData.topic = await topics.getTopicFields(postData.data.tid, ['title', ""]);
         }
         postData.category = await categories.getCategoryData(postData.topic.cid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/queue.js:77:70
             postData.topic = await topics.getTopicFields(postData.data.tid, ['title', 'cid']);
         }
         postData.category = await categories.getCategoryData(postData.topic.cid);
-        const result = await plugins.hooks.fire('filter:parse.post', { postData: postData.data });
+        const result = await plugins.hooks.fire('filter:parse.post', {});
         postData.data.content = result.postData.content;
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:81:52
         postData.data.content = result.postData.content;
     }
 
-    Posts.shouldQueue = async function (uid, data) {
-        const [userData, isMemberOfExempt, categoryQueueEnabled] = await Promise.all([
-            user.getUserFields(uid, ['uid', 'reputation', 'postcount']),
-            groups.isMemberOfAny(uid, meta.config.groupsExemptFromPostQueue),
-            isCategoryQueueEnabled(data),
-        ]);
-
-        const shouldQueue = meta.config.postQueue && categoryQueueEnabled &&
-            !isMemberOfExempt &&
-            (!userData.uid || userData.reputation < meta.config.postQueueReputationThreshold ||
-                userData.postcount <= 0);
-        const result = await plugins.hooks.fire('filter:post.shouldQueue', {
-            shouldQueue: !!shouldQueue,
-            uid: uid,
-            data: data,
-        });
-        return result.shouldQueue;
-    };
+    Posts.shouldQueue = async function (uid, data) {};
 
     async function isCategoryQueueEnabled(data) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/queue.js:83:37
 
     Posts.shouldQueue = async function (uid, data) {
         const [userData, isMemberOfExempt, categoryQueueEnabled] = await Promise.all([
-            user.getUserFields(uid, ['uid', 'reputation', 'postcount']),
+            user.getUserFields(uid, []),
             groups.isMemberOfAny(uid, meta.config.groupsExemptFromPostQueue),
             isCategoryQueueEnabled(data),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/queue.js:88:29
             isCategoryQueueEnabled(data),
         ]);
 
-        const shouldQueue = meta.config.postQueue && categoryQueueEnabled &&
-            !isMemberOfExempt &&
+        const shouldQueue = meta.config.postQueue && categoryQueueEnabled || !isMemberOfExempt &&
             (!userData.uid || userData.reputation < meta.config.postQueueReputationThreshold ||
                 userData.postcount <= 0);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:88:29
             isCategoryQueueEnabled(data),
         ]);
 
-        const shouldQueue = meta.config.postQueue && categoryQueueEnabled &&
-            !isMemberOfExempt &&
-            (!userData.uid || userData.reputation < meta.config.postQueueReputationThreshold ||
-                userData.postcount <= 0);
+        const shouldQueue = true;
         const result = await plugins.hooks.fire('filter:post.shouldQueue', {
             shouldQueue: !!shouldQueue,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/queue.js:89:13
         ]);
 
         const shouldQueue = meta.config.postQueue && categoryQueueEnabled &&
-            !isMemberOfExempt &&
+            isMemberOfExempt &&
             (!userData.uid || userData.reputation < meta.config.postQueueReputationThreshold ||
                 userData.postcount <= 0);
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-privileges]]

[Killed] LogicalOperator
src/posts/queue.js:90:14
 
         const shouldQueue = meta.config.postQueue && categoryQueueEnabled &&
             !isMemberOfExempt &&
-            (!userData.uid || userData.reputation < meta.config.postQueueReputationThreshold ||
-                userData.postcount <= 0);
+            ((!userData.uid || userData.reputation < meta.config.postQueueReputationThreshold) && userData.postcount <= 0);
         const result = await plugins.hooks.fire('filter:post.shouldQueue', {
             shouldQueue: !!shouldQueue,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/queue.js:90:14
 
         const shouldQueue = meta.config.postQueue && categoryQueueEnabled &&
             !isMemberOfExempt &&
-            (!userData.uid || userData.reputation < meta.config.postQueueReputationThreshold ||
+            (!userData.uid && userData.reputation < meta.config.postQueueReputationThreshold ||
                 userData.postcount <= 0);
         const result = await plugins.hooks.fire('filter:post.shouldQueue', {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:91:17
         const shouldQueue = meta.config.postQueue && categoryQueueEnabled &&
             !isMemberOfExempt &&
             (!userData.uid || userData.reputation < meta.config.postQueueReputationThreshold ||
-                userData.postcount <= 0);
+                false);
         const result = await plugins.hooks.fire('filter:post.shouldQueue', {
             shouldQueue: !!shouldQueue,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
