[Killed] ConditionalExpression
src/posts/create.js:20:27
         const { uid } = data;
         const { tid } = data;
         const content = data.content.toString();
-        const timestamp = data.timestamp || Date.now();
+        const timestamp = true;
         const isMain = data.isMain || false;
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/create.js:20:27
         const { uid } = data;
         const { tid } = data;
         const content = data.content.toString();
-        const timestamp = data.timestamp || Date.now();
+        const timestamp = data.timestamp && Date.now();
         const isMain = data.isMain || false;
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/create.js:21:24
         const { tid } = data;
         const content = data.content.toString();
         const timestamp = data.timestamp || Date.now();
-        const isMain = data.isMain || false;
+        const isMain = false;
 
         if (!uid && parseInt(uid, 10) !== 0) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/create.js:21:24
         const { tid } = data;
         const content = data.content.toString();
         const timestamp = data.timestamp || Date.now();
-        const isMain = data.isMain || false;
+        const isMain = true;
 
         if (!uid && parseInt(uid, 10) !== 0) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/create.js:23:13
         const timestamp = data.timestamp || Date.now();
         const isMain = data.isMain || false;
 
-        if (!uid && parseInt(uid, 10) !== 0) {
+        if (uid && parseInt(uid, 10) !== 0) {
             throw new Error('[[error:invalid-uid]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/create.js:23:21
         const timestamp = data.timestamp || Date.now();
         const isMain = data.isMain || false;
 
-        if (!uid && parseInt(uid, 10) !== 0) {
+        if (!uid && parseInt(uid, 10) === 0) {
             throw new Error('[[error:invalid-uid]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/create.js:27:13
             throw new Error('[[error:invalid-uid]]');
         }
 
-        if (data.toPid && !utils.isNumber(data.toPid)) {
+        if (true) {
             throw new Error('[[error:invalid-pid]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/create.js:27:13
             throw new Error('[[error:invalid-uid]]');
         }
 
-        if (data.toPid && !utils.isNumber(data.toPid)) {
+        if (data.toPid || !utils.isNumber(data.toPid)) {
             throw new Error('[[error:invalid-pid]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/create.js:32:24
         }
 
         const pid = await db.incrObjectField('global', 'nextPid');
-        let postData = {
-            pid: pid,
-            uid: uid,
-            tid: tid,
-            content: content,
-            timestamp: timestamp,
-        };
+        let postData = {};
 
         if (data.toPid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/create.js:40:13
             timestamp: timestamp,
         };
 
-        if (data.toPid) {
+        if (true) {
             postData.toPid = data.toPid;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/create.js:40:25
             timestamp: timestamp,
         };
 
-        if (data.toPid) {
-            postData.toPid = data.toPid;
-        }
+        if (data.toPid) {}
         if (data.ip && meta.config.trackIpPerPost) {
             postData.ip = data.ip;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/create.js:43:52
         if (data.toPid) {
             postData.toPid = data.toPid;
         }
-        if (data.ip && meta.config.trackIpPerPost) {
-            postData.ip = data.ip;
-        }
+        if (data.ip && meta.config.trackIpPerPost) {}
         if (data.handle && !parseInt(uid, 10)) {
             postData.handle = data.handle;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/create.js:43:13
         if (data.toPid) {
             postData.toPid = data.toPid;
         }
-        if (data.ip && meta.config.trackIpPerPost) {
+        if (data.ip || meta.config.trackIpPerPost) {
             postData.ip = data.ip;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/create.js:46:28
         if (data.ip && meta.config.trackIpPerPost) {
             postData.ip = data.ip;
         }
-        if (data.handle && !parseInt(uid, 10)) {
+        if (data.handle && parseInt(uid, 10)) {
             postData.handle = data.handle;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/create.js:46:13
         if (data.ip && meta.config.trackIpPerPost) {
             postData.ip = data.ip;
         }
-        if (data.handle && !parseInt(uid, 10)) {
+        if (false) {
             postData.handle = data.handle;
         }
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-user]]

[Killed] ObjectLiteral
src/posts/create.js:50:69
             postData.handle = data.handle;
         }
 
-        let result = await plugins.hooks.fire('filter:post.create', { post: postData, data: data });
+        let result = await plugins.hooks.fire('filter:post.create', {});
         postData = result.post;
         await db.setObject(`post:${postData.pid}`, postData);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/create.js:57:27
         const topicData = await topics.getTopicFields(tid, ['cid', 'pinned']);
         postData.cid = topicData.cid;
 
-        await Promise.all([
-            db.sortedSetAdd('posts:pid', timestamp, postData.pid),
-            db.incrObjectField('global', 'postCount'),
-            user.onNewPostMade(postData),
-            topics.onNewPostMade(postData),
-            categories.onNewPostMade(topicData.cid, topicData.pinned, postData),
-            groups.onNewPostMade(postData),
-            addReplyTo(postData, timestamp),
-            Posts.uploads.sync(postData.pid),
-        ]);
+        await Promise.all([]);
 
         result = await plugins.hooks.fire('filter:post.get', { post: postData, uid: data.uid });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/create.js:68:62
             Posts.uploads.sync(postData.pid),
         ]);
 
-        result = await plugins.hooks.fire('filter:post.get', { post: postData, uid: data.uid });
+        result = await plugins.hooks.fire('filter:post.get', {});
         result.post.isMain = isMain;
         plugins.hooks.fire('action:post.save', { post: _.clone(result.post) });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/create.js:74:52
         return result.post;
     };
 
-    async function addReplyTo(postData, timestamp) {
-        if (!postData.toPid) {
-            return;
-        }
-        await Promise.all([
-            db.sortedSetAdd(`pid:${postData.toPid}:replies`, timestamp, postData.pid),
-            db.incrObjectField(`post:${postData.toPid}`, 'replies'),
-        ]);
-    }
+    async function addReplyTo(postData, timestamp) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/create.js:75:13
     };
 
     async function addReplyTo(postData, timestamp) {
-        if (!postData.toPid) {
+        if (true) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/create.js:75:13
     };
 
     async function addReplyTo(postData, timestamp) {
-        if (!postData.toPid) {
+        if (postData.toPid) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/create.js:78:27
         if (!postData.toPid) {
             return;
         }
-        await Promise.all([
-            db.sortedSetAdd(`pid:${postData.toPid}:replies`, timestamp, postData.pid),
-            db.incrObjectField(`post:${postData.toPid}`, 'replies'),
-        ]);
+        await Promise.all([]);
     }
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/create.js:79:29
             return;
         }
         await Promise.all([
-            db.sortedSetAdd(`pid:${postData.toPid}:replies`, timestamp, postData.pid),
+            db.sortedSetAdd(``, timestamp, postData.pid),
             db.incrObjectField(`post:${postData.toPid}`, 'replies'),
         ]);
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] StringLiteral
src/posts/create.js:80:32
         }
         await Promise.all([
             db.sortedSetAdd(`pid:${postData.toPid}:replies`, timestamp, postData.pid),
-            db.incrObjectField(`post:${postData.toPid}`, 'replies'),
+            db.incrObjectField(``, 'replies'),
         ]);
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/create.js:80:58
         }
         await Promise.all([
             db.sortedSetAdd(`pid:${postData.toPid}:replies`, timestamp, postData.pid),
-            db.incrObjectField(`post:${postData.toPid}`, 'replies'),
+            db.incrObjectField(`post:${postData.toPid}`, ""),
         ]);
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
