[Killed] StringLiteral
src/posts/data.js:8:37
 const utils = require('../utils');
 
 const intFields = [
-    'uid', 'pid', 'tid', 'deleted', 'timestamp',
+    'uid', 'pid', 'tid', 'deleted', "",
     'upvotes', 'downvotes', 'deleterUid', 'edited',
     'replies', 'bookmarks', 'endorsed',
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] StringLiteral
src/posts/data.js:8:26
 const utils = require('../utils');
 
 const intFields = [
-    'uid', 'pid', 'tid', 'deleted', 'timestamp',
+    'uid', 'pid', 'tid', "", 'timestamp',
     'upvotes', 'downvotes', 'deleterUid', 'edited',
     'replies', 'bookmarks', 'endorsed',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/data.js:9:16
 
 const intFields = [
     'uid', 'pid', 'tid', 'deleted', 'timestamp',
-    'upvotes', 'downvotes', 'deleterUid', 'edited',
+    'upvotes', "", 'deleterUid', 'edited',
     'replies', 'bookmarks', 'endorsed',
 ];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/data.js:10:5
 const intFields = [
     'uid', 'pid', 'tid', 'deleted', 'timestamp',
     'upvotes', 'downvotes', 'deleterUid', 'edited',
-    'replies', 'bookmarks', 'endorsed',
+    "", 'bookmarks', 'endorsed',
 ];
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/data.js:14:58
 ];
 
 module.exports = function (Posts) {
-    Posts.getPostsFields = async function (pids, fields) {
-        if (!Array.isArray(pids) || !pids.length) {
-            return [];
-        }
-        const keys = pids.map(pid => `post:${pid}`);
-        const postData = await db.getObjects(keys, fields);
-        const result = await plugins.hooks.fire('filter:post.getFields', {
-            pids: pids,
-            posts: postData,
-            fields: fields,
-        });
-        result.posts.forEach(post => modifyPost(post, fields));
-        return result.posts;
-    };
+    Posts.getPostsFields = async function (pids, fields) {};
 
     Posts.getPostData = async function (pid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/data.js:15:13
 
 module.exports = function (Posts) {
     Posts.getPostsFields = async function (pids, fields) {
-        if (!Array.isArray(pids) || !pids.length) {
+        if (false) {
             return [];
         }
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-privileges]]

[Killed] BooleanLiteral
src/posts/data.js:15:37
 
 module.exports = function (Posts) {
     Posts.getPostsFields = async function (pids, fields) {
-        if (!Array.isArray(pids) || !pids.length) {
+        if (!Array.isArray(pids) || pids.length) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/data.js:16:20
 module.exports = function (Posts) {
     Posts.getPostsFields = async function (pids, fields) {
         if (!Array.isArray(pids) || !pids.length) {
-            return [];
+            return ["Stryker was here"];
         }
         const keys = pids.map(pid => `post:${pid}`);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/data.js:18:31
         if (!Array.isArray(pids) || !pids.length) {
             return [];
         }
-        const keys = pids.map(pid => `post:${pid}`);
+        const keys = pids.map(() => undefined);
         const postData = await db.getObjects(keys, fields);
         const result = await plugins.hooks.fire('filter:post.getFields', {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/data.js:25:30
             posts: postData,
             fields: fields,
         });
-        result.posts.forEach(post => modifyPost(post, fields));
+        result.posts.forEach(() => undefined);
         return result.posts;
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/data.js:29:46
         return result.posts;
     };
 
-    Posts.getPostData = async function (pid) {
-        const posts = await Posts.getPostsFields([pid], []);
-        return posts && posts.length ? posts[0] : null;
-    };
+    Posts.getPostData = async function (pid) {};
 
     Posts.getPostsData = async function (pids) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/data.js:31:16
 
     Posts.getPostData = async function (pid) {
         const posts = await Posts.getPostsFields([pid], []);
-        return posts && posts.length ? posts[0] : null;
+        return false ? posts[0] : null;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/data.js:31:16
 
     Posts.getPostData = async function (pid) {
         const posts = await Posts.getPostsFields([pid], []);
-        return posts && posts.length ? posts[0] : null;
+        return posts || posts.length ? posts[0] : null;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/data.js:34:48
         return posts && posts.length ? posts[0] : null;
     };
 
-    Posts.getPostsData = async function (pids) {
-        return await Posts.getPostsFields(pids, []);
-    };
+    Posts.getPostsData = async function (pids) {};
 
     Posts.getPostField = async function (pid, field) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/data.js:38:54
         return await Posts.getPostsFields(pids, []);
     };
 
-    Posts.getPostField = async function (pid, field) {
-        const post = await Posts.getPostFields(pid, [field]);
-        return post ? post[field] : null;
-    };
+    Posts.getPostField = async function (pid, field) {};
 
     Posts.getPostFields = async function (pid, fields) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/data.js:39:53
     };
 
     Posts.getPostField = async function (pid, field) {
-        const post = await Posts.getPostFields(pid, [field]);
+        const post = await Posts.getPostFields(pid, []);
         return post ? post[field] : null;
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/data.js:43:56
         return post ? post[field] : null;
     };
 
-    Posts.getPostFields = async function (pid, fields) {
-        const posts = await Posts.getPostsFields([pid], fields);
-        return posts ? posts[0] : null;
-    };
+    Posts.getPostFields = async function (pid, fields) {};
 
     Posts.setPostField = async function (pid, field, value) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/data.js:44:50
     };
 
     Posts.getPostFields = async function (pid, fields) {
-        const posts = await Posts.getPostsFields([pid], fields);
+        const posts = await Posts.getPostsFields([], fields);
         return posts ? posts[0] : null;
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/data.js:48:61
         return posts ? posts[0] : null;
     };
 
-    Posts.setPostField = async function (pid, field, value) {
-        await Posts.setPostFields(pid, { [field]: value });
-    };
+    Posts.setPostField = async function (pid, field, value) {};
 
     Posts.setPostFields = async function (pid, data) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/data.js:52:54
         await Posts.setPostFields(pid, { [field]: value });
     };
 
-    Posts.setPostFields = async function (pid, data) {
-        await db.setObject(`post:${pid}`, data);
-        plugins.hooks.fire('action:post.setFields', { data: { ...data, pid } });
-    };
+    Posts.setPostFields = async function (pid, data) {};
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/data.js:53:28
     };
 
     Posts.setPostFields = async function (pid, data) {
-        await db.setObject(`post:${pid}`, data);
+        await db.setObject(``, data);
         plugins.hooks.fire('action:post.setFields', { data: { ...data, pid } });
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/data.js:54:53
 
     Posts.setPostFields = async function (pid, data) {
         await db.setObject(`post:${pid}`, data);
-        plugins.hooks.fire('action:post.setFields', { data: { ...data, pid } });
+        plugins.hooks.fire('action:post.setFields', {});
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/data.js:54:61
 
     Posts.setPostFields = async function (pid, data) {
         await db.setObject(`post:${pid}`, data);
-        plugins.hooks.fire('action:post.setFields', { data: { ...data, pid } });
+        plugins.hooks.fire('action:post.setFields', { data: {} });
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/data.js:58:35
     };
 };
 
-function modifyPost(post, fields) {
-    if (post) {
-        db.parseIntFields(post, intFields, fields);
-        if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
-            post.votes = post.upvotes - post.downvotes;
-        }
-        if (post.hasOwnProperty('timestamp')) {
-            post.timestampISO = utils.toISOString(post.timestamp);
-        }
-        if (post.hasOwnProperty('edited')) {
-            post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
-        }
-    }
-}
+function modifyPost(post, fields) {}
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/data.js:59:15
 };
 
 function modifyPost(post, fields) {
-    if (post) {
-        db.parseIntFields(post, intFields, fields);
-        if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
-            post.votes = post.upvotes - post.downvotes;
-        }
-        if (post.hasOwnProperty('timestamp')) {
-            post.timestampISO = utils.toISOString(post.timestamp);
-        }
-        if (post.hasOwnProperty('edited')) {
-            post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
-        }
-    }
+    if (post) {}
 }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/data.js:59:9
 };
 
 function modifyPost(post, fields) {
-    if (post) {
+    if (false) {
         db.parseIntFields(post, intFields, fields);
         if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/data.js:61:13
 function modifyPost(post, fields) {
     if (post) {
         db.parseIntFields(post, intFields, fields);
-        if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
+        if (post.hasOwnProperty('upvotes') || post.hasOwnProperty('downvotes')) {
             post.votes = post.upvotes - post.downvotes;
         }
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] ConditionalExpression
src/posts/data.js:61:13
 function modifyPost(post, fields) {
     if (post) {
         db.parseIntFields(post, intFields, fields);
-        if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
+        if (false) {
             post.votes = post.upvotes - post.downvotes;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/data.js:62:26
     if (post) {
         db.parseIntFields(post, intFields, fields);
         if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
-            post.votes = post.upvotes - post.downvotes;
+            post.votes = post.upvotes + post.downvotes;
         }
         if (post.hasOwnProperty('timestamp')) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/data.js:64:13
         if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
             post.votes = post.upvotes - post.downvotes;
         }
-        if (post.hasOwnProperty('timestamp')) {
+        if (false) {
             post.timestampISO = utils.toISOString(post.timestamp);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/data.js:64:47
         if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
             post.votes = post.upvotes - post.downvotes;
         }
-        if (post.hasOwnProperty('timestamp')) {
-            post.timestampISO = utils.toISOString(post.timestamp);
-        }
+        if (post.hasOwnProperty('timestamp')) {}
         if (post.hasOwnProperty('edited')) {
             post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
killedBy: POST /ping: response status code should match one of the schema defined responses
statusReason: POST /ping sent back unexpected HTTP status code: 401 {"status":{"code":"not-authorised","message":"A valid login session was not found. Please log in and try again."},"response":{}}

[Killed] BlockStatement
src/posts/data.js:67:44
         if (post.hasOwnProperty('timestamp')) {
             post.timestampISO = utils.toISOString(post.timestamp);
         }
-        if (post.hasOwnProperty('edited')) {
-            post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
-        }
+        if (post.hasOwnProperty('edited')) {}
     }
 }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/data.js:67:13
         if (post.hasOwnProperty('timestamp')) {
             post.timestampISO = utils.toISOString(post.timestamp);
         }
-        if (post.hasOwnProperty('edited')) {
+        if (false) {
             post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/data.js:68:30
             post.timestampISO = utils.toISOString(post.timestamp);
         }
         if (post.hasOwnProperty('edited')) {
-            post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
+            post.editedISO = true ? utils.toISOString(post.edited) : '';
         }
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/data.js:68:30
             post.timestampISO = utils.toISOString(post.timestamp);
         }
         if (post.hasOwnProperty('edited')) {
-            post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
+            post.editedISO = false ? utils.toISOString(post.edited) : '';
         }
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
