[Killed] EqualityOperator
src/posts/queue.js:91:17
         const shouldQueue = meta.config.postQueue && categoryQueueEnabled &&
             !isMemberOfExempt &&
             (!userData.uid || userData.reputation < meta.config.postQueueReputationThreshold ||
-                userData.postcount <= 0);
+                userData.postcount < 0);
         const result = await plugins.hooks.fire('filter:post.shouldQueue', {
             shouldQueue: !!shouldQueue,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/queue.js:93:27
             (!userData.uid || userData.reputation < meta.config.postQueueReputationThreshold ||
                 userData.postcount <= 0);
         const result = await plugins.hooks.fire('filter:post.shouldQueue', {
-            shouldQueue: !!shouldQueue,
+            shouldQueue: !shouldQueue,
             uid: uid,
             data: data,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:100:49
         return result.shouldQueue;
     };
 
-    async function isCategoryQueueEnabled(data) {
-        const type = getType(data);
-        const cid = await getCid(type, data);
-        if (!cid) {
-            throw new Error('[[error:invalid-cid]]');
-        }
-        return await categories.getCategoryField(cid, 'postQueue');
-    }
+    async function isCategoryQueueEnabled(data) {}
 
     function getType(data) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/queue.js:103:13
     async function isCategoryQueueEnabled(data) {
         const type = getType(data);
         const cid = await getCid(type, data);
-        if (!cid) {
+        if (cid) {
             throw new Error('[[error:invalid-cid]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:103:19
     async function isCategoryQueueEnabled(data) {
         const type = getType(data);
         const cid = await getCid(type, data);
-        if (!cid) {
-            throw new Error('[[error:invalid-cid]]');
-        }
+        if (!cid) {}
         return await categories.getCategoryField(cid, 'postQueue');
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:106:55
         if (!cid) {
             throw new Error('[[error:invalid-cid]]');
         }
-        return await categories.getCategoryField(cid, 'postQueue');
+        return await categories.getCategoryField(cid, "");
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:109:28
         return await categories.getCategoryField(cid, 'postQueue');
     }
 
-    function getType(data) {
-        if (data.hasOwnProperty('tid')) {
-            return 'reply';
-        } else if (data.hasOwnProperty('cid')) {
-            return 'topic';
-        }
-        throw new Error('[[error:invalid-type]]');
-    }
+    function getType(data) {}
 
     async function removeQueueNotification(id) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:110:13
     }
 
     function getType(data) {
-        if (data.hasOwnProperty('tid')) {
+        if (true) {
             return 'reply';
         } else if (data.hasOwnProperty('cid')) {
killedBy: POST /ping: response status code should match one of the schema defined responses
statusReason: POST /ping sent back unexpected HTTP status code: 401 {"status":{"code":"not-authorised","message":"A valid login session was not found. Please log in and try again."},"response":{}}

[Killed] ConditionalExpression
src/posts/queue.js:110:13
     }
 
     function getType(data) {
-        if (data.hasOwnProperty('tid')) {
+        if (false) {
             return 'reply';
         } else if (data.hasOwnProperty('cid')) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:111:20
 
     function getType(data) {
         if (data.hasOwnProperty('tid')) {
-            return 'reply';
+            return "";
         } else if (data.hasOwnProperty('cid')) {
             return 'topic';
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:112:48
     function getType(data) {
         if (data.hasOwnProperty('tid')) {
             return 'reply';
-        } else if (data.hasOwnProperty('cid')) {
-            return 'topic';
-        }
+        } else if (data.hasOwnProperty('cid')) {}
         throw new Error('[[error:invalid-type]]');
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:112:20
     function getType(data) {
         if (data.hasOwnProperty('tid')) {
             return 'reply';
-        } else if (data.hasOwnProperty('cid')) {
+        } else if (false) {
             return 'topic';
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:118:48
         throw new Error('[[error:invalid-type]]');
     }
 
-    async function removeQueueNotification(id) {
-        await notifications.rescind(`post-queue-${id}`);
-        const data = await getParsedObject(id);
-        if (!data) {
-            return;
-        }
-        const cid = await getCid(data.type, data);
-        const uids = await getNotificationUids(cid);
-        uids.forEach(uid => user.notifications.pushCount(uid));
-    }
+    async function removeQueueNotification(id) {}
 
     async function getNotificationUids(cid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:121:13
     async function removeQueueNotification(id) {
         await notifications.rescind(`post-queue-${id}`);
         const data = await getParsedObject(id);
-        if (!data) {
+        if (false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:121:20
     async function removeQueueNotification(id) {
         await notifications.rescind(`post-queue-${id}`);
         const data = await getParsedObject(id);
-        if (!data) {
-            return;
-        }
+        if (!data) {}
         const cid = await getCid(data.type, data);
         const uids = await getNotificationUids(cid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/queue.js:126:22
         }
         const cid = await getCid(data.type, data);
         const uids = await getNotificationUids(cid);
-        uids.forEach(uid => user.notifications.pushCount(uid));
+        uids.forEach(() => undefined);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:129:45
         uids.forEach(uid => user.notifications.pushCount(uid));
     }
 
-    async function getNotificationUids(cid) {
-        const results = await Promise.all([
-            groups.getMembersOfGroups(['administrators', 'Global Moderators']),
-            categories.getModeratorUids([cid]),
-        ]);
-        return _.uniq(_.flattenDeep(results));
-    }
+    async function getNotificationUids(cid) {}
 
     Posts.addToQueue = async function (data) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/queue.js:131:39
 
     async function getNotificationUids(cid) {
         const results = await Promise.all([
-            groups.getMembersOfGroups(['administrators', 'Global Moderators']),
+            groups.getMembersOfGroups([]),
             categories.getModeratorUids([cid]),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:131:40
 
     async function getNotificationUids(cid) {
         const results = await Promise.all([
-            groups.getMembersOfGroups(['administrators', 'Global Moderators']),
+            groups.getMembersOfGroups(["", 'Global Moderators']),
             categories.getModeratorUids([cid]),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/queue.js:132:41
     async function getNotificationUids(cid) {
         const results = await Promise.all([
             groups.getMembersOfGroups(['administrators', 'Global Moderators']),
-            categories.getModeratorUids([cid]),
+            categories.getModeratorUids([]),
         ]);
         return _.uniq(_.flattenDeep(results));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:149:44
             type: type,
             data: data,
         };
-        payload = await plugins.hooks.fire('filter:post-queue.save', payload);
+        payload = await plugins.hooks.fire("", payload);
         payload.data = JSON.stringify(data);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:152:31
         payload = await plugins.hooks.fire('filter:post-queue.save', payload);
         payload.data = JSON.stringify(data);
 
-        await db.sortedSetAdd('post:queue', now, id);
+        await db.sortedSetAdd("", now, id);
         await db.setObject(`post:queue:${id}`, payload);
         await user.setUserField(data.uid, 'lastqueuetime', now);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:154:43
 
         await db.sortedSetAdd('post:queue', now, id);
         await db.setObject(`post:queue:${id}`, payload);
-        await user.setUserField(data.uid, 'lastqueuetime', now);
+        await user.setUserField(data.uid, "", now);
         cache.del('post-queue');
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:155:19
         await db.sortedSetAdd('post:queue', now, id);
         await db.setObject(`post:queue:${id}`, payload);
         await user.setUserField(data.uid, 'lastqueuetime', now);
-        cache.del('post-queue');
+        cache.del("");
 
         const cid = await getCid(type, data);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/queue.js:173:21
         return {
             id: id,
             type: type,
-            queued: true,
+            queued: false,
             message: '[[success:post-queued]]',
         };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/queue.js:180:65
 
     async function parseBodyLong(cid, type, data) {
         const url = nconf.get('url');
-        const [content, category, userData] = await Promise.all([
-            plugins.hooks.fire('filter:parse.raw', data.content),
-            categories.getCategoryFields(cid, ['name', 'slug']),
-            user.getUserFields(data.uid, ['uid', 'username']),
-        ]);
+        const [content, category, userData] = await Promise.all([]);
 
         category.url = `${url}/category/${category.slug}`;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:181:32
     async function parseBodyLong(cid, type, data) {
         const url = nconf.get('url');
         const [content, category, userData] = await Promise.all([
-            plugins.hooks.fire('filter:parse.raw', data.content),
+            plugins.hooks.fire("", data.content),
             categories.getCategoryFields(cid, ['name', 'slug']),
             user.getUserFields(data.uid, ['uid', 'username']),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/queue.js:183:42
         const [content, category, userData] = await Promise.all([
             plugins.hooks.fire('filter:parse.raw', data.content),
             categories.getCategoryFields(cid, ['name', 'slug']),
-            user.getUserFields(data.uid, ['uid', 'username']),
+            user.getUserFields(data.uid, []),
         ]);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/queue.js:187:13
         ]);
 
         category.url = `${url}/category/${category.slug}`;
-        if (userData.uid > 0) {
+        if (userData.uid <= 0) {
             userData.url = `${url}/uid/${userData.uid}`;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:187:13
         ]);
 
         category.url = `${url}/category/${category.slug}`;
-        if (userData.uid > 0) {
+        if (true) {
             userData.url = `${url}/uid/${userData.uid}`;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:188:28
 
         category.url = `${url}/category/${category.slug}`;
         if (userData.uid > 0) {
-            userData.url = `${url}/uid/${userData.uid}`;
+            userData.url = ``;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/queue.js:192:13
         }
 
         const topic = { cid: cid, title: data.title, tid: data.tid };
-        if (type === 'reply') {
+        if (type !== 'reply') {
             topic.title = await topics.getTopicField(data.tid, 'title');
             topic.url = `${url}/topic/${data.tid}`;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:192:13
         }
 
         const topic = { cid: cid, title: data.title, tid: data.tid };
-        if (type === 'reply') {
+        if (true) {
             topic.title = await topics.getTopicField(data.tid, 'title');
             topic.url = `${url}/topic/${data.tid}`;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/queue.js:197:73
             topic.url = `${url}/topic/${data.tid}`;
         }
         const { app } = require('../webserver');
-        return await app.renderAsync('emails/partials/post-queue-body', {
-            content: content,
-            category: category,
-            user: userData,
-            topic: topic,
-        });
+        return await app.renderAsync('emails/partials/post-queue-body', {});
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:205:39
         });
     }
 
-    async function getCid(type, data) {
-        if (type === 'topic') {
-            return data.cid;
-        } else if (type === 'reply') {
-            return await topics.getTopicField(data.tid, 'cid');
-        }
-        return null;
-    }
+    async function getCid(type, data) {}
 
     async function canPost(type, data) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/queue.js:206:13
     }
 
     async function getCid(type, data) {
-        if (type === 'topic') {
+        if (type !== 'topic') {
             return data.cid;
         } else if (type === 'reply') {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:206:31
     }
 
     async function getCid(type, data) {
-        if (type === 'topic') {
-            return data.cid;
-        } else if (type === 'reply') {
+        if (type === 'topic') {} else if (type === 'reply') {
             return await topics.getTopicField(data.tid, 'cid');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/queue.js:208:20
     async function getCid(type, data) {
         if (type === 'topic') {
             return data.cid;
-        } else if (type === 'reply') {
+        } else if (type !== 'reply') {
             return await topics.getTopicField(data.tid, 'cid');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:208:38
     async function getCid(type, data) {
         if (type === 'topic') {
             return data.cid;
-        } else if (type === 'reply') {
-            return await topics.getTopicField(data.tid, 'cid');
-        }
+        } else if (type === 'reply') {}
         return null;
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:209:57
         if (type === 'topic') {
             return data.cid;
         } else if (type === 'reply') {
-            return await topics.getTopicField(data.tid, 'cid');
+            return await topics.getTopicField(data.tid, "");
         }
         return null;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:214:40
         return null;
     }
 
-    async function canPost(type, data) {
-        const cid = await getCid(type, data);
-        const typeToPrivilege = {
-            topic: 'topics:create',
-            reply: 'topics:reply',
-        };
-
-        topics.checkContent(data.content);
-        if (type === 'topic') {
-            topics.checkTitle(data.title);
-            if (data.tags) {
-                await topics.validateTags(data.tags, cid, data.uid);
-            }
-        }
-
-        const [canPost] = await Promise.all([
-            privileges.categories.can(typeToPrivilege[type], cid, data.uid),
-            user.isReadyToQueue(data.uid, cid),
-        ]);
-        if (!canPost) {
-            throw new Error('[[error:no-privileges]]');
-        }
-    }
+    async function canPost(type, data) {}
 
     Posts.removeFromQueue = async function (id) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/queue.js:216:33
 
     async function canPost(type, data) {
         const cid = await getCid(type, data);
-        const typeToPrivilege = {
-            topic: 'topics:create',
-            reply: 'topics:reply',
-        };
+        const typeToPrivilege = {};
 
         topics.checkContent(data.content);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/queue.js:222:13
         };
 
         topics.checkContent(data.content);
-        if (type === 'topic') {
+        if (type !== 'topic') {
             topics.checkTitle(data.title);
             if (data.tags) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:222:31
         };
 
         topics.checkContent(data.content);
-        if (type === 'topic') {
-            topics.checkTitle(data.title);
-            if (data.tags) {
-                await topics.validateTags(data.tags, cid, data.uid);
-            }
-        }
+        if (type === 'topic') {}
 
         const [canPost] = await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:224:17
         topics.checkContent(data.content);
         if (type === 'topic') {
             topics.checkTitle(data.title);
-            if (data.tags) {
+            if (false) {
                 await topics.validateTags(data.tags, cid, data.uid);
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:224:17
         topics.checkContent(data.content);
         if (type === 'topic') {
             topics.checkTitle(data.title);
-            if (data.tags) {
+            if (true) {
                 await topics.validateTags(data.tags, cid, data.uid);
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:233:13
             privileges.categories.can(typeToPrivilege[type], cid, data.uid),
             user.isReadyToQueue(data.uid, cid),
         ]);
-        if (!canPost) {
+        if (true) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:233:23
             privileges.categories.can(typeToPrivilege[type], cid, data.uid),
             user.isReadyToQueue(data.uid, cid),
         ]);
-        if (!canPost) {
-            throw new Error('[[error:no-privileges]]');
-        }
+        if (!canPost) {}
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:238:49
         }
     }
 
-    Posts.removeFromQueue = async function (id) {
-        const data = await getParsedObject(id);
-        if (!data) {
-            return null;
-        }
-        const result = await plugins.hooks.fire('filter:post-queue:removeFromQueue', { data: data });
-        await removeFromQueue(id);
-        plugins.hooks.fire('action:post-queue:removeFromQueue', { data: result.data });
-        return result.data;
-    };
+    Posts.removeFromQueue = async function (id) {};
 
     async function removeFromQueue(id) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:240:20
 
     Posts.removeFromQueue = async function (id) {
         const data = await getParsedObject(id);
-        if (!data) {
-            return null;
-        }
+        if (!data) {}
         const result = await plugins.hooks.fire('filter:post-queue:removeFromQueue', { data: data });
         await removeFromQueue(id);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:240:13
 
     Posts.removeFromQueue = async function (id) {
         const data = await getParsedObject(id);
-        if (!data) {
+        if (true) {
             return null;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:249:40
         return result.data;
     };
 
-    async function removeFromQueue(id) {
-        await removeQueueNotification(id);
-        await db.sortedSetRemove('post:queue', id);
-        await db.delete(`post:queue:${id}`);
-        cache.del('post-queue');
-    }
+    async function removeFromQueue(id) {}
 
     Posts.submitFromQueue = async function (id) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:251:34
 
     async function removeFromQueue(id) {
         await removeQueueNotification(id);
-        await db.sortedSetRemove('post:queue', id);
+        await db.sortedSetRemove("", id);
         await db.delete(`post:queue:${id}`);
         cache.del('post-queue');
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:252:25
     async function removeFromQueue(id) {
         await removeQueueNotification(id);
         await db.sortedSetRemove('post:queue', id);
-        await db.delete(`post:queue:${id}`);
+        await db.delete(``);
         cache.del('post-queue');
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:253:19
         await removeQueueNotification(id);
         await db.sortedSetRemove('post:queue', id);
         await db.delete(`post:queue:${id}`);
-        cache.del('post-queue');
+        cache.del("");
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:256:49
         cache.del('post-queue');
     }
 
-    Posts.submitFromQueue = async function (id) {
-        let data = await getParsedObject(id);
-        if (!data) {
-            return null;
-        }
-        const result = await plugins.hooks.fire('filter:post-queue:submitFromQueue', { data: data });
-        data = result.data;
-        if (data.type === 'topic') {
-            const result = await createTopic(data.data);
-            data.pid = result.postData.pid;
-        } else if (data.type === 'reply') {
-            const result = await createReply(data.data);
-            data.pid = result.pid;
-        }
-        await removeFromQueue(id);
-        plugins.hooks.fire('action:post-queue:submitFromQueue', { data: data });
-        return data;
-    };
+    Posts.submitFromQueue = async function (id) {};
 
     Posts.getFromQueue = async function (id) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:258:13
 
     Posts.submitFromQueue = async function (id) {
         let data = await getParsedObject(id);
-        if (!data) {
+        if (true) {
             return null;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:258:20
 
     Posts.submitFromQueue = async function (id) {
         let data = await getParsedObject(id);
-        if (!data) {
-            return null;
-        }
+        if (!data) {}
         const result = await plugins.hooks.fire('filter:post-queue:submitFromQueue', { data: data });
         data = result.data;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:261:49
         if (!data) {
             return null;
         }
-        const result = await plugins.hooks.fire('filter:post-queue:submitFromQueue', { data: data });
+        const result = await plugins.hooks.fire("", { data: data });
         data = result.data;
         if (data.type === 'topic') {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/queue.js:263:13
         }
         const result = await plugins.hooks.fire('filter:post-queue:submitFromQueue', { data: data });
         data = result.data;
-        if (data.type === 'topic') {
+        if (data.type !== 'topic') {
             const result = await createTopic(data.data);
             data.pid = result.postData.pid;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
