[Killed] ConditionalExpression
src/posts/queue.js:263:13
         }
         const result = await plugins.hooks.fire('filter:post-queue:submitFromQueue', { data: data });
         data = result.data;
-        if (data.type === 'topic') {
+        if (false) {
             const result = await createTopic(data.data);
             data.pid = result.postData.pid;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:266:43
         if (data.type === 'topic') {
             const result = await createTopic(data.data);
             data.pid = result.postData.pid;
-        } else if (data.type === 'reply') {
-            const result = await createReply(data.data);
-            data.pid = result.pid;
-        }
+        } else if (data.type === 'reply') {}
         await removeFromQueue(id);
         plugins.hooks.fire('action:post-queue:submitFromQueue', { data: data });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:266:20
         if (data.type === 'topic') {
             const result = await createTopic(data.data);
             data.pid = result.postData.pid;
-        } else if (data.type === 'reply') {
+        } else if (true) {
             const result = await createReply(data.data);
             data.pid = result.pid;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:275:46
         return data;
     };
 
-    Posts.getFromQueue = async function (id) {
-        return await getParsedObject(id);
-    };
+    Posts.getFromQueue = async function (id) {};
 
     async function getParsedObject(id) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:279:40
         return await getParsedObject(id);
     };
 
-    async function getParsedObject(id) {
-        const data = await db.getObject(`post:queue:${id}`);
-        if (!data) {
-            return null;
-        }
-        data.data = JSON.parse(data.data);
-        data.data.fromQueue = true;
-        return data;
-    }
+    async function getParsedObject(id) {}
 
     async function createTopic(data) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:280:41
     };
 
     async function getParsedObject(id) {
-        const data = await db.getObject(`post:queue:${id}`);
+        const data = await db.getObject(``);
         if (!data) {
             return null;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/queue.js:281:13
 
     async function getParsedObject(id) {
         const data = await db.getObject(`post:queue:${id}`);
-        if (!data) {
+        if (data) {
             return null;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:281:20
 
     async function getParsedObject(id) {
         const data = await db.getObject(`post:queue:${id}`);
-        if (!data) {
-            return null;
-        }
+        if (!data) {}
         data.data = JSON.parse(data.data);
         data.data.fromQueue = true;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/queue.js:285:31
             return null;
         }
         data.data = JSON.parse(data.data);
-        data.data.fromQueue = true;
+        data.data.fromQueue = false;
         return data;
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:289:38
         return data;
     }
 
-    async function createTopic(data) {
-        const result = await topics.post(data);
-        socketHelpers.notifyNew(data.uid, 'newTopic', { posts: [result.postData], topic: result.topicData });
-        return result;
-    }
+    async function createTopic(data) {}
 
     async function createReply(data) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:291:43
 
     async function createTopic(data) {
         const result = await topics.post(data);
-        socketHelpers.notifyNew(data.uid, 'newTopic', { posts: [result.postData], topic: result.topicData });
+        socketHelpers.notifyNew(data.uid, "", { posts: [result.postData], topic: result.topicData });
         return result;
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/queue.js:291:64
 
     async function createTopic(data) {
         const result = await topics.post(data);
-        socketHelpers.notifyNew(data.uid, 'newTopic', { posts: [result.postData], topic: result.topicData });
+        socketHelpers.notifyNew(data.uid, 'newTopic', { posts: [], topic: result.topicData });
         return result;
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:295:38
         return result;
     }
 
-    async function createReply(data) {
-        const postData = await topics.reply(data);
-        const result = {
-            posts: [postData],
-            'reputation:disabled': !!meta.config['reputation:disabled'],
-            'downvote:disabled': !!meta.config['downvote:disabled'],
-        };
-        socketHelpers.notifyNew(data.uid, 'newPost', result);
-        return postData;
-    }
+    async function createReply(data) {}
 
     Posts.editQueuedContent = async function (uid, editData) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/queue.js:299:36
         const postData = await topics.reply(data);
         const result = {
             posts: [postData],
-            'reputation:disabled': !!meta.config['reputation:disabled'],
+            'reputation:disabled': !meta.config['reputation:disabled'],
             'downvote:disabled': !!meta.config['downvote:disabled'],
         };
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] BooleanLiteral
src/posts/queue.js:300:34
         const result = {
             posts: [postData],
             'reputation:disabled': !!meta.config['reputation:disabled'],
-            'downvote:disabled': !!meta.config['downvote:disabled'],
+            'downvote:disabled': !meta.config['downvote:disabled'],
         };
         socketHelpers.notifyNew(data.uid, 'newPost', result);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:306:62
         return postData;
     }
 
-    Posts.editQueuedContent = async function (uid, editData) {
-        const canEditQueue = await Posts.canEditQueue(uid, editData, 'edit');
-        if (!canEditQueue) {
-            throw new Error('[[error:no-privileges]]');
-        }
-        const data = await getParsedObject(editData.id);
-        if (!data) {
-            return;
-        }
-        if (editData.content !== undefined) {
-            data.data.content = editData.content;
-        }
-        if (editData.title !== undefined) {
-            data.data.title = editData.title;
-        }
-        if (editData.cid !== undefined) {
-            data.data.cid = editData.cid;
-        }
-        await db.setObjectField(`post:queue:${editData.id}`, 'data', JSON.stringify(data.data));
-        cache.del('post-queue');
-    };
+    Posts.editQueuedContent = async function (uid, editData) {};
 
     Posts.canEditQueue = async function (uid, editData, action) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:307:70
     }
 
     Posts.editQueuedContent = async function (uid, editData) {
-        const canEditQueue = await Posts.canEditQueue(uid, editData, 'edit');
+        const canEditQueue = await Posts.canEditQueue(uid, editData, "");
         if (!canEditQueue) {
             throw new Error('[[error:no-privileges]]');
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/queue.js:308:13
 
     Posts.editQueuedContent = async function (uid, editData) {
         const canEditQueue = await Posts.canEditQueue(uid, editData, 'edit');
-        if (!canEditQueue) {
+        if (canEditQueue) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:308:28
 
     Posts.editQueuedContent = async function (uid, editData) {
         const canEditQueue = await Posts.canEditQueue(uid, editData, 'edit');
-        if (!canEditQueue) {
-            throw new Error('[[error:no-privileges]]');
-        }
+        if (!canEditQueue) {}
         const data = await getParsedObject(editData.id);
         if (!data) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:312:20
             throw new Error('[[error:no-privileges]]');
         }
         const data = await getParsedObject(editData.id);
-        if (!data) {
-            return;
-        }
+        if (!data) {}
         if (editData.content !== undefined) {
             data.data.content = editData.content;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:312:13
             throw new Error('[[error:no-privileges]]');
         }
         const data = await getParsedObject(editData.id);
-        if (!data) {
+        if (true) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:315:13
         if (!data) {
             return;
         }
-        if (editData.content !== undefined) {
+        if (true) {
             data.data.content = editData.content;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:315:45
         if (!data) {
             return;
         }
-        if (editData.content !== undefined) {
-            data.data.content = editData.content;
-        }
+        if (editData.content !== undefined) {}
         if (editData.title !== undefined) {
             data.data.title = editData.title;
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] EqualityOperator
src/posts/queue.js:318:13
         if (editData.content !== undefined) {
             data.data.content = editData.content;
         }
-        if (editData.title !== undefined) {
+        if (editData.title === undefined) {
             data.data.title = editData.title;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:318:13
         if (editData.content !== undefined) {
             data.data.content = editData.content;
         }
-        if (editData.title !== undefined) {
+        if (false) {
             data.data.title = editData.title;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:321:13
         if (editData.title !== undefined) {
             data.data.title = editData.title;
         }
-        if (editData.cid !== undefined) {
+        if (false) {
             data.data.cid = editData.cid;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:321:13
         if (editData.title !== undefined) {
             data.data.title = editData.title;
         }
-        if (editData.cid !== undefined) {
+        if (true) {
             data.data.cid = editData.cid;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/queue.js:324:62
         if (editData.cid !== undefined) {
             data.data.cid = editData.cid;
         }
-        await db.setObjectField(`post:queue:${editData.id}`, 'data', JSON.stringify(data.data));
+        await db.setObjectField(`post:queue:${editData.id}`, "", JSON.stringify(data.data));
         cache.del('post-queue');
     };
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] StringLiteral
src/posts/queue.js:325:19
             data.data.cid = editData.cid;
         }
         await db.setObjectField(`post:queue:${editData.id}`, 'data', JSON.stringify(data.data));
-        cache.del('post-queue');
+        cache.del("");
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/queue.js:333:13
             user.isAdminOrGlobalMod(uid),
             getParsedObject(editData.id),
         ]);
-        if (!data) {
+        if (data) {
             return false;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:333:13
             user.isAdminOrGlobalMod(uid),
             getParsedObject(editData.id),
         ]);
-        if (!data) {
+        if (false) {
             return false;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/queue.js:334:20
             getParsedObject(editData.id),
         ]);
         if (!data) {
-            return false;
+            return true;
         }
         const selfPost = parseInt(uid, 10) === parseInt(data.uid, 10);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:336:26
         if (!data) {
             return false;
         }
-        const selfPost = parseInt(uid, 10) === parseInt(data.uid, 10);
+        const selfPost = true;
         if (isAdminOrGlobalMod || ((action === 'reject' || action === 'edit') && selfPost)) {
             return true;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/queue.js:336:26
         if (!data) {
             return false;
         }
-        const selfPost = parseInt(uid, 10) === parseInt(data.uid, 10);
+        const selfPost = parseInt(uid, 10) !== parseInt(data.uid, 10);
         if (isAdminOrGlobalMod || ((action === 'reject' || action === 'edit') && selfPost)) {
             return true;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:337:36
             return false;
         }
         const selfPost = parseInt(uid, 10) === parseInt(data.uid, 10);
-        if (isAdminOrGlobalMod || ((action === 'reject' || action === 'edit') && selfPost)) {
+        if (isAdminOrGlobalMod || (false)) {
             return true;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:337:60
             return false;
         }
         const selfPost = parseInt(uid, 10) === parseInt(data.uid, 10);
-        if (isAdminOrGlobalMod || ((action === 'reject' || action === 'edit') && selfPost)) {
+        if (isAdminOrGlobalMod || ((action === 'reject' || false) && selfPost)) {
             return true;
         }
killedBy: POST /ping: response status code should match one of the schema defined responses
statusReason: POST /ping sent back unexpected HTTP status code: 401 {"status":{"code":"not-authorised","message":"A valid login session was not found. Please log in and try again."},"response":{}}

[Killed] BooleanLiteral
src/posts/queue.js:338:20
         }
         const selfPost = parseInt(uid, 10) === parseInt(data.uid, 10);
         if (isAdminOrGlobalMod || ((action === 'reject' || action === 'edit') && selfPost)) {
-            return true;
+            return false;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:342:13
         }
 
         let cid;
-        if (data.type === 'topic') {
+        if (true) {
             cid = data.data.cid;
         } else if (data.type === 'reply') {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:342:13
         }
 
         let cid;
-        if (data.type === 'topic') {
+        if (false) {
             cid = data.data.cid;
         } else if (data.type === 'reply') {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:344:20
         let cid;
         if (data.type === 'topic') {
             cid = data.data.cid;
-        } else if (data.type === 'reply') {
+        } else if (true) {
             cid = await topics.getTopicField(data.data.tid, 'cid');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:344:43
         let cid;
         if (data.type === 'topic') {
             cid = data.data.cid;
-        } else if (data.type === 'reply') {
-            cid = await topics.getTopicField(data.data.tid, 'cid');
-        }
+        } else if (data.type === 'reply') {}
         const isModerator = await user.isModerator(uid, cid);
         let isModeratorOfTargetCid = true;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/queue.js:348:38
             cid = await topics.getTopicField(data.data.tid, 'cid');
         }
         const isModerator = await user.isModerator(uid, cid);
-        let isModeratorOfTargetCid = true;
+        let isModeratorOfTargetCid = false;
         if (editData.cid) {
             isModeratorOfTargetCid = await user.isModerator(uid, editData.cid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:349:27
         }
         const isModerator = await user.isModerator(uid, cid);
         let isModeratorOfTargetCid = true;
-        if (editData.cid) {
-            isModeratorOfTargetCid = await user.isModerator(uid, editData.cid);
-        }
+        if (editData.cid) {}
         return isModerator && isModeratorOfTargetCid;
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:349:13
         }
         const isModerator = await user.isModerator(uid, cid);
         let isModeratorOfTargetCid = true;
-        if (editData.cid) {
+        if (false) {
             isModeratorOfTargetCid = await user.isModerator(uid, editData.cid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:352:16
         if (editData.cid) {
             isModeratorOfTargetCid = await user.isModerator(uid, editData.cid);
         }
-        return isModerator && isModeratorOfTargetCid;
+        return true;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:352:16
         if (editData.cid) {
             isModeratorOfTargetCid = await user.isModerator(uid, editData.cid);
         }
-        return isModerator && isModeratorOfTargetCid;
+        return false;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:355:66
         return isModerator && isModeratorOfTargetCid;
     };
 
-    Posts.updateQueuedPostsTopic = async function (newTid, tids) {
-        const postData = await Posts.getQueuedPosts({ tid: tids }, { metadata: false });
-        if (postData.length) {
-            postData.forEach((post) => {
-                post.data.tid = newTid;
-            });
-            await db.setObjectBulk(
-                postData.map(p => [`post:queue:${p.id}`, { data: JSON.stringify(p.data) }]),
-            );
-            cache.del('post-queue');
-        }
-    };
+    Posts.updateQueuedPostsTopic = async function (newTid, tids) {};
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/queue.js:356:80
     };
 
     Posts.updateQueuedPostsTopic = async function (newTid, tids) {
-        const postData = await Posts.getQueuedPosts({ tid: tids }, { metadata: false });
+        const postData = await Posts.getQueuedPosts({ tid: tids }, { metadata: true });
         if (postData.length) {
             postData.forEach((post) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/queue.js:356:68
     };
 
     Posts.updateQueuedPostsTopic = async function (newTid, tids) {
-        const postData = await Posts.getQueuedPosts({ tid: tids }, { metadata: false });
+        const postData = await Posts.getQueuedPosts({ tid: tids }, {});
         if (postData.length) {
             postData.forEach((post) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/queue.js:357:13
 
     Posts.updateQueuedPostsTopic = async function (newTid, tids) {
         const postData = await Posts.getQueuedPosts({ tid: tids }, { metadata: false });
-        if (postData.length) {
+        if (false) {
             postData.forEach((post) => {
                 post.data.tid = newTid;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:357:30
 
     Posts.updateQueuedPostsTopic = async function (newTid, tids) {
         const postData = await Posts.getQueuedPosts({ tid: tids }, { metadata: false });
-        if (postData.length) {
-            postData.forEach((post) => {
-                post.data.tid = newTid;
-            });
-            await db.setObjectBulk(
-                postData.map(p => [`post:queue:${p.id}`, { data: JSON.stringify(p.data) }]),
-            );
-            cache.del('post-queue');
-        }
+        if (postData.length) {}
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/queue.js:358:40
     Posts.updateQueuedPostsTopic = async function (newTid, tids) {
         const postData = await Posts.getQueuedPosts({ tid: tids }, { metadata: false });
         if (postData.length) {
-            postData.forEach((post) => {
-                post.data.tid = newTid;
-            });
+            postData.forEach((post) => {});
             await db.setObjectBulk(
                 postData.map(p => [`post:queue:${p.id}`, { data: JSON.stringify(p.data) }]),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/queue.js:362:30
                 post.data.tid = newTid;
             });
             await db.setObjectBulk(
-                postData.map(p => [`post:queue:${p.id}`, { data: JSON.stringify(p.data) }]),
+                postData.map(() => undefined),
             );
             cache.del('post-queue');
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/queue.js:362:35
                 post.data.tid = newTid;
             });
             await db.setObjectBulk(
-                postData.map(p => [`post:queue:${p.id}`, { data: JSON.stringify(p.data) }]),
+                postData.map(p => []),
             );
             cache.del('post-queue');
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
