[Killed] BlockStatement
src/posts/delete.js:14:46
 const flags = require('../flags');
 
 module.exports = function (Posts) {
-    Posts.delete = async function (pid, uid) {
-        return await deleteOrRestore('delete', pid, uid);
-    };
+    Posts.delete = async function (pid, uid) {};
 
     Posts.restore = async function (pid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:18:47
         return await deleteOrRestore('delete', pid, uid);
     };
 
-    Posts.restore = async function (pid, uid) {
-        return await deleteOrRestore('restore', pid, uid);
-    };
+    Posts.restore = async function (pid, uid) {};
 
     async function deleteOrRestore(type, pid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:22:52
         return await deleteOrRestore('restore', pid, uid);
     };
 
-    async function deleteOrRestore(type, pid, uid) {
-        const isDeleting = type === 'delete';
-        await plugins.hooks.fire(`filter:post.${type}`, { pid: pid, uid: uid });
-        await Posts.setPostFields(pid, {
-            deleted: isDeleting ? 1 : 0,
-            deleterUid: isDeleting ? uid : 0,
-        });
-        const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp']);
-        const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
-        postData.cid = topicData.cid;
-        await Promise.all([
-            topics.updateLastPostTimeFromLastPid(postData.tid),
-            topics.updateTeaser(postData.tid),
-            isDeleting ?
-                db.sortedSetRemove(`cid:${topicData.cid}:pids`, pid) :
-                db.sortedSetAdd(`cid:${topicData.cid}:pids`, postData.timestamp, pid),
-        ]);
-        await categories.updateRecentTidForCid(postData.cid);
-        plugins.hooks.fire(`action:post.${type}`, { post: _.clone(postData), uid: uid });
-        if (type === 'delete') {
-            await flags.resolveFlag('post', pid, uid);
-        }
-        return postData;
-    }
+    async function deleteOrRestore(type, pid, uid) {}
 
     Posts.purge = async function (pids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/delete.js:23:28
     };
 
     async function deleteOrRestore(type, pid, uid) {
-        const isDeleting = type === 'delete';
+        const isDeleting = true;
         await plugins.hooks.fire(`filter:post.${type}`, { pid: pid, uid: uid });
         await Posts.setPostFields(pid, {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/delete.js:23:28
     };
 
     async function deleteOrRestore(type, pid, uid) {
-        const isDeleting = type === 'delete';
+        const isDeleting = type !== 'delete';
         await plugins.hooks.fire(`filter:post.${type}`, { pid: pid, uid: uid });
         await Posts.setPostFields(pid, {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:29:79
             deleted: isDeleting ? 1 : 0,
             deleterUid: isDeleting ? uid : 0,
         });
-        const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp']);
+        const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', "", 'timestamp']);
         const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
         postData.cid = topicData.cid;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:29:65
             deleted: isDeleting ? 1 : 0,
             deleterUid: isDeleting ? uid : 0,
         });
-        const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp']);
+        const postData = await Posts.getPostFields(pid, ['pid', "", 'uid', 'content', 'timestamp']);
         const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
         postData.cid = topicData.cid;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:30:77
             deleterUid: isDeleting ? uid : 0,
         });
         const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp']);
-        const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
+        const topicData = await topics.getTopicFields(postData.tid, ['tid', "", 'pinned']);
         postData.cid = topicData.cid;
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:30:70
             deleterUid: isDeleting ? uid : 0,
         });
         const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp']);
-        const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
+        const topicData = await topics.getTopicFields(postData.tid, ["", 'cid', 'pinned']);
         postData.cid = topicData.cid;
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/delete.js:41:13
         ]);
         await categories.updateRecentTidForCid(postData.cid);
         plugins.hooks.fire(`action:post.${type}`, { post: _.clone(postData), uid: uid });
-        if (type === 'delete') {
+        if (type !== 'delete') {
             await flags.resolveFlag('post', pid, uid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/delete.js:41:13
         ]);
         await categories.updateRecentTidForCid(postData.cid);
         plugins.hooks.fire(`action:post.${type}`, { post: _.clone(postData), uid: uid });
-        if (type === 'delete') {
+        if (true) {
             await flags.resolveFlag('post', pid, uid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/delete.js:50:44
     Posts.purge = async function (pids, uid) {
         pids = Array.isArray(pids) ? pids : [pids];
         let postData = await Posts.getPostsData(pids);
-        pids = pids.filter((pid, index) => !!postData[index]);
+        pids = pids.filter((pid, index) => !postData[index]);
         postData = postData.filter(Boolean);
         if (!postData.length) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/delete.js:51:20
         pids = Array.isArray(pids) ? pids : [pids];
         let postData = await Posts.getPostsData(pids);
         pids = pids.filter((pid, index) => !!postData[index]);
-        postData = postData.filter(Boolean);
+        postData = postData;
         if (!postData.length) {
             return;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/delete.js:52:13
         let postData = await Posts.getPostsData(pids);
         pids = pids.filter((pid, index) => !!postData[index]);
         postData = postData.filter(Boolean);
-        if (!postData.length) {
+        if (postData.length) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:52:31
         let postData = await Posts.getPostsData(pids);
         pids = pids.filter((pid, index) => !!postData[index]);
         postData = postData.filter(Boolean);
-        if (!postData.length) {
-            return;
-        }
+        if (!postData.length) {}
         const uniqTids = _.uniq(postData.map(p => p.tid));
         const topicData = await topics.getTopicsFields(uniqTids, ['tid', 'cid', 'pinned', 'postcount']);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:55:46
         if (!postData.length) {
             return;
         }
-        const uniqTids = _.uniq(postData.map(p => p.tid));
+        const uniqTids = _.uniq(postData.map(() => undefined));
         const topicData = await topics.getTopicsFields(uniqTids, ['tid', 'cid', 'pinned', 'postcount']);
         const tidToTopic = _.zipObject(uniqTids, topicData);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:56:91
             return;
         }
         const uniqTids = _.uniq(postData.map(p => p.tid));
-        const topicData = await topics.getTopicsFields(uniqTids, ['tid', 'cid', 'pinned', 'postcount']);
+        const topicData = await topics.getTopicsFields(uniqTids, ['tid', 'cid', 'pinned', ""]);
         const tidToTopic = _.zipObject(uniqTids, topicData);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:59:33
         const topicData = await topics.getTopicsFields(uniqTids, ['tid', 'cid', 'pinned', 'postcount']);
         const tidToTopic = _.zipObject(uniqTids, topicData);
 
-        postData.forEach((p) => {
-            p.topic = tidToTopic[p.tid];
-            p.cid = tidToTopic[p.tid] && tidToTopic[p.tid].cid;
-        });
+        postData.forEach((p) => {});
 
         // deprecated hook
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/delete.js:61:21
 
         postData.forEach((p) => {
             p.topic = tidToTopic[p.tid];
-            p.cid = tidToTopic[p.tid] && tidToTopic[p.tid].cid;
+            p.cid = tidToTopic[p.tid] || tidToTopic[p.tid].cid;
         });
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/delete.js:61:21
 
         postData.forEach((p) => {
             p.topic = tidToTopic[p.tid];
-            p.cid = tidToTopic[p.tid] && tidToTopic[p.tid].cid;
+            p.cid = true;
         });
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:65:40
         });
 
         // deprecated hook
-        await Promise.all(postData.map(p => plugins.hooks.fire('filter:post.purge', { post: p, pid: p.pid, uid: uid })));
+        await Promise.all(postData.map(() => undefined));
 
         // new hook
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:65:64
         });
 
         // deprecated hook
-        await Promise.all(postData.map(p => plugins.hooks.fire('filter:post.purge', { post: p, pid: p.pid, uid: uid })));
+        await Promise.all(postData.map(p => plugins.hooks.fire("", { post: p, pid: p.pid, uid: uid })));
 
         // new hook
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/delete.js:68:56
         await Promise.all(postData.map(p => plugins.hooks.fire('filter:post.purge', { post: p, pid: p.pid, uid: uid })));
 
         // new hook
-        await plugins.hooks.fire('filter:posts.purge', {
-            posts: postData,
-            pids: postData.map(p => p.pid),
-            uid: uid,
-        });
+        await plugins.hooks.fire('filter:posts.purge', {});
 
         await Promise.all([
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] StringLiteral
src/posts/delete.js:68:34
         await Promise.all(postData.map(p => plugins.hooks.fire('filter:post.purge', { post: p, pid: p.pid, uid: uid })));
 
         // new hook
-        await plugins.hooks.fire('filter:posts.purge', {
+        await plugins.hooks.fire("", {
             posts: postData,
             pids: postData.map(p => p.pid),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:70:32
         // new hook
         await plugins.hooks.fire('filter:posts.purge', {
             posts: postData,
-            pids: postData.map(p => p.pid),
+            pids: postData.map(() => undefined),
             uid: uid,
         });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:90:34
         await resolveFlags(postData, uid);
 
         // deprecated hook
-        Promise.all(postData.map(p => plugins.hooks.fire('action:post.purge', { post: p, uid: uid })));
+        Promise.all(postData.map(() => undefined));
 
         // new hook
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:90:58
         await resolveFlags(postData, uid);
 
         // deprecated hook
-        Promise.all(postData.map(p => plugins.hooks.fire('action:post.purge', { post: p, uid: uid })));
+        Promise.all(postData.map(p => plugins.hooks.fire("", { post: p, uid: uid })));
 
         // new hook
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] ObjectLiteral
src/posts/delete.js:93:50
         Promise.all(postData.map(p => plugins.hooks.fire('action:post.purge', { post: p, uid: uid })));
 
         // new hook
-        plugins.hooks.fire('action:posts.purge', { posts: postData, uid: uid });
+        plugins.hooks.fire('action:posts.purge', {});
 
         await db.deleteAll(postData.map(p => `post:${p.pid}`));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:95:41
         // new hook
         plugins.hooks.fire('action:posts.purge', { posts: postData, uid: uid });
 
-        await db.deleteAll(postData.map(p => `post:${p.pid}`));
+        await db.deleteAll(postData.map(() => undefined));
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:95:46
         // new hook
         plugins.hooks.fire('action:posts.purge', { posts: postData, uid: uid });
 
-        await db.deleteAll(postData.map(p => `post:${p.pid}`));
+        await db.deleteAll(postData.map(p => ``));
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:99:28
     };
 
     async function deleteFromTopicUserNotification(postData) {
-        const bulkRemove = [];
+        const bulkRemove = ["Stryker was here"];
         postData.forEach((p) => {
             bulkRemove.push([`tid:${p.tid}:posts`, p.pid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:100:33
 
     async function deleteFromTopicUserNotification(postData) {
         const bulkRemove = [];
-        postData.forEach((p) => {
-            bulkRemove.push([`tid:${p.tid}:posts`, p.pid]);
-            bulkRemove.push([`tid:${p.tid}:posts:votes`, p.pid]);
-            bulkRemove.push([`uid:${p.uid}:posts`, p.pid]);
-            bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids`, p.pid]);
-            bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids:votes`, p.pid]);
-        });
+        postData.forEach((p) => {});
         await db.sortedSetRemoveBulk(bulkRemove);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:101:29
     async function deleteFromTopicUserNotification(postData) {
         const bulkRemove = [];
         postData.forEach((p) => {
-            bulkRemove.push([`tid:${p.tid}:posts`, p.pid]);
+            bulkRemove.push([]);
             bulkRemove.push([`tid:${p.tid}:posts:votes`, p.pid]);
             bulkRemove.push([`uid:${p.uid}:posts`, p.pid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:101:30
     async function deleteFromTopicUserNotification(postData) {
         const bulkRemove = [];
         postData.forEach((p) => {
-            bulkRemove.push([`tid:${p.tid}:posts`, p.pid]);
+            bulkRemove.push([``, p.pid]);
             bulkRemove.push([`tid:${p.tid}:posts:votes`, p.pid]);
             bulkRemove.push([`uid:${p.uid}:posts`, p.pid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:103:29
         postData.forEach((p) => {
             bulkRemove.push([`tid:${p.tid}:posts`, p.pid]);
             bulkRemove.push([`tid:${p.tid}:posts:votes`, p.pid]);
-            bulkRemove.push([`uid:${p.uid}:posts`, p.pid]);
+            bulkRemove.push([]);
             bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids`, p.pid]);
             bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids:votes`, p.pid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:105:30
             bulkRemove.push([`tid:${p.tid}:posts:votes`, p.pid]);
             bulkRemove.push([`uid:${p.uid}:posts`, p.pid]);
             bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids`, p.pid]);
-            bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids:votes`, p.pid]);
+            bulkRemove.push([``, p.pid]);
         });
         await db.sortedSetRemoveBulk(bulkRemove);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] UnaryOperator
src/posts/delete.js:109:57
         });
         await db.sortedSetRemoveBulk(bulkRemove);
 
-        const incrObjectBulk = [['global', { postCount: -postData.length }]];
+        const incrObjectBulk = [['global', { postCount: +postData.length }]];
 
         const postsByCategory = _.groupBy(postData, p => parseInt(p.cid, 10));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:109:34
         });
         await db.sortedSetRemoveBulk(bulkRemove);
 
-        const incrObjectBulk = [['global', { postCount: -postData.length }]];
+        const incrObjectBulk = [["", { postCount: -postData.length }]];
 
         const postsByCategory = _.groupBy(postData, p => parseInt(p.cid, 10));
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] ArrowFunction
src/posts/delete.js:111:53
 
         const incrObjectBulk = [['global', { postCount: -postData.length }]];
 
-        const postsByCategory = _.groupBy(postData, p => parseInt(p.cid, 10));
+        const postsByCategory = _.groupBy(postData, () => undefined);
         for (const [cid, posts] of Object.entries(postsByCategory)) {
             incrObjectBulk.push([`category:${cid}`, { post_count: -posts.length }]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:112:69
         const incrObjectBulk = [['global', { postCount: -postData.length }]];
 
         const postsByCategory = _.groupBy(postData, p => parseInt(p.cid, 10));
-        for (const [cid, posts] of Object.entries(postsByCategory)) {
-            incrObjectBulk.push([`category:${cid}`, { post_count: -posts.length }]);
-        }
+        for (const [cid, posts] of Object.entries(postsByCategory)) {}
 
         const postsByTopic = _.groupBy(postData, p => parseInt(p.tid, 10));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] UnaryOperator
src/posts/delete.js:113:67
 
         const postsByCategory = _.groupBy(postData, p => parseInt(p.cid, 10));
         for (const [cid, posts] of Object.entries(postsByCategory)) {
-            incrObjectBulk.push([`category:${cid}`, { post_count: -posts.length }]);
+            incrObjectBulk.push([`category:${cid}`, { post_count: +posts.length }]);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:113:33
 
         const postsByCategory = _.groupBy(postData, p => parseInt(p.cid, 10));
         for (const [cid, posts] of Object.entries(postsByCategory)) {
-            incrObjectBulk.push([`category:${cid}`, { post_count: -posts.length }]);
+            incrObjectBulk.push([]);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:116:50
             incrObjectBulk.push([`category:${cid}`, { post_count: -posts.length }]);
         }
 
-        const postsByTopic = _.groupBy(postData, p => parseInt(p.tid, 10));
+        const postsByTopic = _.groupBy(postData, () => undefined);
         const topicPostCountTasks = [];
         const topicTasks = [];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:117:37
         }
 
         const postsByTopic = _.groupBy(postData, p => parseInt(p.tid, 10));
-        const topicPostCountTasks = [];
+        const topicPostCountTasks = ["Stryker was here"];
         const topicTasks = [];
         const zsetIncrBulk = [];
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-category]]

[Killed] BlockStatement
src/posts/delete.js:120:66
         const topicPostCountTasks = [];
         const topicTasks = [];
         const zsetIncrBulk = [];
-        for (const [tid, posts] of Object.entries(postsByTopic)) {
-            incrObjectBulk.push([`topic:${tid}`, { postcount: -posts.length }]);
-            if (posts.length && posts[0]) {
-                const topicData = posts[0].topic;
-                const newPostCount = topicData.postcount - posts.length;
-                topicPostCountTasks.push(['topics:posts', newPostCount, tid]);
-                if (!topicData.pinned) {
-                    zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
-                }
-            }
-            topicTasks.push(topics.updateTeaser(tid));
-            topicTasks.push(topics.updateLastPostTimeFromLastPid(tid));
-            const postsByUid = _.groupBy(posts, p => parseInt(p.uid, 10));
-            for (const [uid, uidPosts] of Object.entries(postsByUid)) {
-                zsetIncrBulk.push([`tid:${tid}:posters`, -uidPosts.length, uid]);
-            }
-            topicTasks.push(db.sortedSetIncrByBulk(zsetIncrBulk));
-        }
+        for (const [tid, posts] of Object.entries(postsByTopic)) {}
 
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] UnaryOperator
src/posts/delete.js:121:63
         const topicTasks = [];
         const zsetIncrBulk = [];
         for (const [tid, posts] of Object.entries(postsByTopic)) {
-            incrObjectBulk.push([`topic:${tid}`, { postcount: -posts.length }]);
+            incrObjectBulk.push([`topic:${tid}`, { postcount: +posts.length }]);
             if (posts.length && posts[0]) {
                 const topicData = posts[0].topic;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:121:33
         const topicTasks = [];
         const zsetIncrBulk = [];
         for (const [tid, posts] of Object.entries(postsByTopic)) {
-            incrObjectBulk.push([`topic:${tid}`, { postcount: -posts.length }]);
+            incrObjectBulk.push([]);
             if (posts.length && posts[0]) {
                 const topicData = posts[0].topic;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/delete.js:122:17
         const zsetIncrBulk = [];
         for (const [tid, posts] of Object.entries(postsByTopic)) {
             incrObjectBulk.push([`topic:${tid}`, { postcount: -posts.length }]);
-            if (posts.length && posts[0]) {
+            if (false) {
                 const topicData = posts[0].topic;
                 const newPostCount = topicData.postcount - posts.length;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/delete.js:122:17
         const zsetIncrBulk = [];
         for (const [tid, posts] of Object.entries(postsByTopic)) {
             incrObjectBulk.push([`topic:${tid}`, { postcount: -posts.length }]);
-            if (posts.length && posts[0]) {
+            if (true) {
                 const topicData = posts[0].topic;
                 const newPostCount = topicData.postcount - posts.length;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/delete.js:124:38
             incrObjectBulk.push([`topic:${tid}`, { postcount: -posts.length }]);
             if (posts.length && posts[0]) {
                 const topicData = posts[0].topic;
-                const newPostCount = topicData.postcount - posts.length;
+                const newPostCount = topicData.postcount + posts.length;
                 topicPostCountTasks.push(['topics:posts', newPostCount, tid]);
                 if (!topicData.pinned) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:125:42
             if (posts.length && posts[0]) {
                 const topicData = posts[0].topic;
                 const newPostCount = topicData.postcount - posts.length;
-                topicPostCountTasks.push(['topics:posts', newPostCount, tid]);
+                topicPostCountTasks.push([]);
                 if (!topicData.pinned) {
                     zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:125:43
             if (posts.length && posts[0]) {
                 const topicData = posts[0].topic;
                 const newPostCount = topicData.postcount - posts.length;
-                topicPostCountTasks.push(['topics:posts', newPostCount, tid]);
+                topicPostCountTasks.push(["", newPostCount, tid]);
                 if (!topicData.pinned) {
                     zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/delete.js:126:21
                 const topicData = posts[0].topic;
                 const newPostCount = topicData.postcount - posts.length;
                 topicPostCountTasks.push(['topics:posts', newPostCount, tid]);
-                if (!topicData.pinned) {
+                if (false) {
                     zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
                 }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
