[Killed] BlockStatement
src/posts/recent.js:9:35
 const privileges = require('../privileges');
 
 
-module.exports = function (Posts) {
-    const terms = {
-        day: 86400000,
-        week: 604800000,
-        month: 2592000000,
-    };
-
-    Posts.getRecentPosts = async function (uid, start, stop, term) {
-        let min = 0;
-        if (terms[term]) {
-            min = Date.now() - terms[term];
-        }
-
-        const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
-        let pids = await db.getSortedSetRevRangeByScore('posts:pid', start, count, '+inf', min);
-        pids = await privileges.posts.filter('topics:read', pids, uid);
-        return await Posts.getPostSummaryByPids(pids, uid, { stripTags: true });
-    };
-
-    Posts.getRecentPosterUids = async function (start, stop) {
-        const pids = await db.getSortedSetRevRange('posts:pid', start, stop);
-        const postData = await Posts.getPostsFields(pids, ['uid']);
-        return _.uniq(postData.map(p => p && p.uid).filter(uid => parseInt(uid, 10)));
-    };
-};
+module.exports = function (Posts) {};
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/recent.js:16:68
         month: 2592000000,
     };
 
-    Posts.getRecentPosts = async function (uid, start, stop, term) {
-        let min = 0;
-        if (terms[term]) {
-            min = Date.now() - terms[term];
-        }
-
-        const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
-        let pids = await db.getSortedSetRevRangeByScore('posts:pid', start, count, '+inf', min);
-        pids = await privileges.posts.filter('topics:read', pids, uid);
-        return await Posts.getPostSummaryByPids(pids, uid, { stripTags: true });
-    };
+    Posts.getRecentPosts = async function (uid, start, stop, term) {};
 
     Posts.getRecentPosterUids = async function (start, stop) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/recent.js:18:13
 
     Posts.getRecentPosts = async function (uid, start, stop, term) {
         let min = 0;
-        if (terms[term]) {
+        if (true) {
             min = Date.now() - terms[term];
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/recent.js:18:13
 
     Posts.getRecentPosts = async function (uid, start, stop, term) {
         let min = 0;
-        if (terms[term]) {
+        if (false) {
             min = Date.now() - terms[term];
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/recent.js:19:19
     Posts.getRecentPosts = async function (uid, start, stop, term) {
         let min = 0;
         if (terms[term]) {
-            min = Date.now() - terms[term];
+            min = Date.now() + terms[term];
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/recent.js:22:23
             min = Date.now() - terms[term];
         }
 
-        const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
+        const count = true ? stop : stop - start + 1;
         let pids = await db.getSortedSetRevRangeByScore('posts:pid', start, count, '+inf', min);
         pids = await privileges.posts.filter('topics:read', pids, uid);
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] ArithmeticOperator
src/posts/recent.js:22:58
             min = Date.now() - terms[term];
         }
 
-        const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
+        const count = parseInt(stop, 10) === -1 ? stop : stop + start + 1;
         let pids = await db.getSortedSetRevRangeByScore('posts:pid', start, count, '+inf', min);
         pids = await privileges.posts.filter('topics:read', pids, uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/recent.js:23:84
         }
 
         const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
-        let pids = await db.getSortedSetRevRangeByScore('posts:pid', start, count, '+inf', min);
+        let pids = await db.getSortedSetRevRangeByScore('posts:pid', start, count, "", min);
         pids = await privileges.posts.filter('topics:read', pids, uid);
         return await Posts.getPostSummaryByPids(pids, uid, { stripTags: true });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/recent.js:24:22
 
         const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
         let pids = await db.getSortedSetRevRangeByScore('posts:pid', start, count, '+inf', min);
-        pids = await privileges.posts.filter('topics:read', pids, uid);
+        pids = await privileges.posts;
         return await Posts.getPostSummaryByPids(pids, uid, { stripTags: true });
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/recent.js:25:73
         const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
         let pids = await db.getSortedSetRevRangeByScore('posts:pid', start, count, '+inf', min);
         pids = await privileges.posts.filter('topics:read', pids, uid);
-        return await Posts.getPostSummaryByPids(pids, uid, { stripTags: true });
+        return await Posts.getPostSummaryByPids(pids, uid, { stripTags: false });
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/recent.js:28:62
         return await Posts.getPostSummaryByPids(pids, uid, { stripTags: true });
     };
 
-    Posts.getRecentPosterUids = async function (start, stop) {
-        const pids = await db.getSortedSetRevRange('posts:pid', start, stop);
-        const postData = await Posts.getPostsFields(pids, ['uid']);
-        return _.uniq(postData.map(p => p && p.uid).filter(uid => parseInt(uid, 10)));
-    };
+    Posts.getRecentPosterUids = async function (start, stop) {};
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/recent.js:30:60
 
     Posts.getRecentPosterUids = async function (start, stop) {
         const pids = await db.getSortedSetRevRange('posts:pid', start, stop);
-        const postData = await Posts.getPostsFields(pids, ['uid']);
+        const postData = await Posts.getPostsFields(pids, [""]);
         return _.uniq(postData.map(p => p && p.uid).filter(uid => parseInt(uid, 10)));
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/recent.js:31:41
     Posts.getRecentPosterUids = async function (start, stop) {
         const pids = await db.getSortedSetRevRange('posts:pid', start, stop);
         const postData = await Posts.getPostsFields(pids, ['uid']);
-        return _.uniq(postData.map(p => p && p.uid).filter(uid => parseInt(uid, 10)));
+        return _.uniq(postData.map(p => false).filter(uid => parseInt(uid, 10)));
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/recent.js:31:60
     Posts.getRecentPosterUids = async function (start, stop) {
         const pids = await db.getSortedSetRevRange('posts:pid', start, stop);
         const postData = await Posts.getPostsFields(pids, ['uid']);
-        return _.uniq(postData.map(p => p && p.uid).filter(uid => parseInt(uid, 10)));
+        return _.uniq(postData.map(p => p && p.uid).filter(() => undefined));
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
