[Killed] BlockStatement
src/posts/delete.js:126:40
                 const topicData = posts[0].topic;
                 const newPostCount = topicData.postcount - posts.length;
                 topicPostCountTasks.push(['topics:posts', newPostCount, tid]);
-                if (!topicData.pinned) {
-                    zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
-                }
+                if (!topicData.pinned) {}
             }
             topicTasks.push(topics.updateTeaser(tid));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] UnaryOperator
src/posts/delete.js:127:75
                 const newPostCount = topicData.postcount - posts.length;
                 topicPostCountTasks.push(['topics:posts', newPostCount, tid]);
                 if (!topicData.pinned) {
-                    zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
+                    zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, +posts.length, tid]);
                 }
             }
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] ArrowFunction
src/posts/delete.js:132:49
             }
             topicTasks.push(topics.updateTeaser(tid));
             topicTasks.push(topics.updateLastPostTimeFromLastPid(tid));
-            const postsByUid = _.groupBy(posts, p => parseInt(p.uid, 10));
+            const postsByUid = _.groupBy(posts, () => undefined);
             for (const [uid, uidPosts] of Object.entries(postsByUid)) {
                 zsetIncrBulk.push([`tid:${tid}:posters`, -uidPosts.length, uid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:133:71
             topicTasks.push(topics.updateTeaser(tid));
             topicTasks.push(topics.updateLastPostTimeFromLastPid(tid));
             const postsByUid = _.groupBy(posts, p => parseInt(p.uid, 10));
-            for (const [uid, uidPosts] of Object.entries(postsByUid)) {
-                zsetIncrBulk.push([`tid:${tid}:posters`, -uidPosts.length, uid]);
-            }
+            for (const [uid, uidPosts] of Object.entries(postsByUid)) {}
             topicTasks.push(db.sortedSetIncrByBulk(zsetIncrBulk));
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] UnaryOperator
src/posts/delete.js:134:58
             topicTasks.push(topics.updateLastPostTimeFromLastPid(tid));
             const postsByUid = _.groupBy(posts, p => parseInt(p.uid, 10));
             for (const [uid, uidPosts] of Object.entries(postsByUid)) {
-                zsetIncrBulk.push([`tid:${tid}:posters`, -uidPosts.length, uid]);
+                zsetIncrBulk.push([`tid:${tid}:posters`, +uidPosts.length, uid]);
             }
             topicTasks.push(db.sortedSetIncrByBulk(zsetIncrBulk));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:134:35
             topicTasks.push(topics.updateLastPostTimeFromLastPid(tid));
             const postsByUid = _.groupBy(posts, p => parseInt(p.uid, 10));
             for (const [uid, uidPosts] of Object.entries(postsByUid)) {
-                zsetIncrBulk.push([`tid:${tid}:posters`, -uidPosts.length, uid]);
+                zsetIncrBulk.push([]);
             }
             topicTasks.push(db.sortedSetIncrByBulk(zsetIncrBulk));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:139:27
             topicTasks.push(db.sortedSetIncrByBulk(zsetIncrBulk));
         }
 
-        await Promise.all([
-            db.incrObjectFieldByBulk(incrObjectBulk),
-            db.sortedSetAddBulk(topicPostCountTasks),
-            ...topicTasks,
-            user.updatePostCount(_.uniq(postData.map(p => p.uid))),
-            notifications.rescind(...postData.map(p => `new_post:tid:${p.tid}:pid:${p.pid}:uid:${p.uid}`)),
-        ]);
+        await Promise.all([]);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:143:54
             db.incrObjectFieldByBulk(incrObjectBulk),
             db.sortedSetAddBulk(topicPostCountTasks),
             ...topicTasks,
-            user.updatePostCount(_.uniq(postData.map(p => p.uid))),
+            user.updatePostCount(_.uniq(postData.map(() => undefined))),
             notifications.rescind(...postData.map(p => `new_post:tid:${p.tid}:pid:${p.pid}:uid:${p.uid}`)),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:144:51
             db.sortedSetAddBulk(topicPostCountTasks),
             ...topicTasks,
             user.updatePostCount(_.uniq(postData.map(p => p.uid))),
-            notifications.rescind(...postData.map(p => `new_post:tid:${p.tid}:pid:${p.pid}:uid:${p.uid}`)),
+            notifications.rescind(...postData.map(() => undefined)),
         ]);
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:148:60
         ]);
     }
 
-    async function deleteFromCategoryRecentPosts(postData) {
-        const uniqCids = _.uniq(postData.map(p => p.cid));
-        const sets = uniqCids.map(cid => `cid:${cid}:pids`);
-        await db.sortedSetRemove(sets, postData.map(p => p.pid));
-        await Promise.all(uniqCids.map(categories.updateRecentTidForCid));
-    }
+    async function deleteFromCategoryRecentPosts(postData) {}
 
     // TODO: add deleteEndorsed
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] ArrowFunction
src/posts/delete.js:149:46
     }
 
     async function deleteFromCategoryRecentPosts(postData) {
-        const uniqCids = _.uniq(postData.map(p => p.cid));
+        const uniqCids = _.uniq(postData.map(() => undefined));
         const sets = uniqCids.map(cid => `cid:${cid}:pids`);
         await db.sortedSetRemove(sets, postData.map(p => p.pid));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:150:35
 
     async function deleteFromCategoryRecentPosts(postData) {
         const uniqCids = _.uniq(postData.map(p => p.cid));
-        const sets = uniqCids.map(cid => `cid:${cid}:pids`);
+        const sets = uniqCids.map(() => undefined);
         await db.sortedSetRemove(sets, postData.map(p => p.pid));
         await Promise.all(uniqCids.map(categories.updateRecentTidForCid));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:151:53
     async function deleteFromCategoryRecentPosts(postData) {
         const uniqCids = _.uniq(postData.map(p => p.cid));
         const sets = uniqCids.map(cid => `cid:${cid}:pids`);
-        await db.sortedSetRemove(sets, postData.map(p => p.pid));
+        await db.sortedSetRemove(sets, postData.map(() => undefined));
         await Promise.all(uniqCids.map(categories.updateRecentTidForCid));
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:156:41
     }
 
     // TODO: add deleteEndorsed
-    async function deleteEndorsed(pids) {
-        await Promise.all([
-            // db.sortedSetRemoveBulk(bulkRemove),
-            db.deleteAll([
-                ...pids.map(pid => `pid:${pid}:users_endorsed`),
-                // ...pids.map(pid => `pid:${pid}:downvote`),
-            ]),
-        ]);
-    }
+    async function deleteEndorsed(pids) {}
 
     async function deleteFromUsersBookmarks(pids) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:160:29
         await Promise.all([
             // db.sortedSetRemoveBulk(bulkRemove),
             db.deleteAll([
-                ...pids.map(pid => `pid:${pid}:users_endorsed`),
+                ...pids.map(() => undefined),
                 // ...pids.map(pid => `pid:${pid}:downvote`),
             ]),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:160:36
         await Promise.all([
             // db.sortedSetRemoveBulk(bulkRemove),
             db.deleteAll([
-                ...pids.map(pid => `pid:${pid}:users_endorsed`),
+                ...pids.map(pid => ``),
                 // ...pids.map(pid => `pid:${pid}:downvote`),
             ]),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:166:51
         ]);
     }
 
-    async function deleteFromUsersBookmarks(pids) {
-        const arrayOfUids = await db.getSetsMembers(pids.map(pid => `pid:${pid}:users_bookmarked`));
-        const bulkRemove = [];
-        pids.forEach((pid, index) => {
-            arrayOfUids[index].forEach((uid) => {
-                bulkRemove.push([`uid:${uid}:bookmarks`, pid]);
-            });
-        });
-        await db.sortedSetRemoveBulk(bulkRemove);
-        await db.deleteAll(pids.map(pid => `pid:${pid}:users_bookmarked`));
-    }
+    async function deleteFromUsersBookmarks(pids) {}
 
     async function deleteFromUsersVotes(pids) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:167:62
     }
 
     async function deleteFromUsersBookmarks(pids) {
-        const arrayOfUids = await db.getSetsMembers(pids.map(pid => `pid:${pid}:users_bookmarked`));
+        const arrayOfUids = await db.getSetsMembers(pids.map(() => undefined));
         const bulkRemove = [];
         pids.forEach((pid, index) => {
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-user]]

[Killed] StringLiteral
src/posts/delete.js:167:69
     }
 
     async function deleteFromUsersBookmarks(pids) {
-        const arrayOfUids = await db.getSetsMembers(pids.map(pid => `pid:${pid}:users_bookmarked`));
+        const arrayOfUids = await db.getSetsMembers(pids.map(pid => ``));
         const bulkRemove = [];
         pids.forEach((pid, index) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:169:38
     async function deleteFromUsersBookmarks(pids) {
         const arrayOfUids = await db.getSetsMembers(pids.map(pid => `pid:${pid}:users_bookmarked`));
         const bulkRemove = [];
-        pids.forEach((pid, index) => {
-            arrayOfUids[index].forEach((uid) => {
-                bulkRemove.push([`uid:${uid}:bookmarks`, pid]);
-            });
-        });
+        pids.forEach((pid, index) => {});
         await db.sortedSetRemoveBulk(bulkRemove);
         await db.deleteAll(pids.map(pid => `pid:${pid}:users_bookmarked`));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:170:49
         const arrayOfUids = await db.getSetsMembers(pids.map(pid => `pid:${pid}:users_bookmarked`));
         const bulkRemove = [];
         pids.forEach((pid, index) => {
-            arrayOfUids[index].forEach((uid) => {
-                bulkRemove.push([`uid:${uid}:bookmarks`, pid]);
-            });
+            arrayOfUids[index].forEach((uid) => {});
         });
         await db.sortedSetRemoveBulk(bulkRemove);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:171:33
         const bulkRemove = [];
         pids.forEach((pid, index) => {
             arrayOfUids[index].forEach((uid) => {
-                bulkRemove.push([`uid:${uid}:bookmarks`, pid]);
+                bulkRemove.push([]);
             });
         });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:175:37
             });
         });
         await db.sortedSetRemoveBulk(bulkRemove);
-        await db.deleteAll(pids.map(pid => `pid:${pid}:users_bookmarked`));
+        await db.deleteAll(pids.map(() => undefined));
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:178:47
         await db.deleteAll(pids.map(pid => `pid:${pid}:users_bookmarked`));
     }
 
-    async function deleteFromUsersVotes(pids) {
-        const [upvoters, downvoters] = await Promise.all([
-            db.getSetsMembers(pids.map(pid => `pid:${pid}:upvote`)),
-            db.getSetsMembers(pids.map(pid => `pid:${pid}:downvote`)),
-        ]);
-        const bulkRemove = [];
-        pids.forEach((pid, index) => {
-            upvoters[index].forEach((upvoterUid) => {
-                bulkRemove.push([`uid:${upvoterUid}:upvote`, pid]);
-            });
-            downvoters[index].forEach((downvoterUid) => {
-                bulkRemove.push([`uid:${downvoterUid}:downvote`, pid]);
-            });
-        });
-
-        await Promise.all([
-            db.sortedSetRemoveBulk(bulkRemove),
-            db.deleteAll([
-                ...pids.map(pid => `pid:${pid}:upvote`),
-                ...pids.map(pid => `pid:${pid}:downvote`),
-            ]),
-        ]);
-    }
+    async function deleteFromUsersVotes(pids) {}
 
     async function deleteFromReplies(postData) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:179:58
     }
 
     async function deleteFromUsersVotes(pids) {
-        const [upvoters, downvoters] = await Promise.all([
-            db.getSetsMembers(pids.map(pid => `pid:${pid}:upvote`)),
-            db.getSetsMembers(pids.map(pid => `pid:${pid}:downvote`)),
-        ]);
+        const [upvoters, downvoters] = await Promise.all([]);
         const bulkRemove = [];
         pids.forEach((pid, index) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:180:40
 
     async function deleteFromUsersVotes(pids) {
         const [upvoters, downvoters] = await Promise.all([
-            db.getSetsMembers(pids.map(pid => `pid:${pid}:upvote`)),
+            db.getSetsMembers(pids.map(() => undefined)),
             db.getSetsMembers(pids.map(pid => `pid:${pid}:downvote`)),
         ]);
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-user]]

[Killed] StringLiteral
src/posts/delete.js:180:47
 
     async function deleteFromUsersVotes(pids) {
         const [upvoters, downvoters] = await Promise.all([
-            db.getSetsMembers(pids.map(pid => `pid:${pid}:upvote`)),
+            db.getSetsMembers(pids.map(pid => ``)),
             db.getSetsMembers(pids.map(pid => `pid:${pid}:downvote`)),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:181:40
     async function deleteFromUsersVotes(pids) {
         const [upvoters, downvoters] = await Promise.all([
             db.getSetsMembers(pids.map(pid => `pid:${pid}:upvote`)),
-            db.getSetsMembers(pids.map(pid => `pid:${pid}:downvote`)),
+            db.getSetsMembers(pids.map(() => undefined)),
         ]);
         const bulkRemove = [];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:184:38
             db.getSetsMembers(pids.map(pid => `pid:${pid}:downvote`)),
         ]);
         const bulkRemove = [];
-        pids.forEach((pid, index) => {
-            upvoters[index].forEach((upvoterUid) => {
-                bulkRemove.push([`uid:${upvoterUid}:upvote`, pid]);
-            });
-            downvoters[index].forEach((downvoterUid) => {
-                bulkRemove.push([`uid:${downvoterUid}:downvote`, pid]);
-            });
-        });
+        pids.forEach((pid, index) => {});
 
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:185:53
         ]);
         const bulkRemove = [];
         pids.forEach((pid, index) => {
-            upvoters[index].forEach((upvoterUid) => {
-                bulkRemove.push([`uid:${upvoterUid}:upvote`, pid]);
-            });
+            upvoters[index].forEach((upvoterUid) => {});
             downvoters[index].forEach((downvoterUid) => {
                 bulkRemove.push([`uid:${downvoterUid}:downvote`, pid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:186:34
         const bulkRemove = [];
         pids.forEach((pid, index) => {
             upvoters[index].forEach((upvoterUid) => {
-                bulkRemove.push([`uid:${upvoterUid}:upvote`, pid]);
+                bulkRemove.push([``, pid]);
             });
             downvoters[index].forEach((downvoterUid) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:186:33
         const bulkRemove = [];
         pids.forEach((pid, index) => {
             upvoters[index].forEach((upvoterUid) => {
-                bulkRemove.push([`uid:${upvoterUid}:upvote`, pid]);
+                bulkRemove.push([]);
             });
             downvoters[index].forEach((downvoterUid) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:188:57
             upvoters[index].forEach((upvoterUid) => {
                 bulkRemove.push([`uid:${upvoterUid}:upvote`, pid]);
             });
-            downvoters[index].forEach((downvoterUid) => {
-                bulkRemove.push([`uid:${downvoterUid}:downvote`, pid]);
-            });
+            downvoters[index].forEach((downvoterUid) => {});
         });
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:189:34
                 bulkRemove.push([`uid:${upvoterUid}:upvote`, pid]);
             });
             downvoters[index].forEach((downvoterUid) => {
-                bulkRemove.push([`uid:${downvoterUid}:downvote`, pid]);
+                bulkRemove.push([``, pid]);
             });
         });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:193:27
             });
         });
 
-        await Promise.all([
-            db.sortedSetRemoveBulk(bulkRemove),
-            db.deleteAll([
-                ...pids.map(pid => `pid:${pid}:upvote`),
-                ...pids.map(pid => `pid:${pid}:downvote`),
-            ]),
-        ]);
+        await Promise.all([]);
     }
 
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-user]]

[Killed] ArrayDeclaration
src/posts/delete.js:195:26
 
         await Promise.all([
             db.sortedSetRemoveBulk(bulkRemove),
-            db.deleteAll([
-                ...pids.map(pid => `pid:${pid}:upvote`),
-                ...pids.map(pid => `pid:${pid}:downvote`),
-            ]),
+            db.deleteAll([]),
         ]);
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:196:29
         await Promise.all([
             db.sortedSetRemoveBulk(bulkRemove),
             db.deleteAll([
-                ...pids.map(pid => `pid:${pid}:upvote`),
+                ...pids.map(() => undefined),
                 ...pids.map(pid => `pid:${pid}:downvote`),
             ]),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:197:29
             db.sortedSetRemoveBulk(bulkRemove),
             db.deleteAll([
                 ...pids.map(pid => `pid:${pid}:upvote`),
-                ...pids.map(pid => `pid:${pid}:downvote`),
+                ...pids.map(() => undefined),
             ]),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:202:48
         ]);
     }
 
-    async function deleteFromReplies(postData) {
-        const arrayOfReplyPids = await db.getSortedSetsMembers(postData.map(p => `pid:${p.pid}:replies`));
-        const allReplyPids = _.flatten(arrayOfReplyPids);
-        const promises = [
-            db.deleteObjectFields(
-                allReplyPids.map(pid => `post:${pid}`), ['toPid']
-            ),
-            db.deleteAll(postData.map(p => `pid:${p.pid}:replies`)),
-        ];
-
-        const postsWithParents = postData.filter(p => parseInt(p.toPid, 10));
-        const bulkRemove = postsWithParents.map(p => [`pid:${p.toPid}:replies`, p.pid]);
-        promises.push(db.sortedSetRemoveBulk(bulkRemove));
-        await Promise.all(promises);
-
-        const parentPids = _.uniq(postsWithParents.map(p => p.toPid));
-        const counts = await db.sortedSetsCard(parentPids.map(pid => `pid:${pid}:replies`));
-        await db.setObjectBulk(parentPids.map((pid, index) => [`post:${pid}`, { replies: counts[index] }]));
-    }
+    async function deleteFromReplies(postData) {}
 
     async function deleteFromGroups(pids) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:203:77
     }
 
     async function deleteFromReplies(postData) {
-        const arrayOfReplyPids = await db.getSortedSetsMembers(postData.map(p => `pid:${p.pid}:replies`));
+        const arrayOfReplyPids = await db.getSortedSetsMembers(postData.map(() => undefined));
         const allReplyPids = _.flatten(arrayOfReplyPids);
         const promises = [
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:207:34
         const allReplyPids = _.flatten(arrayOfReplyPids);
         const promises = [
             db.deleteObjectFields(
-                allReplyPids.map(pid => `post:${pid}`), ['toPid']
+                allReplyPids.map(() => undefined), ['toPid']
             ),
             db.deleteAll(postData.map(p => `pid:${p.pid}:replies`)),
killedBy: POST /ping: response status code should match one of the schema defined responses
statusReason: POST /ping sent back unexpected HTTP status code: 401 {"status":{"code":"not-authorised","message":"A valid login session was not found. Please log in and try again."},"response":{}}

[Killed] StringLiteral
src/posts/delete.js:207:58
         const allReplyPids = _.flatten(arrayOfReplyPids);
         const promises = [
             db.deleteObjectFields(
-                allReplyPids.map(pid => `post:${pid}`), ['toPid']
+                allReplyPids.map(pid => `post:${pid}`), [""]
             ),
             db.deleteAll(postData.map(p => `pid:${p.pid}:replies`)),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:209:39
             db.deleteObjectFields(
                 allReplyPids.map(pid => `post:${pid}`), ['toPid']
             ),
-            db.deleteAll(postData.map(p => `pid:${p.pid}:replies`)),
+            db.deleteAll(postData.map(() => undefined)),
         ];
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:209:44
             db.deleteObjectFields(
                 allReplyPids.map(pid => `post:${pid}`), ['toPid']
             ),
-            db.deleteAll(postData.map(p => `pid:${p.pid}:replies`)),
+            db.deleteAll(postData.map(p => ``)),
         ];
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/delete.js:212:34
             db.deleteAll(postData.map(p => `pid:${p.pid}:replies`)),
         ];
 
-        const postsWithParents = postData.filter(p => parseInt(p.toPid, 10));
+        const postsWithParents = postData;
         const bulkRemove = postsWithParents.map(p => [`pid:${p.toPid}:replies`, p.pid]);
         promises.push(db.sortedSetRemoveBulk(bulkRemove));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:212:50
             db.deleteAll(postData.map(p => `pid:${p.pid}:replies`)),
         ];
 
-        const postsWithParents = postData.filter(p => parseInt(p.toPid, 10));
+        const postsWithParents = postData.filter(() => undefined);
         const bulkRemove = postsWithParents.map(p => [`pid:${p.toPid}:replies`, p.pid]);
         promises.push(db.sortedSetRemoveBulk(bulkRemove));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:213:49
         ];
 
         const postsWithParents = postData.filter(p => parseInt(p.toPid, 10));
-        const bulkRemove = postsWithParents.map(p => [`pid:${p.toPid}:replies`, p.pid]);
+        const bulkRemove = postsWithParents.map(() => undefined);
         promises.push(db.sortedSetRemoveBulk(bulkRemove));
         await Promise.all(promises);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:217:56
         promises.push(db.sortedSetRemoveBulk(bulkRemove));
         await Promise.all(promises);
 
-        const parentPids = _.uniq(postsWithParents.map(p => p.toPid));
+        const parentPids = _.uniq(postsWithParents.map(() => undefined));
         const counts = await db.sortedSetsCard(parentPids.map(pid => `pid:${pid}:replies`));
         await db.setObjectBulk(parentPids.map((pid, index) => [`post:${pid}`, { replies: counts[index] }]));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:218:63
         await Promise.all(promises);
 
         const parentPids = _.uniq(postsWithParents.map(p => p.toPid));
-        const counts = await db.sortedSetsCard(parentPids.map(pid => `pid:${pid}:replies`));
+        const counts = await db.sortedSetsCard(parentPids.map(() => undefined));
         await db.setObjectBulk(parentPids.map((pid, index) => [`post:${pid}`, { replies: counts[index] }]));
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:219:47
 
         const parentPids = _.uniq(postsWithParents.map(p => p.toPid));
         const counts = await db.sortedSetsCard(parentPids.map(pid => `pid:${pid}:replies`));
-        await db.setObjectBulk(parentPids.map((pid, index) => [`post:${pid}`, { replies: counts[index] }]));
+        await db.setObjectBulk(parentPids.map(() => undefined));
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:219:63
 
         const parentPids = _.uniq(postsWithParents.map(p => p.toPid));
         const counts = await db.sortedSetsCard(parentPids.map(pid => `pid:${pid}:replies`));
-        await db.setObjectBulk(parentPids.map((pid, index) => [`post:${pid}`, { replies: counts[index] }]));
+        await db.setObjectBulk(parentPids.map((pid, index) => []));
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
