[Killed] BlockStatement
src/posts/delete.js:222:43
         await db.setObjectBulk(parentPids.map((pid, index) => [`post:${pid}`, { replies: counts[index] }]));
     }
 
-    async function deleteFromGroups(pids) {
-        const groupNames = await db.getSortedSetMembers('groups:visible:createtime');
-        const keys = groupNames.map(groupName => `group:${groupName}:member:pids`);
-        await db.sortedSetRemove(keys, pids);
-    }
+    async function deleteFromGroups(pids) {}
 
     async function deleteDiffs(pids) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/delete.js:223:57
     }
 
     async function deleteFromGroups(pids) {
-        const groupNames = await db.getSortedSetMembers('groups:visible:createtime');
+        const groupNames = await db.getSortedSetMembers("");
         const keys = groupNames.map(groupName => `group:${groupName}:member:pids`);
         await db.sortedSetRemove(keys, pids);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:224:37
 
     async function deleteFromGroups(pids) {
         const groupNames = await db.getSortedSetMembers('groups:visible:createtime');
-        const keys = groupNames.map(groupName => `group:${groupName}:member:pids`);
+        const keys = groupNames.map(() => undefined);
         await db.sortedSetRemove(keys, pids);
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:228:38
         await db.sortedSetRemove(keys, pids);
     }
 
-    async function deleteDiffs(pids) {
-        const timestamps = await Promise.all(pids.map(pid => Posts.diffs.list(pid)));
-        await db.deleteAll([
-            ...pids.map(pid => `post:${pid}:diffs`),
-            ..._.flattenDeep(pids.map((pid, index) => timestamps[index].map(t => `diff:${pid}.${t}`))),
-        ]);
-    }
+    async function deleteDiffs(pids) {}
 
     async function deleteFromUploads(pids) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:229:55
     }
 
     async function deleteDiffs(pids) {
-        const timestamps = await Promise.all(pids.map(pid => Posts.diffs.list(pid)));
+        const timestamps = await Promise.all(pids.map(() => undefined));
         await db.deleteAll([
             ...pids.map(pid => `post:${pid}:diffs`),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/delete.js:230:28
 
     async function deleteDiffs(pids) {
         const timestamps = await Promise.all(pids.map(pid => Posts.diffs.list(pid)));
-        await db.deleteAll([
-            ...pids.map(pid => `post:${pid}:diffs`),
-            ..._.flattenDeep(pids.map((pid, index) => timestamps[index].map(t => `diff:${pid}.${t}`))),
-        ]);
+        await db.deleteAll([]);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:231:25
     async function deleteDiffs(pids) {
         const timestamps = await Promise.all(pids.map(pid => Posts.diffs.list(pid)));
         await db.deleteAll([
-            ...pids.map(pid => `post:${pid}:diffs`),
+            ...pids.map(() => undefined),
             ..._.flattenDeep(pids.map((pid, index) => timestamps[index].map(t => `diff:${pid}.${t}`))),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:232:39
         const timestamps = await Promise.all(pids.map(pid => Posts.diffs.list(pid)));
         await db.deleteAll([
             ...pids.map(pid => `post:${pid}:diffs`),
-            ..._.flattenDeep(pids.map((pid, index) => timestamps[index].map(t => `diff:${pid}.${t}`))),
+            ..._.flattenDeep(pids.map(() => undefined)),
         ]);
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:232:77
         const timestamps = await Promise.all(pids.map(pid => Posts.diffs.list(pid)));
         await db.deleteAll([
             ...pids.map(pid => `post:${pid}:diffs`),
-            ..._.flattenDeep(pids.map((pid, index) => timestamps[index].map(t => `diff:${pid}.${t}`))),
+            ..._.flattenDeep(pids.map((pid, index) => timestamps[index].map(() => undefined))),
         ]);
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:236:44
         ]);
     }
 
-    async function deleteFromUploads(pids) {
-        await Promise.all(pids.map(Posts.uploads.dissociateAll));
-    }
+    async function deleteFromUploads(pids) {}
 
     async function resolveFlags(postData, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/delete.js:240:48
         await Promise.all(pids.map(Posts.uploads.dissociateAll));
     }
 
-    async function resolveFlags(postData, uid) {
-        const flaggedPosts = postData.filter(p => parseInt(p.flagId, 10));
-        await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, { state: 'resolved' })));
-    }
+    async function resolveFlags(postData, uid) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/delete.js:241:30
     }
 
     async function resolveFlags(postData, uid) {
-        const flaggedPosts = postData.filter(p => parseInt(p.flagId, 10));
+        const flaggedPosts = postData;
         await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, { state: 'resolved' })));
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:241:46
     }
 
     async function resolveFlags(postData, uid) {
-        const flaggedPosts = postData.filter(p => parseInt(p.flagId, 10));
+        const flaggedPosts = postData.filter(() => undefined);
         await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, { state: 'resolved' })));
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/delete.js:242:44
 
     async function resolveFlags(postData, uid) {
         const flaggedPosts = postData.filter(p => parseInt(p.flagId, 10));
-        await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, { state: 'resolved' })));
+        await Promise.all(flaggedPosts.map(() => undefined));
     }
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
