[Killed] BlockStatement
src/posts/tools.js:8:52
 module.exports = function (Posts) {
     Posts.tools = {};
 
-    Posts.tools.delete = async function (uid, pid) {
-        return await togglePostDelete(uid, pid, true);
-    };
+    Posts.tools.delete = async function (uid, pid) {};
 
     Posts.tools.restore = async function (uid, pid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/tools.js:9:49
     Posts.tools = {};
 
     Posts.tools.delete = async function (uid, pid) {
-        return await togglePostDelete(uid, pid, true);
+        return await togglePostDelete(uid, pid, false);
     };
 
killedBy: POST /ping: response status code should match one of the schema defined responses
statusReason: POST /ping sent back unexpected HTTP status code: 401 {"status":{"code":"not-authorised","message":"A valid login session was not found. Please log in and try again."},"response":{}}

[Killed] BlockStatement
src/posts/tools.js:12:53
         return await togglePostDelete(uid, pid, true);
     };
 
-    Posts.tools.restore = async function (uid, pid) {
-        return await togglePostDelete(uid, pid, false);
-    };
+    Posts.tools.restore = async function (uid, pid) {};
 
     async function togglePostDelete(uid, pid, isDelete) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/tools.js:13:49
     };
 
     Posts.tools.restore = async function (uid, pid) {
-        return await togglePostDelete(uid, pid, false);
+        return await togglePostDelete(uid, pid, true);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/tools.js:21:24
             Posts.getPostData(pid),
             privileges.posts.canDelete(pid, uid),
         ]);
-        if (!postData) {
-            throw new Error('[[error:no-post]]');
-        }
+        if (!postData) {}
 
         if (postData.deleted && isDelete) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/tools.js:21:13
             Posts.getPostData(pid),
             privileges.posts.canDelete(pid, uid),
         ]);
-        if (!postData) {
+        if (postData) {
             throw new Error('[[error:no-post]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/tools.js:22:29
             privileges.posts.canDelete(pid, uid),
         ]);
         if (!postData) {
-            throw new Error('[[error:no-post]]');
+            throw new Error("");
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/tools.js:25:13
             throw new Error('[[error:no-post]]');
         }
 
-        if (postData.deleted && isDelete) {
+        if (postData.deleted || isDelete) {
             throw new Error('[[error:post-already-deleted]]');
         } else if (!postData.deleted && !isDelete) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/tools.js:25:43
             throw new Error('[[error:no-post]]');
         }
 
-        if (postData.deleted && isDelete) {
-            throw new Error('[[error:post-already-deleted]]');
-        } else if (!postData.deleted && !isDelete) {
+        if (postData.deleted && isDelete) {} else if (!postData.deleted && !isDelete) {
             throw new Error('[[error:post-already-restored]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/tools.js:26:29
         }
 
         if (postData.deleted && isDelete) {
-            throw new Error('[[error:post-already-deleted]]');
+            throw new Error("");
         } else if (!postData.deleted && !isDelete) {
             throw new Error('[[error:post-already-restored]]');
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/tools.js:27:52
 
         if (postData.deleted && isDelete) {
             throw new Error('[[error:post-already-deleted]]');
-        } else if (!postData.deleted && !isDelete) {
-            throw new Error('[[error:post-already-restored]]');
-        }
+        } else if (!postData.deleted && !isDelete) {}
 
         if (!canDelete.flag) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/tools.js:27:41
 
         if (postData.deleted && isDelete) {
             throw new Error('[[error:post-already-deleted]]');
-        } else if (!postData.deleted && !isDelete) {
+        } else if (!postData.deleted && isDelete) {
             throw new Error('[[error:post-already-restored]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/tools.js:28:29
         if (postData.deleted && isDelete) {
             throw new Error('[[error:post-already-deleted]]');
         } else if (!postData.deleted && !isDelete) {
-            throw new Error('[[error:post-already-restored]]');
+            throw new Error("");
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/tools.js:31:13
             throw new Error('[[error:post-already-restored]]');
         }
 
-        if (!canDelete.flag) {
+        if (true) {
             throw new Error(canDelete.message);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/tools.js:31:13
             throw new Error('[[error:post-already-restored]]');
         }
 
-        if (!canDelete.flag) {
+        if (false) {
             throw new Error(canDelete.message);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/tools.js:35:23
             throw new Error(canDelete.message);
         }
         let post;
-        if (isDelete) {
-            require('./cache').del(pid);
-            post = await Posts.delete(pid, uid);
-        } else {
+        if (isDelete) {} else {
             post = await Posts.restore(pid, uid);
             post = await Posts.parsePost(post);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/tools.js:35:13
             throw new Error(canDelete.message);
         }
         let post;
-        if (isDelete) {
+        if (false) {
             require('./cache').del(pid);
             post = await Posts.delete(pid, uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/tools.js:38:16
         if (isDelete) {
             require('./cache').del(pid);
             post = await Posts.delete(pid, uid);
-        } else {
-            post = await Posts.restore(pid, uid);
-            post = await Posts.parsePost(post);
-        }
+        } else {}
         return post;
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
