[Killed] BlockStatement
src/posts/diffs.js:15:41
 module.exports = function (Posts) {
     const Diffs = {};
     Posts.diffs = Diffs;
-    Diffs.exists = async function (pid) {
-        if (meta.config.enablePostHistory !== 1) {
-            return false;
-        }
-
-        const numDiffs = await db.listLength(`post:${pid}:diffs`);
-        return !!numDiffs;
-    };
+    Diffs.exists = async function (pid) {};
 
     Diffs.get = async function (pid, since) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/diffs.js:16:13
     const Diffs = {};
     Posts.diffs = Diffs;
     Diffs.exists = async function (pid) {
-        if (meta.config.enablePostHistory !== 1) {
+        if (meta.config.enablePostHistory === 1) {
             return false;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:16:13
     const Diffs = {};
     Posts.diffs = Diffs;
     Diffs.exists = async function (pid) {
-        if (meta.config.enablePostHistory !== 1) {
+        if (true) {
             return false;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/diffs.js:17:20
     Posts.diffs = Diffs;
     Diffs.exists = async function (pid) {
         if (meta.config.enablePostHistory !== 1) {
-            return false;
+            return true;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/diffs.js:21:16
         }
 
         const numDiffs = await db.listLength(`post:${pid}:diffs`);
-        return !!numDiffs;
+        return !numDiffs;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/diffs.js:24:45
         return !!numDiffs;
     };
 
-    Diffs.get = async function (pid, since) {
-        const timestamps = await Diffs.list(pid);
-        if (!since) {
-            since = 0;
-        }
-
-        // Pass those made after `since`, and create keys
-        const keys = timestamps.filter(t => (parseInt(t, 10) || 0) > since)
-            .map(t => `diff:${pid}.${t}`);
-        return await db.getObjects(keys);
-    };
+    Diffs.get = async function (pid, since) {};
 
     Diffs.list = async function (pid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:26:13
 
     Diffs.get = async function (pid, since) {
         const timestamps = await Diffs.list(pid);
-        if (!since) {
+        if (true) {
             since = 0;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/diffs.js:26:21
 
     Diffs.get = async function (pid, since) {
         const timestamps = await Diffs.list(pid);
-        if (!since) {
-            since = 0;
-        }
+        if (!since) {}
 
         // Pass those made after `since`, and create keys
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:31:45
         }
 
         // Pass those made after `since`, and create keys
-        const keys = timestamps.filter(t => (parseInt(t, 10) || 0) > since)
+        const keys = timestamps.filter(t => true)
             .map(t => `diff:${pid}.${t}`);
         return await db.getObjects(keys);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/diffs.js:31:46
         }
 
         // Pass those made after `since`, and create keys
-        const keys = timestamps.filter(t => (parseInt(t, 10) || 0) > since)
+        const keys = timestamps.filter(t => (parseInt(t, 10) && 0) > since)
             .map(t => `diff:${pid}.${t}`);
         return await db.getObjects(keys);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/diffs.js:32:18
 
         // Pass those made after `since`, and create keys
         const keys = timestamps.filter(t => (parseInt(t, 10) || 0) > since)
-            .map(t => `diff:${pid}.${t}`);
+            .map(() => undefined);
         return await db.getObjects(keys);
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/diffs.js:32:23
 
         // Pass those made after `since`, and create keys
         const keys = timestamps.filter(t => (parseInt(t, 10) || 0) > since)
-            .map(t => `diff:${pid}.${t}`);
+            .map(t => ``);
         return await db.getObjects(keys);
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/diffs.js:36:39
         return await db.getObjects(keys);
     };
 
-    Diffs.list = async function (pid) {
-        return await db.getListRange(`post:${pid}:diffs`, 0, -1);
-    };
+    Diffs.list = async function (pid) {};
 
     Diffs.save = async function (data) {
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] UnaryOperator
src/posts/diffs.js:37:62
     };
 
     Diffs.list = async function (pid) {
-        return await db.getListRange(`post:${pid}:diffs`, 0, -1);
+        return await db.getListRange(`post:${pid}:diffs`, 0, +1);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/diffs.js:40:40
         return await db.getListRange(`post:${pid}:diffs`, 0, -1);
     };
 
-    Diffs.save = async function (data) {
-        const { pid, uid, oldContent, newContent, edited, topic } = data;
-        const editTimestamp = edited || Date.now();
-        const diffData = {
-            uid: uid,
-            pid: pid,
-        };
-        if (oldContent !== newContent) {
-            diffData.patch = diff.createPatch('', newContent, oldContent);
-        }
-        if (topic.renamed) {
-            diffData.title = topic.oldTitle;
-        }
-        if (topic.tagsupdated && Array.isArray(topic.oldTags)) {
-            diffData.tags = topic.oldTags.map(tag => tag && tag.value).filter(Boolean).join(',');
-        }
-        await Promise.all([
-            db.listPrepend(`post:${pid}:diffs`, editTimestamp),
-            db.setObject(`diff:${pid}.${editTimestamp}`, diffData),
-        ]);
-    };
+    Diffs.save = async function (data) {};
 
     Diffs.load = async function (pid, since, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/diffs.js:42:31
 
     Diffs.save = async function (data) {
         const { pid, uid, oldContent, newContent, edited, topic } = data;
-        const editTimestamp = edited || Date.now();
+        const editTimestamp = edited && Date.now();
         const diffData = {
             uid: uid,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:42:31
 
     Diffs.save = async function (data) {
         const { pid, uid, oldContent, newContent, edited, topic } = data;
-        const editTimestamp = edited || Date.now();
+        const editTimestamp = false;
         const diffData = {
             uid: uid,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:47:13
             uid: uid,
             pid: pid,
         };
-        if (oldContent !== newContent) {
+        if (false) {
             diffData.patch = diff.createPatch('', newContent, oldContent);
         }
killedBy: POST /ping: response status code should match one of the schema defined responses
statusReason: POST /ping sent back unexpected HTTP status code: 401 {"status":{"code":"not-authorised","message":"A valid login session was not found. Please log in and try again."},"response":{}}

[Killed] BlockStatement
src/posts/diffs.js:47:40
             uid: uid,
             pid: pid,
         };
-        if (oldContent !== newContent) {
-            diffData.patch = diff.createPatch('', newContent, oldContent);
-        }
+        if (oldContent !== newContent) {}
         if (topic.renamed) {
             diffData.title = topic.oldTitle;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:50:13
         if (oldContent !== newContent) {
             diffData.patch = diff.createPatch('', newContent, oldContent);
         }
-        if (topic.renamed) {
+        if (false) {
             diffData.title = topic.oldTitle;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/diffs.js:50:28
         if (oldContent !== newContent) {
             diffData.patch = diff.createPatch('', newContent, oldContent);
         }
-        if (topic.renamed) {
-            diffData.title = topic.oldTitle;
-        }
+        if (topic.renamed) {}
         if (topic.tagsupdated && Array.isArray(topic.oldTags)) {
             diffData.tags = topic.oldTags.map(tag => tag && tag.value).filter(Boolean).join(',');
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/diffs.js:53:13
         if (topic.renamed) {
             diffData.title = topic.oldTitle;
         }
-        if (topic.tagsupdated && Array.isArray(topic.oldTags)) {
+        if (topic.tagsupdated || Array.isArray(topic.oldTags)) {
             diffData.tags = topic.oldTags.map(tag => tag && tag.value).filter(Boolean).join(',');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:53:13
         if (topic.renamed) {
             diffData.title = topic.oldTitle;
         }
-        if (topic.tagsupdated && Array.isArray(topic.oldTags)) {
+        if (false) {
             diffData.tags = topic.oldTags.map(tag => tag && tag.value).filter(Boolean).join(',');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/diffs.js:54:47
             diffData.title = topic.oldTitle;
         }
         if (topic.tagsupdated && Array.isArray(topic.oldTags)) {
-            diffData.tags = topic.oldTags.map(tag => tag && tag.value).filter(Boolean).join(',');
+            diffData.tags = topic.oldTags.map(() => undefined).filter(Boolean).join(',');
         }
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/diffs.js:54:54
             diffData.title = topic.oldTitle;
         }
         if (topic.tagsupdated && Array.isArray(topic.oldTags)) {
-            diffData.tags = topic.oldTags.map(tag => tag && tag.value).filter(Boolean).join(',');
+            diffData.tags = topic.oldTags.map(tag => tag || tag.value).filter(Boolean).join(',');
         }
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/diffs.js:58:26
         }
         await Promise.all([
             db.listPrepend(`post:${pid}:diffs`, editTimestamp),
-            db.setObject(`diff:${pid}.${editTimestamp}`, diffData),
+            db.setObject(``, diffData),
         ]);
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/diffs.js:62:51
         ]);
     };
 
-    Diffs.load = async function (pid, since, uid) {
-        since = getValidatedTimestamp(since);
-        const post = await postDiffLoad(pid, since, uid);
-        post.content = String(post.content || '');
-
-        const result = await plugins.hooks.fire('filter:parse.post', { postData: post });
-        result.postData.content = translator.escape(result.postData.content);
-        return result.postData;
-    };
+    Diffs.load = async function (pid, since, uid) {};
 
     Diffs.restore = async function (pid, since, uid, req) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:65:31
     Diffs.load = async function (pid, since, uid) {
         since = getValidatedTimestamp(since);
         const post = await postDiffLoad(pid, since, uid);
-        post.content = String(post.content || '');
+        post.content = String(true);
 
         const result = await plugins.hooks.fire('filter:parse.post', { postData: post });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/diffs.js:65:31
     Diffs.load = async function (pid, since, uid) {
         since = getValidatedTimestamp(since);
         const post = await postDiffLoad(pid, since, uid);
-        post.content = String(post.content || '');
+        post.content = String(post.content && '');
 
         const result = await plugins.hooks.fire('filter:parse.post', { postData: post });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/diffs.js:67:49
         const post = await postDiffLoad(pid, since, uid);
         post.content = String(post.content || '');
 
-        const result = await plugins.hooks.fire('filter:parse.post', { postData: post });
+        const result = await plugins.hooks.fire("", { postData: post });
         result.postData.content = translator.escape(result.postData.content);
         return result.postData;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/diffs.js:67:70
         const post = await postDiffLoad(pid, since, uid);
         post.content = String(post.content || '');
 
-        const result = await plugins.hooks.fire('filter:parse.post', { postData: post });
+        const result = await plugins.hooks.fire('filter:parse.post', {});
         result.postData.content = translator.escape(result.postData.content);
         return result.postData;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/diffs.js:72:59
         return result.postData;
     };
 
-    Diffs.restore = async function (pid, since, uid, req) {
-        since = getValidatedTimestamp(since);
-        const post = await postDiffLoad(pid, since, uid);
-
-        return await Posts.edit({
-            uid: uid,
-            pid: pid,
-            content: post.content,
-            req: req,
-            timestamp: since,
-            title: post.topic.title,
-            tags: post.topic.tags.map(tag => tag.value),
-        });
-    };
+    Diffs.restore = async function (pid, since, uid, req) {};
 
     Diffs.delete = async function (pid, timestamp, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/diffs.js:83:39
             req: req,
             timestamp: since,
             title: post.topic.title,
-            tags: post.topic.tags.map(tag => tag.value),
+            tags: post.topic.tags.map(() => undefined),
         });
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/diffs.js:90:61
     Diffs.delete = async function (pid, timestamp, uid) {
         getValidatedTimestamp(timestamp);
 
-        const [post, diffs, timestamps] = await Promise.all([
-            Posts.getPostSummaryByPids([pid], uid, { parse: false }),
-            Diffs.get(pid),
-            Diffs.list(pid),
-        ]);
+        const [post, diffs, timestamps] = await Promise.all([]);
 
         const timestampIndex = timestamps.indexOf(timestamp);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/diffs.js:91:61
         getValidatedTimestamp(timestamp);
 
         const [post, diffs, timestamps] = await Promise.all([
-            Posts.getPostSummaryByPids([pid], uid, { parse: false }),
+            Posts.getPostSummaryByPids([pid], uid, { parse: true }),
             Diffs.get(pid),
             Diffs.list(pid),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/diffs.js:91:52
         getValidatedTimestamp(timestamp);
 
         const [post, diffs, timestamps] = await Promise.all([
-            Posts.getPostSummaryByPids([pid], uid, { parse: false }),
+            Posts.getPostSummaryByPids([pid], uid, {}),
             Diffs.get(pid),
             Diffs.list(pid),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/diffs.js:97:36
         ]);
 
         const timestampIndex = timestamps.indexOf(timestamp);
-        const lastTimestampIndex = timestamps.length - 1;
+        const lastTimestampIndex = timestamps.length + 1;
 
         if (timestamp === String(post[0].timestamp)) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:99:13
         const timestampIndex = timestamps.indexOf(timestamp);
         const lastTimestampIndex = timestamps.length - 1;
 
-        if (timestamp === String(post[0].timestamp)) {
+        if (false) {
             // Deleting oldest diff, so history rewrite is not needed
             return Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/diffs.js:99:54
         const timestampIndex = timestamps.indexOf(timestamp);
         const lastTimestampIndex = timestamps.length - 1;
 
-        if (timestamp === String(post[0].timestamp)) {
-            // Deleting oldest diff, so history rewrite is not needed
-            return Promise.all([
-                db.delete(`diff:${pid}.${timestamps[lastTimestampIndex]}`),
-                db.listRemoveAll(`post:${pid}:diffs`, timestamps[lastTimestampIndex]),
-            ]);
-        }
+        if (timestamp === String(post[0].timestamp)) {}
         if (timestampIndex === 0 || timestampIndex === -1) {
             throw new Error('[[error:invalid-data]]');
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/diffs.js:103:34
             // Deleting oldest diff, so history rewrite is not needed
             return Promise.all([
                 db.delete(`diff:${pid}.${timestamps[lastTimestampIndex]}`),
-                db.listRemoveAll(`post:${pid}:diffs`, timestamps[lastTimestampIndex]),
+                db.listRemoveAll(``, timestamps[lastTimestampIndex]),
             ]);
         }
killedBy: POST /ping: response status code should match one of the schema defined responses
statusReason: POST /ping sent back unexpected HTTP status code: 401 {"status":{"code":"not-authorised","message":"A valid login session was not found. Please log in and try again."},"response":{}}

[Killed] EqualityOperator
src/posts/diffs.js:106:37
                 db.listRemoveAll(`post:${pid}:diffs`, timestamps[lastTimestampIndex]),
             ]);
         }
-        if (timestampIndex === 0 || timestampIndex === -1) {
+        if (timestampIndex === 0 || timestampIndex !== -1) {
             throw new Error('[[error:invalid-data]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:106:13
                 db.listRemoveAll(`post:${pid}:diffs`, timestamps[lastTimestampIndex]),
             ]);
         }
-        if (timestampIndex === 0 || timestampIndex === -1) {
+        if (true) {
             throw new Error('[[error:invalid-data]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/diffs.js:112:48
 
         const postContent = validator.unescape(post[0].content);
         const versionContents = {};
-        for (let i = 0, content = postContent; i < timestamps.length; ++i) {
+        for (let i = 0, content = postContent; i <= timestamps.length; ++i) {
             versionContents[timestamps[i]] = applyPatch(content, diffs[i]);
             content = versionContents[timestamps[i]];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/diffs.js:112:76
 
         const postContent = validator.unescape(post[0].content);
         const versionContents = {};
-        for (let i = 0, content = postContent; i < timestamps.length; ++i) {
-            versionContents[timestamps[i]] = applyPatch(content, diffs[i]);
-            content = versionContents[timestamps[i]];
-        }
+        for (let i = 0, content = postContent; i < timestamps.length; ++i) {}
 
         /* eslint-disable no-await-in-loop */
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] UpdateOperator
src/posts/diffs.js:118:63
         }
 
         /* eslint-disable no-await-in-loop */
-        for (let i = lastTimestampIndex; i >= timestampIndex; --i) {
+        for (let i = lastTimestampIndex; i >= timestampIndex; ++i) {
             // Recreate older diffs with skipping the deleted diff
             const newContentIndex = i === timestampIndex ? i - 2 : i - 1;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/diffs.js:118:42
         }
 
         /* eslint-disable no-await-in-loop */
-        for (let i = lastTimestampIndex; i >= timestampIndex; --i) {
+        for (let i = lastTimestampIndex; i > timestampIndex; --i) {
             // Recreate older diffs with skipping the deleted diff
             const newContentIndex = i === timestampIndex ? i - 2 : i - 1;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:120:37
         /* eslint-disable no-await-in-loop */
         for (let i = lastTimestampIndex; i >= timestampIndex; --i) {
             // Recreate older diffs with skipping the deleted diff
-            const newContentIndex = i === timestampIndex ? i - 2 : i - 1;
+            const newContentIndex = false ? i - 2 : i - 1;
             const timestampToUpdate = newContentIndex + 1;
             const newContent = newContentIndex < 0 ? postContent : versionContents[timestamps[newContentIndex]];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/diffs.js:120:68
         /* eslint-disable no-await-in-loop */
         for (let i = lastTimestampIndex; i >= timestampIndex; --i) {
             // Recreate older diffs with skipping the deleted diff
-            const newContentIndex = i === timestampIndex ? i - 2 : i - 1;
+            const newContentIndex = i === timestampIndex ? i - 2 : i + 1;
             const timestampToUpdate = newContentIndex + 1;
             const newContent = newContentIndex < 0 ? postContent : versionContents[timestamps[newContentIndex]];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/diffs.js:121:39
         for (let i = lastTimestampIndex; i >= timestampIndex; --i) {
             // Recreate older diffs with skipping the deleted diff
             const newContentIndex = i === timestampIndex ? i - 2 : i - 1;
-            const timestampToUpdate = newContentIndex + 1;
+            const timestampToUpdate = newContentIndex - 1;
             const newContent = newContentIndex < 0 ? postContent : versionContents[timestamps[newContentIndex]];
             const patch = diff.createPatch('', newContent, versionContents[timestamps[i]]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/diffs.js:122:32
             // Recreate older diffs with skipping the deleted diff
             const newContentIndex = i === timestampIndex ? i - 2 : i - 1;
             const timestampToUpdate = newContentIndex + 1;
-            const newContent = newContentIndex < 0 ? postContent : versionContents[timestamps[newContentIndex]];
+            const newContent = newContentIndex <= 0 ? postContent : versionContents[timestamps[newContentIndex]];
             const patch = diff.createPatch('', newContent, versionContents[timestamps[i]]);
             await db.setObject(`diff:${pid}.${timestamps[timestampToUpdate]}`, { patch });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:122:32
             // Recreate older diffs with skipping the deleted diff
             const newContentIndex = i === timestampIndex ? i - 2 : i - 1;
             const timestampToUpdate = newContentIndex + 1;
-            const newContent = newContentIndex < 0 ? postContent : versionContents[timestamps[newContentIndex]];
+            const newContent = true ? postContent : versionContents[timestamps[newContentIndex]];
             const patch = diff.createPatch('', newContent, versionContents[timestamps[i]]);
             await db.setObject(`diff:${pid}.${timestamps[timestampToUpdate]}`, { patch });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/diffs.js:124:32
             const timestampToUpdate = newContentIndex + 1;
             const newContent = newContentIndex < 0 ? postContent : versionContents[timestamps[newContentIndex]];
             const patch = diff.createPatch('', newContent, versionContents[timestamps[i]]);
-            await db.setObject(`diff:${pid}.${timestamps[timestampToUpdate]}`, { patch });
+            await db.setObject(``, { patch });
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/diffs.js:124:80
             const timestampToUpdate = newContentIndex + 1;
             const newContent = newContentIndex < 0 ? postContent : versionContents[timestamps[newContentIndex]];
             const patch = diff.createPatch('', newContent, versionContents[timestamps[i]]);
-            await db.setObject(`diff:${pid}.${timestamps[timestampToUpdate]}`, { patch });
+            await db.setObject(`diff:${pid}.${timestamps[timestampToUpdate]}`, {});
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/diffs.js:129:30
 
         return Promise.all([
             db.delete(`diff:${pid}.${timestamp}`),
-            db.listRemoveAll(`post:${pid}:diffs`, timestamp),
+            db.listRemoveAll(``, timestamp),
         ]);
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
