[Killed] ArrowFunction
src/posts/user.js:22:60
             user.getMultipleUserSettings(uids),
             privileges.global.filterUids('signature', uids),
         ]);
-        const uidsSignatureSet = new Set(signatureUids.map(uid => parseInt(uid, 10)));
+        const uidsSignatureSet = new Set(signatureUids.map(() => undefined));
         const groupsMap = await getGroupsMap(userData);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:25:47
         const uidsSignatureSet = new Set(signatureUids.map(uid => parseInt(uid, 10)));
         const groupsMap = await getGroupsMap(userData);
 
-        userData.forEach((userData, index) => {
-            userData.signature = validator.escape(String(userData.signature || ''));
-            userData.fullname = userSettings[index].showfullname ? validator.escape(String(userData.fullname || '')) : undefined;
-            userData.selectedGroups = [];
-
-            if (meta.config.hideFullname) {
-                userData.fullname = undefined;
-            }
-        });
+        userData.forEach((userData, index) => {});
 
         const result = await Promise.all(userData.map(async (userData) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/user.js:26:58
         const groupsMap = await getGroupsMap(userData);
 
         userData.forEach((userData, index) => {
-            userData.signature = validator.escape(String(userData.signature || ''));
+            userData.signature = validator.escape(String(userData.signature && ''));
             userData.fullname = userSettings[index].showfullname ? validator.escape(String(userData.fullname || '')) : undefined;
             userData.selectedGroups = [];
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] ConditionalExpression
src/posts/user.js:26:58
         const groupsMap = await getGroupsMap(userData);
 
         userData.forEach((userData, index) => {
-            userData.signature = validator.escape(String(userData.signature || ''));
+            userData.signature = validator.escape(String(false));
             userData.fullname = userSettings[index].showfullname ? validator.escape(String(userData.fullname || '')) : undefined;
             userData.selectedGroups = [];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:27:92
 
         userData.forEach((userData, index) => {
             userData.signature = validator.escape(String(userData.signature || ''));
-            userData.fullname = userSettings[index].showfullname ? validator.escape(String(userData.fullname || '')) : undefined;
+            userData.fullname = userSettings[index].showfullname ? validator.escape(String(true)) : undefined;
             userData.selectedGroups = [];
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/user.js:27:92
 
         userData.forEach((userData, index) => {
             userData.signature = validator.escape(String(userData.signature || ''));
-            userData.fullname = userSettings[index].showfullname ? validator.escape(String(userData.fullname || '')) : undefined;
+            userData.fullname = userSettings[index].showfullname ? validator.escape(String(userData.fullname && '')) : undefined;
             userData.selectedGroups = [];
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/user.js:28:39
         userData.forEach((userData, index) => {
             userData.signature = validator.escape(String(userData.signature || ''));
             userData.fullname = userSettings[index].showfullname ? validator.escape(String(userData.fullname || '')) : undefined;
-            userData.selectedGroups = [];
+            userData.selectedGroups = ["Stryker was here"];
 
             if (meta.config.hideFullname) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:30:43
             userData.fullname = userSettings[index].showfullname ? validator.escape(String(userData.fullname || '')) : undefined;
             userData.selectedGroups = [];
 
-            if (meta.config.hideFullname) {
-                userData.fullname = undefined;
-            }
+            if (meta.config.hideFullname) {}
         });
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:30:17
             userData.fullname = userSettings[index].showfullname ? validator.escape(String(userData.fullname || '')) : undefined;
             userData.selectedGroups = [];
 
-            if (meta.config.hideFullname) {
+            if (true) {
                 userData.fullname = undefined;
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:35:75
             }
         });
 
-        const result = await Promise.all(userData.map(async (userData) => {
-            const [isMemberOfGroups, signature, customProfileInfo] = await Promise.all([
-                checkGroupMembership(userData.uid, userData.groupTitleArray),
-                parseSignature(userData, uid, uidsSignatureSet),
-                plugins.hooks.fire('filter:posts.custom_profile_info', { profile: [], uid: userData.uid }),
-            ]);
-
-            if (isMemberOfGroups && userData.groupTitleArray) {
-                userData.groupTitleArray.forEach((userGroup, index) => {
-                    if (isMemberOfGroups[index] && groupsMap[userGroup]) {
-                        userData.selectedGroups.push(groupsMap[userGroup]);
-                    }
-                });
-            }
-            userData.signature = signature;
-            userData.custom_profile_info = customProfileInfo.profile;
-
-            return await plugins.hooks.fire('filter:posts.modifyUserInfo', userData);
-        }));
+        const result = await Promise.all(userData.map(async (userData) => {}));
         const hookResult = await plugins.hooks.fire('filter:posts.getUserInfoForPosts', { users: result });
         return hookResult.users;
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] ArrayDeclaration
src/posts/user.js:36:88
         });
 
         const result = await Promise.all(userData.map(async (userData) => {
-            const [isMemberOfGroups, signature, customProfileInfo] = await Promise.all([
-                checkGroupMembership(userData.uid, userData.groupTitleArray),
-                parseSignature(userData, uid, uidsSignatureSet),
-                plugins.hooks.fire('filter:posts.custom_profile_info', { profile: [], uid: userData.uid }),
-            ]);
+            const [isMemberOfGroups, signature, customProfileInfo] = await Promise.all([]);
 
             if (isMemberOfGroups && userData.groupTitleArray) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:42:17
                 plugins.hooks.fire('filter:posts.custom_profile_info', { profile: [], uid: userData.uid }),
             ]);
 
-            if (isMemberOfGroups && userData.groupTitleArray) {
+            if (false) {
                 userData.groupTitleArray.forEach((userGroup, index) => {
                     if (isMemberOfGroups[index] && groupsMap[userGroup]) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:42:63
                 plugins.hooks.fire('filter:posts.custom_profile_info', { profile: [], uid: userData.uid }),
             ]);
 
-            if (isMemberOfGroups && userData.groupTitleArray) {
-                userData.groupTitleArray.forEach((userGroup, index) => {
-                    if (isMemberOfGroups[index] && groupsMap[userGroup]) {
-                        userData.selectedGroups.push(groupsMap[userGroup]);
-                    }
-                });
-            }
+            if (isMemberOfGroups && userData.groupTitleArray) {}
             userData.signature = signature;
             userData.custom_profile_info = customProfileInfo.profile;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:43:72
             ]);
 
             if (isMemberOfGroups && userData.groupTitleArray) {
-                userData.groupTitleArray.forEach((userGroup, index) => {
-                    if (isMemberOfGroups[index] && groupsMap[userGroup]) {
-                        userData.selectedGroups.push(groupsMap[userGroup]);
-                    }
-                });
+                userData.groupTitleArray.forEach((userGroup, index) => {});
             }
             userData.signature = signature;
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-category]]

[Killed] BlockStatement
src/posts/user.js:44:74
 
             if (isMemberOfGroups && userData.groupTitleArray) {
                 userData.groupTitleArray.forEach((userGroup, index) => {
-                    if (isMemberOfGroups[index] && groupsMap[userGroup]) {
-                        userData.selectedGroups.push(groupsMap[userGroup]);
-                    }
+                    if (isMemberOfGroups[index] && groupsMap[userGroup]) {}
                 });
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:44:25
 
             if (isMemberOfGroups && userData.groupTitleArray) {
                 userData.groupTitleArray.forEach((userGroup, index) => {
-                    if (isMemberOfGroups[index] && groupsMap[userGroup]) {
+                    if (true) {
                         userData.selectedGroups.push(groupsMap[userGroup]);
                     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/user.js:54:89
 
             return await plugins.hooks.fire('filter:posts.modifyUserInfo', userData);
         }));
-        const hookResult = await plugins.hooks.fire('filter:posts.getUserInfoForPosts', { users: result });
+        const hookResult = await plugins.hooks.fire('filter:posts.getUserInfoForPosts', {});
         return hookResult.users;
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:58:61
         return hookResult.users;
     };
 
-    Posts.overrideGuestHandle = function (postData, handle) {
-        if (meta.config.allowGuestHandles && postData && postData.user && parseInt(postData.uid, 10) === 0 && handle) {
-            postData.user.username = validator.escape(String(handle));
-            if (postData.user.hasOwnProperty('fullname')) {
-                postData.user.fullname = postData.user.username;
-            }
-            postData.user.displayname = postData.user.username;
-        }
-    };
+    Posts.overrideGuestHandle = function (postData, handle) {};
 
     async function checkGroupMembership(uid, groupTitleArray) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:59:75
     };
 
     Posts.overrideGuestHandle = function (postData, handle) {
-        if (meta.config.allowGuestHandles && postData && postData.user && parseInt(postData.uid, 10) === 0 && handle) {
+        if (meta.config.allowGuestHandles && postData && postData.user && true && handle) {
             postData.user.username = validator.escape(String(handle));
             if (postData.user.hasOwnProperty('fullname')) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/user.js:59:13
     };
 
     Posts.overrideGuestHandle = function (postData, handle) {
-        if (meta.config.allowGuestHandles && postData && postData.user && parseInt(postData.uid, 10) === 0 && handle) {
+        if (meta.config.allowGuestHandles && postData && postData.user || parseInt(postData.uid, 10) === 0 && handle) {
             postData.user.username = validator.escape(String(handle));
             if (postData.user.hasOwnProperty('fullname')) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:61:59
     Posts.overrideGuestHandle = function (postData, handle) {
         if (meta.config.allowGuestHandles && postData && postData.user && parseInt(postData.uid, 10) === 0 && handle) {
             postData.user.username = validator.escape(String(handle));
-            if (postData.user.hasOwnProperty('fullname')) {
-                postData.user.fullname = postData.user.username;
-            }
+            if (postData.user.hasOwnProperty('fullname')) {}
             postData.user.displayname = postData.user.username;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:61:17
     Posts.overrideGuestHandle = function (postData, handle) {
         if (meta.config.allowGuestHandles && postData && postData.user && parseInt(postData.uid, 10) === 0 && handle) {
             postData.user.username = validator.escape(String(handle));
-            if (postData.user.hasOwnProperty('fullname')) {
+            if (false) {
                 postData.user.fullname = postData.user.username;
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:68:63
         }
     };
 
-    async function checkGroupMembership(uid, groupTitleArray) {
-        if (!Array.isArray(groupTitleArray) || !groupTitleArray.length) {
-            return null;
-        }
-        return await groups.isMemberOfGroups(uid, groupTitleArray);
-    }
+    async function checkGroupMembership(uid, groupTitleArray) {}
 
     async function parseSignature(userData, uid, signatureUids) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:69:13
     };
 
     async function checkGroupMembership(uid, groupTitleArray) {
-        if (!Array.isArray(groupTitleArray) || !groupTitleArray.length) {
+        if (true) {
             return null;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:69:73
     };
 
     async function checkGroupMembership(uid, groupTitleArray) {
-        if (!Array.isArray(groupTitleArray) || !groupTitleArray.length) {
-            return null;
-        }
+        if (!Array.isArray(groupTitleArray) || !groupTitleArray.length) {}
         return await groups.isMemberOfGroups(uid, groupTitleArray);
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:75:65
         return await groups.isMemberOfGroups(uid, groupTitleArray);
     }
 
-    async function parseSignature(userData, uid, signatureUids) {
-        if (!userData.signature || !signatureUids.has(userData.uid) || meta.config.disableSignatures) {
-            return '';
-        }
-        const result = await Posts.parseSignature(userData, uid);
-        return result.userData.signature;
-    }
+    async function parseSignature(userData, uid, signatureUids) {}
 
     async function getGroupsMap(userData) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/user.js:76:13
     }
 
     async function parseSignature(userData, uid, signatureUids) {
-        if (!userData.signature || !signatureUids.has(userData.uid) || meta.config.disableSignatures) {
+        if (userData.signature || !signatureUids.has(userData.uid) || meta.config.disableSignatures) {
             return '';
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/user.js:76:36
     }
 
     async function parseSignature(userData, uid, signatureUids) {
-        if (!userData.signature || !signatureUids.has(userData.uid) || meta.config.disableSignatures) {
+        if (!userData.signature || signatureUids.has(userData.uid) || meta.config.disableSignatures) {
             return '';
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:83:43
         return result.userData.signature;
     }
 
-    async function getGroupsMap(userData) {
-        const groupTitles = _.uniq(_.flatten(userData.map(u => u && u.groupTitleArray)));
-        const groupsMap = {};
-        const groupsData = await groups.getGroupsData(groupTitles);
-        groupsData.forEach((group) => {
-            if (group && group.userTitleEnabled && !group.hidden) {
-                groupsMap[group.name] = {
-                    name: group.name,
-                    slug: group.slug,
-                    labelColor: group.labelColor,
-                    textColor: group.textColor,
-                    icon: group.icon,
-                    userTitle: group.userTitle,
-                };
-            }
-        });
-        return groupsMap;
-    }
+    async function getGroupsMap(userData) {}
 
     async function getUserData(uids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/user.js:84:59
     }
 
     async function getGroupsMap(userData) {
-        const groupTitles = _.uniq(_.flatten(userData.map(u => u && u.groupTitleArray)));
+        const groupTitles = _.uniq(_.flatten(userData.map(() => undefined)));
         const groupsMap = {};
         const groupsData = await groups.getGroupsData(groupTitles);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:84:64
     }
 
     async function getGroupsMap(userData) {
-        const groupTitles = _.uniq(_.flatten(userData.map(u => u && u.groupTitleArray)));
+        const groupTitles = _.uniq(_.flatten(userData.map(u => false)));
         const groupsMap = {};
         const groupsData = await groups.getGroupsData(groupTitles);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:87:39
         const groupTitles = _.uniq(_.flatten(userData.map(u => u && u.groupTitleArray)));
         const groupsMap = {};
         const groupsData = await groups.getGroupsData(groupTitles);
-        groupsData.forEach((group) => {
-            if (group && group.userTitleEnabled && !group.hidden) {
-                groupsMap[group.name] = {
-                    name: group.name,
-                    slug: group.slug,
-                    labelColor: group.labelColor,
-                    textColor: group.textColor,
-                    icon: group.icon,
-                    userTitle: group.userTitle,
-                };
-            }
-        });
+        groupsData.forEach((group) => {});
         return groupsMap;
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:88:17
         const groupsMap = {};
         const groupsData = await groups.getGroupsData(groupTitles);
         groupsData.forEach((group) => {
-            if (group && group.userTitleEnabled && !group.hidden) {
+            if (true) {
                 groupsMap[group.name] = {
                     name: group.name,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:88:17
         const groupsMap = {};
         const groupsData = await groups.getGroupsData(groupTitles);
         groupsData.forEach((group) => {
-            if (group && group.userTitleEnabled && !group.hidden) {
+            if (true && !group.hidden) {
                 groupsMap[group.name] = {
                     name: group.name,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:102:43
         return groupsMap;
     }
 
-    async function getUserData(uids, uid) {
-        const fields = [
-            'uid', 'username', 'fullname', 'userslug',
-            'reputation', 'postcount', 'topiccount', 'picture',
-            'signature', 'banned', 'banned:expire', 'status',
-            'lastonline', 'groupTitle', 'mutedUntil',
-        ];
-        const result = await plugins.hooks.fire('filter:posts.addUserFields', {
-            fields: fields,
-            uid: uid,
-            uids: uids,
-        });
-        return await user.getUsersFields(result.uids, _.uniq(result.fields));
-    }
+    async function getUserData(uids, uid) {}
 
     Posts.isOwner = async function (pids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:104:13
 
     async function getUserData(uids, uid) {
         const fields = [
-            'uid', 'username', 'fullname', 'userslug',
+            "", 'username', 'fullname', 'userslug',
             'reputation', 'postcount', 'topiccount', 'picture',
             'signature', 'banned', 'banned:expire', 'status',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:105:27
     async function getUserData(uids, uid) {
         const fields = [
             'uid', 'username', 'fullname', 'userslug',
-            'reputation', 'postcount', 'topiccount', 'picture',
+            'reputation', "", 'topiccount', 'picture',
             'signature', 'banned', 'banned:expire', 'status',
             'lastonline', 'groupTitle', 'mutedUntil',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:105:40
     async function getUserData(uids, uid) {
         const fields = [
             'uid', 'username', 'fullname', 'userslug',
-            'reputation', 'postcount', 'topiccount', 'picture',
+            'reputation', 'postcount', "", 'picture',
             'signature', 'banned', 'banned:expire', 'status',
             'lastonline', 'groupTitle', 'mutedUntil',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:106:26
         const fields = [
             'uid', 'username', 'fullname', 'userslug',
             'reputation', 'postcount', 'topiccount', 'picture',
-            'signature', 'banned', 'banned:expire', 'status',
+            'signature', "", 'banned:expire', 'status',
             'lastonline', 'groupTitle', 'mutedUntil',
         ];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:106:36
         const fields = [
             'uid', 'username', 'fullname', 'userslug',
             'reputation', 'postcount', 'topiccount', 'picture',
-            'signature', 'banned', 'banned:expire', 'status',
+            'signature', 'banned', "", 'status',
             'lastonline', 'groupTitle', 'mutedUntil',
         ];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:107:27
             'uid', 'username', 'fullname', 'userslug',
             'reputation', 'postcount', 'topiccount', 'picture',
             'signature', 'banned', 'banned:expire', 'status',
-            'lastonline', 'groupTitle', 'mutedUntil',
+            'lastonline', "", 'mutedUntil',
         ];
         const result = await plugins.hooks.fire('filter:posts.addUserFields', {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:109:49
             'signature', 'banned', 'banned:expire', 'status',
             'lastonline', 'groupTitle', 'mutedUntil',
         ];
-        const result = await plugins.hooks.fire('filter:posts.addUserFields', {
+        const result = await plugins.hooks.fire("", {
             fields: fields,
             uid: uid,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/user.js:109:79
             'signature', 'banned', 'banned:expire', 'status',
             'lastonline', 'groupTitle', 'mutedUntil',
         ];
-        const result = await plugins.hooks.fire('filter:posts.addUserFields', {
-            fields: fields,
-            uid: uid,
-            uids: uids,
-        });
+        const result = await plugins.hooks.fire('filter:posts.addUserFields', {});
         return await user.getUsersFields(result.uids, _.uniq(result.fields));
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:117:48
         return await user.getUsersFields(result.uids, _.uniq(result.fields));
     }
 
-    Posts.isOwner = async function (pids, uid) {
-        uid = parseInt(uid, 10);
-        const isArray = Array.isArray(pids);
-        pids = isArray ? pids : [pids];
-        if (uid <= 0) {
-            return isArray ? pids.map(() => false) : false;
-        }
-        const postData = await Posts.getPostsFields(pids, ['uid']);
-        const result = postData.map(post => post && post.uid === uid);
-        return isArray ? result : result[0];
-    };
+    Posts.isOwner = async function (pids, uid) {};
 
     Posts.isModerator = async function (pids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:121:13
         uid = parseInt(uid, 10);
         const isArray = Array.isArray(pids);
         pids = isArray ? pids : [pids];
-        if (uid <= 0) {
+        if (false) {
             return isArray ? pids.map(() => false) : false;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/user.js:121:13
         uid = parseInt(uid, 10);
         const isArray = Array.isArray(pids);
         pids = isArray ? pids : [pids];
-        if (uid <= 0) {
+        if (uid < 0) {
             return isArray ? pids.map(() => false) : false;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/user.js:122:45
         const isArray = Array.isArray(pids);
         pids = isArray ? pids : [pids];
         if (uid <= 0) {
-            return isArray ? pids.map(() => false) : false;
+            return isArray ? pids.map(() => true) : false;
         }
         const postData = await Posts.getPostsFields(pids, ['uid']);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/user.js:122:39
         const isArray = Array.isArray(pids);
         pids = isArray ? pids : [pids];
         if (uid <= 0) {
-            return isArray ? pids.map(() => false) : false;
+            return isArray ? pids.map(() => undefined) : false;
         }
         const postData = await Posts.getPostsFields(pids, ['uid']);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
