[Killed] EqualityOperator
src/posts/user.js:125:53
             return isArray ? pids.map(() => false) : false;
         }
         const postData = await Posts.getPostsFields(pids, ['uid']);
-        const result = postData.map(post => post && post.uid === uid);
+        const result = postData.map(post => post && post.uid !== uid);
         return isArray ? result : result[0];
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:125:45
             return isArray ? pids.map(() => false) : false;
         }
         const postData = await Posts.getPostsFields(pids, ['uid']);
-        const result = postData.map(post => post && post.uid === uid);
+        const result = postData.map(post => true);
         return isArray ? result : result[0];
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:129:52
         return isArray ? result : result[0];
     };
 
-    Posts.isModerator = async function (pids, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return pids.map(() => false);
-        }
-        const cids = await Posts.getCidsByPids(pids);
-        return await user.isModerator(uid, cids);
-    };
+    Posts.isModerator = async function (pids, uid) {};
 
     Posts.changeOwner = async function (pids, toUid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:130:37
     };
 
     Posts.isModerator = async function (pids, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return pids.map(() => false);
-        }
+        if (parseInt(uid, 10) <= 0) {}
         const cids = await Posts.getCidsByPids(pids);
         return await user.isModerator(uid, cids);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:130:13
     };
 
     Posts.isModerator = async function (pids, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (false) {
             return pids.map(() => false);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/user.js:131:35
 
     Posts.isModerator = async function (pids, uid) {
         if (parseInt(uid, 10) <= 0) {
-            return pids.map(() => false);
+            return pids.map(() => true);
         }
         const cids = await Posts.getCidsByPids(pids);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/user.js:131:29
 
     Posts.isModerator = async function (pids, uid) {
         if (parseInt(uid, 10) <= 0) {
-            return pids.map(() => false);
+            return pids.map(() => undefined);
         }
         const cids = await Posts.getCidsByPids(pids);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:139:13
 
     Posts.changeOwner = async function (pids, toUid) {
         const exists = await user.exists(toUid);
-        if (!exists) {
+        if (false) {
             throw new Error('[[error:no-user]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:139:22
 
     Posts.changeOwner = async function (pids, toUid) {
         const exists = await user.exists(toUid);
-        if (!exists) {
-            throw new Error('[[error:no-user]]');
-        }
+        if (!exists) {}
         let postData = await Posts.getPostsFields(pids, [
             'pid', 'tid', 'uid', 'content', 'deleted', 'timestamp', 'upvotes', 'downvotes',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:143:69
             throw new Error('[[error:no-user]]');
         }
         let postData = await Posts.getPostsFields(pids, [
-            'pid', 'tid', 'uid', 'content', 'deleted', 'timestamp', 'upvotes', 'downvotes',
+            'pid', 'tid', 'uid', 'content', 'deleted', 'timestamp', "", 'downvotes',
         ]);
         postData = postData.filter(p => p.pid && p.uid !== parseInt(toUid, 10));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:143:45
             throw new Error('[[error:no-user]]');
         }
         let postData = await Posts.getPostsFields(pids, [
-            'pid', 'tid', 'uid', 'content', 'deleted', 'timestamp', 'upvotes', 'downvotes',
+            'pid', 'tid', 'uid', 'content', "", 'timestamp', 'upvotes', 'downvotes',
         ]);
         postData = postData.filter(p => p.pid && p.uid !== parseInt(toUid, 10));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/user.js:145:20
         let postData = await Posts.getPostsFields(pids, [
             'pid', 'tid', 'uid', 'content', 'deleted', 'timestamp', 'upvotes', 'downvotes',
         ]);
-        postData = postData.filter(p => p.pid && p.uid !== parseInt(toUid, 10));
+        postData = postData;
         pids = postData.map(p => p.pid);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:145:41
         let postData = await Posts.getPostsFields(pids, [
             'pid', 'tid', 'uid', 'content', 'deleted', 'timestamp', 'upvotes', 'downvotes',
         ]);
-        postData = postData.filter(p => p.pid && p.uid !== parseInt(toUid, 10));
+        postData = postData.filter(p => true);
         pids = postData.map(p => p.pid);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/user.js:146:29
             'pid', 'tid', 'uid', 'content', 'deleted', 'timestamp', 'upvotes', 'downvotes',
         ]);
         postData = postData.filter(p => p.pid && p.uid !== parseInt(toUid, 10));
-        pids = postData.map(p => p.pid);
+        pids = postData.map(() => undefined);
 
         const cids = await Posts.getCidsByPids(pids);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/user.js:150:28
 
         const cids = await Posts.getCidsByPids(pids);
 
-        const bulkRemove = [];
+        const bulkRemove = ["Stryker was here"];
         const bulkAdd = [];
         let repChange = 0;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:154:39
         const bulkAdd = [];
         let repChange = 0;
         const postsByUser = {};
-        postData.forEach((post, i) => {
-            post.cid = cids[i];
-            repChange += post.votes;
-            bulkRemove.push([`uid:${post.uid}:posts`, post.pid]);
-            bulkRemove.push([`cid:${post.cid}:uid:${post.uid}:pids`, post.pid]);
-            bulkRemove.push([`cid:${post.cid}:uid:${post.uid}:pids:votes`, post.pid]);
-
-            bulkAdd.push([`uid:${toUid}:posts`, post.timestamp, post.pid]);
-            bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids`, post.timestamp, post.pid]);
-            if (post.votes > 0 || post.votes < 0) {
-                bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids:votes`, post.votes, post.pid]);
-            }
-            postsByUser[post.uid] = postsByUser[post.uid] || [];
-            postsByUser[post.uid].push(post);
-        });
+        postData.forEach((post, i) => {});
 
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] AssignmentOperator
src/posts/user.js:156:13
         const postsByUser = {};
         postData.forEach((post, i) => {
             post.cid = cids[i];
-            repChange += post.votes;
+            repChange -= post.votes;
             bulkRemove.push([`uid:${post.uid}:posts`, post.pid]);
             bulkRemove.push([`cid:${post.cid}:uid:${post.uid}:pids`, post.pid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:159:30
             repChange += post.votes;
             bulkRemove.push([`uid:${post.uid}:posts`, post.pid]);
             bulkRemove.push([`cid:${post.cid}:uid:${post.uid}:pids`, post.pid]);
-            bulkRemove.push([`cid:${post.cid}:uid:${post.uid}:pids:votes`, post.pid]);
+            bulkRemove.push([``, post.pid]);
 
             bulkAdd.push([`uid:${toUid}:posts`, post.timestamp, post.pid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/user.js:159:29
             repChange += post.votes;
             bulkRemove.push([`uid:${post.uid}:posts`, post.pid]);
             bulkRemove.push([`cid:${post.cid}:uid:${post.uid}:pids`, post.pid]);
-            bulkRemove.push([`cid:${post.cid}:uid:${post.uid}:pids:votes`, post.pid]);
+            bulkRemove.push([]);
 
             bulkAdd.push([`uid:${toUid}:posts`, post.timestamp, post.pid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:161:27
             bulkRemove.push([`cid:${post.cid}:uid:${post.uid}:pids`, post.pid]);
             bulkRemove.push([`cid:${post.cid}:uid:${post.uid}:pids:votes`, post.pid]);
 
-            bulkAdd.push([`uid:${toUid}:posts`, post.timestamp, post.pid]);
+            bulkAdd.push([``, post.timestamp, post.pid]);
             bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids`, post.timestamp, post.pid]);
             if (post.votes > 0 || post.votes < 0) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:162:27
             bulkRemove.push([`cid:${post.cid}:uid:${post.uid}:pids:votes`, post.pid]);
 
             bulkAdd.push([`uid:${toUid}:posts`, post.timestamp, post.pid]);
-            bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids`, post.timestamp, post.pid]);
+            bulkAdd.push([``, post.timestamp, post.pid]);
             if (post.votes > 0 || post.votes < 0) {
                 bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids:votes`, post.votes, post.pid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:163:51
 
             bulkAdd.push([`uid:${toUid}:posts`, post.timestamp, post.pid]);
             bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids`, post.timestamp, post.pid]);
-            if (post.votes > 0 || post.votes < 0) {
-                bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids:votes`, post.votes, post.pid]);
-            }
+            if (post.votes > 0 || post.votes < 0) {}
             postsByUser[post.uid] = postsByUser[post.uid] || [];
             postsByUser[post.uid].push(post);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/user.js:163:35
 
             bulkAdd.push([`uid:${toUid}:posts`, post.timestamp, post.pid]);
             bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids`, post.timestamp, post.pid]);
-            if (post.votes > 0 || post.votes < 0) {
+            if (post.votes > 0 || post.votes >= 0) {
                 bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids:votes`, post.votes, post.pid]);
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/user.js:164:30
             bulkAdd.push([`uid:${toUid}:posts`, post.timestamp, post.pid]);
             bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids`, post.timestamp, post.pid]);
             if (post.votes > 0 || post.votes < 0) {
-                bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids:votes`, post.votes, post.pid]);
+                bulkAdd.push([]);
             }
             postsByUser[post.uid] = postsByUser[post.uid] || [];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:164:31
             bulkAdd.push([`uid:${toUid}:posts`, post.timestamp, post.pid]);
             bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids`, post.timestamp, post.pid]);
             if (post.votes > 0 || post.votes < 0) {
-                bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids:votes`, post.votes, post.pid]);
+                bulkAdd.push([``, post.votes, post.pid]);
             }
             postsByUser[post.uid] = postsByUser[post.uid] || [];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:166:37
             if (post.votes > 0 || post.votes < 0) {
                 bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids:votes`, post.votes, post.pid]);
             }
-            postsByUser[post.uid] = postsByUser[post.uid] || [];
+            postsByUser[post.uid] = false;
             postsByUser[post.uid].push(post);
         });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:166:37
             if (post.votes > 0 || post.votes < 0) {
                 bulkAdd.push([`cid:${post.cid}:uid:${toUid}:pids:votes`, post.votes, post.pid]);
             }
-            postsByUser[post.uid] = postsByUser[post.uid] || [];
+            postsByUser[post.uid] = true;
             postsByUser[post.uid].push(post);
         });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/user.js:171:40
         });
 
         await Promise.all([
-            db.setObjectField(pids.map(pid => `post:${pid}`), 'uid', toUid),
+            db.setObjectField(pids.map(() => undefined), 'uid', toUid),
             db.sortedSetRemoveBulk(bulkRemove),
             db.sortedSetAddBulk(bulkAdd),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:171:63
         });
 
         await Promise.all([
-            db.setObjectField(pids.map(pid => `post:${pid}`), 'uid', toUid),
+            db.setObjectField(pids.map(pid => `post:${pid}`), "", toUid),
             db.sortedSetRemoveBulk(bulkRemove),
             db.sortedSetAddBulk(bulkAdd),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/user.js:179:27
             updateTopicPosters(postData, toUid),
         ]);
 
-        await Promise.all([
-            user.updatePostCount(toUid),
-            reduceCounters(postsByUser),
-        ]);
+        await Promise.all([]);
 
         plugins.hooks.fire('action:post.changeOwner', {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:191:48
         return postData;
     };
 
-    async function reduceCounters(postsByUser) {
-        await async.eachOfSeries(postsByUser, async (posts, uid) => {
-            const repChange = posts.reduce((acc, val) => acc + val.votes, 0);
-            await Promise.all([
-                user.updatePostCount(uid),
-                user.incrementUserReputationBy(uid, -repChange),
-            ]);
-        });
-    }
+    async function reduceCounters(postsByUser) {}
 
     async function updateTopicPosters(postData, toUid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:192:69
     };
 
     async function reduceCounters(postsByUser) {
-        await async.eachOfSeries(postsByUser, async (posts, uid) => {
-            const repChange = posts.reduce((acc, val) => acc + val.votes, 0);
-            await Promise.all([
-                user.updatePostCount(uid),
-                user.incrementUserReputationBy(uid, -repChange),
-            ]);
-        });
+        await async.eachOfSeries(postsByUser, async (posts, uid) => {});
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/user.js:193:44
 
     async function reduceCounters(postsByUser) {
         await async.eachOfSeries(postsByUser, async (posts, uid) => {
-            const repChange = posts.reduce((acc, val) => acc + val.votes, 0);
+            const repChange = posts.reduce(() => undefined, 0);
             await Promise.all([
                 user.updatePostCount(uid),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/user.js:193:58
 
     async function reduceCounters(postsByUser) {
         await async.eachOfSeries(postsByUser, async (posts, uid) => {
-            const repChange = posts.reduce((acc, val) => acc + val.votes, 0);
+            const repChange = posts.reduce((acc, val) => acc - val.votes, 0);
             await Promise.all([
                 user.updatePostCount(uid),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/user.js:194:31
     async function reduceCounters(postsByUser) {
         await async.eachOfSeries(postsByUser, async (posts, uid) => {
             const repChange = posts.reduce((acc, val) => acc + val.votes, 0);
-            await Promise.all([
-                user.updatePostCount(uid),
-                user.incrementUserReputationBy(uid, -repChange),
-            ]);
+            await Promise.all([]);
         });
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] UnaryOperator
src/posts/user.js:196:53
             const repChange = posts.reduce((acc, val) => acc + val.votes, 0);
             await Promise.all([
                 user.updatePostCount(uid),
-                user.incrementUserReputationBy(uid, -repChange),
+                user.incrementUserReputationBy(uid, +repChange),
             ]);
         });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:201:56
         });
     }
 
-    async function updateTopicPosters(postData, toUid) {
-        const postsByTopic = _.groupBy(postData, p => parseInt(p.tid, 10));
-        await async.eachOf(postsByTopic, async (posts, tid) => {
-            const postsByUser = _.groupBy(posts, p => parseInt(p.uid, 10));
-            await db.sortedSetIncrBy(`tid:${tid}:posters`, posts.length, toUid);
-            await async.eachOf(postsByUser, async (posts, uid) => {
-                await db.sortedSetIncrBy(`tid:${tid}:posters`, -posts.length, uid);
-            });
-        });
-    }
+    async function updateTopicPosters(postData, toUid) {}
 
     async function handleMainPidOwnerChange(postData, toUid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/user.js:202:50
     }
 
     async function updateTopicPosters(postData, toUid) {
-        const postsByTopic = _.groupBy(postData, p => parseInt(p.tid, 10));
+        const postsByTopic = _.groupBy(postData, () => undefined);
         await async.eachOf(postsByTopic, async (posts, tid) => {
             const postsByUser = _.groupBy(posts, p => parseInt(p.uid, 10));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:203:64
 
     async function updateTopicPosters(postData, toUid) {
         const postsByTopic = _.groupBy(postData, p => parseInt(p.tid, 10));
-        await async.eachOf(postsByTopic, async (posts, tid) => {
-            const postsByUser = _.groupBy(posts, p => parseInt(p.uid, 10));
-            await db.sortedSetIncrBy(`tid:${tid}:posters`, posts.length, toUid);
-            await async.eachOf(postsByUser, async (posts, uid) => {
-                await db.sortedSetIncrBy(`tid:${tid}:posters`, -posts.length, uid);
-            });
-        });
+        await async.eachOf(postsByTopic, async (posts, tid) => {});
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/user.js:204:50
     async function updateTopicPosters(postData, toUid) {
         const postsByTopic = _.groupBy(postData, p => parseInt(p.tid, 10));
         await async.eachOf(postsByTopic, async (posts, tid) => {
-            const postsByUser = _.groupBy(posts, p => parseInt(p.uid, 10));
+            const postsByUser = _.groupBy(posts, () => undefined);
             await db.sortedSetIncrBy(`tid:${tid}:posters`, posts.length, toUid);
             await async.eachOf(postsByUser, async (posts, uid) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:205:38
         const postsByTopic = _.groupBy(postData, p => parseInt(p.tid, 10));
         await async.eachOf(postsByTopic, async (posts, tid) => {
             const postsByUser = _.groupBy(posts, p => parseInt(p.uid, 10));
-            await db.sortedSetIncrBy(`tid:${tid}:posters`, posts.length, toUid);
+            await db.sortedSetIncrBy(``, posts.length, toUid);
             await async.eachOf(postsByUser, async (posts, uid) => {
                 await db.sortedSetIncrBy(`tid:${tid}:posters`, -posts.length, uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:206:67
         await async.eachOf(postsByTopic, async (posts, tid) => {
             const postsByUser = _.groupBy(posts, p => parseInt(p.uid, 10));
             await db.sortedSetIncrBy(`tid:${tid}:posters`, posts.length, toUid);
-            await async.eachOf(postsByUser, async (posts, uid) => {
-                await db.sortedSetIncrBy(`tid:${tid}:posters`, -posts.length, uid);
-            });
+            await async.eachOf(postsByUser, async (posts, uid) => {});
         });
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] UnaryOperator
src/posts/user.js:207:64
             const postsByUser = _.groupBy(posts, p => parseInt(p.uid, 10));
             await db.sortedSetIncrBy(`tid:${tid}:posters`, posts.length, toUid);
             await async.eachOf(postsByUser, async (posts, uid) => {
-                await db.sortedSetIncrBy(`tid:${tid}:posters`, -posts.length, uid);
+                await db.sortedSetIncrBy(`tid:${tid}:posters`, +posts.length, uid);
             });
         });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/user.js:213:42
     }
 
     async function handleMainPidOwnerChange(postData, toUid) {
-        const tids = _.uniq(postData.map(p => p.tid));
+        const tids = _.uniq(postData.map(() => undefined));
         const topicData = await topics.getTopicsFields(tids, [
             'tid', 'cid', 'deleted', 'title', 'uid', 'mainPid', 'timestamp',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:215:47
     async function handleMainPidOwnerChange(postData, toUid) {
         const tids = _.uniq(postData.map(p => p.tid));
         const topicData = await topics.getTopicsFields(tids, [
-            'tid', 'cid', 'deleted', 'title', 'uid', 'mainPid', 'timestamp',
+            'tid', 'cid', 'deleted', 'title', "", 'mainPid', 'timestamp',
         ]);
         const tidToTopic = _.zipObject(tids, topicData);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/user.js:219:43
         ]);
         const tidToTopic = _.zipObject(tids, topicData);
 
-        const mainPosts = postData.filter(p => p.pid === tidToTopic[p.tid].mainPid);
+        const mainPosts = postData.filter(() => undefined);
         if (!mainPosts.length) {
             return;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/user.js:219:27
         ]);
         const tidToTopic = _.zipObject(tids, topicData);
 
-        const mainPosts = postData.filter(p => p.pid === tidToTopic[p.tid].mainPid);
+        const mainPosts = postData;
         if (!mainPosts.length) {
             return;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:220:13
         const tidToTopic = _.zipObject(tids, topicData);
 
         const mainPosts = postData.filter(p => p.pid === tidToTopic[p.tid].mainPid);
-        if (!mainPosts.length) {
+        if (false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:220:13
         const tidToTopic = _.zipObject(tids, topicData);
 
         const mainPosts = postData.filter(p => p.pid === tidToTopic[p.tid].mainPid);
-        if (!mainPosts.length) {
+        if (true) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/user.js:224:25
             return;
         }
 
-        const bulkAdd = [];
+        const bulkAdd = ["Stryker was here"];
         const bulkRemove = [];
         const postsByUser = {};
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:227:37
         const bulkAdd = [];
         const bulkRemove = [];
         const postsByUser = {};
-        mainPosts.forEach((post) => {
-            bulkRemove.push([`cid:${post.cid}:uid:${post.uid}:tids`, post.tid]);
-            bulkRemove.push([`uid:${post.uid}:topics`, post.tid]);
-
-            bulkAdd.push([`cid:${post.cid}:uid:${toUid}:tids`, tidToTopic[post.tid].timestamp, post.tid]);
-            bulkAdd.push([`uid:${toUid}:topics`, tidToTopic[post.tid].timestamp, post.tid]);
-            postsByUser[post.uid] = postsByUser[post.uid] || [];
-            postsByUser[post.uid].push(post);
-        });
+        mainPosts.forEach((post) => {});
 
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:228:30
         const bulkRemove = [];
         const postsByUser = {};
         mainPosts.forEach((post) => {
-            bulkRemove.push([`cid:${post.cid}:uid:${post.uid}:tids`, post.tid]);
+            bulkRemove.push([``, post.tid]);
             bulkRemove.push([`uid:${post.uid}:topics`, post.tid]);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:229:30
         const postsByUser = {};
         mainPosts.forEach((post) => {
             bulkRemove.push([`cid:${post.cid}:uid:${post.uid}:tids`, post.tid]);
-            bulkRemove.push([`uid:${post.uid}:topics`, post.tid]);
+            bulkRemove.push([``, post.tid]);
 
             bulkAdd.push([`cid:${post.cid}:uid:${toUid}:tids`, tidToTopic[post.tid].timestamp, post.tid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
