[Killed] BlockStatement
src/posts/diffs.js:133:50
         ]);
     };
 
-    async function postDiffLoad(pid, since, uid) {
-        // Retrieves all diffs made since `since` and replays them to reconstruct what the post looked like at `since`
-        const [post, diffs] = await Promise.all([
-            Posts.getPostSummaryByPids([pid], uid, { parse: false }),
-            Posts.diffs.get(pid, since),
-        ]);
-
-        // Replace content with re-constructed content from that point in time
-        post[0].content = diffs.reduce(applyPatch, validator.unescape(post[0].content));
-
-        const titleDiffs = diffs.filter(d => d.hasOwnProperty('title') && d.title);
-        if (titleDiffs.length && post[0].topic) {
-            post[0].topic.title = validator.unescape(String(titleDiffs[titleDiffs.length - 1].title));
-        }
-        const tagDiffs = diffs.filter(d => d.hasOwnProperty('tags') && d.tags);
-        if (tagDiffs.length && post[0].topic) {
-            const tags = tagDiffs[tagDiffs.length - 1].tags.split(',').map(tag => ({ value: tag }));
-            post[0].topic.tags = await topics.getTagData(tags);
-        }
-
-        return post[0];
-    }
+    async function postDiffLoad(pid, since, uid) {}
 
     function getValidatedTimestamp(timestamp) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/diffs.js:136:61
     async function postDiffLoad(pid, since, uid) {
         // Retrieves all diffs made since `since` and replays them to reconstruct what the post looked like at `since`
         const [post, diffs] = await Promise.all([
-            Posts.getPostSummaryByPids([pid], uid, { parse: false }),
+            Posts.getPostSummaryByPids([pid], uid, { parse: true }),
             Posts.diffs.get(pid, since),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/diffs.js:143:46
         // Replace content with re-constructed content from that point in time
         post[0].content = diffs.reduce(applyPatch, validator.unescape(post[0].content));
 
-        const titleDiffs = diffs.filter(d => d.hasOwnProperty('title') && d.title);
+        const titleDiffs = diffs.filter(d => d.hasOwnProperty('title') || d.title);
         if (titleDiffs.length && post[0].topic) {
             post[0].topic.title = validator.unescape(String(titleDiffs[titleDiffs.length - 1].title));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/diffs.js:143:41
         // Replace content with re-constructed content from that point in time
         post[0].content = diffs.reduce(applyPatch, validator.unescape(post[0].content));
 
-        const titleDiffs = diffs.filter(d => d.hasOwnProperty('title') && d.title);
+        const titleDiffs = diffs.filter(() => undefined);
         if (titleDiffs.length && post[0].topic) {
             post[0].topic.title = validator.unescape(String(titleDiffs[titleDiffs.length - 1].title));
killedBy: POST /ping: response status code should match one of the schema defined responses
statusReason: POST /ping sent back unexpected HTTP status code: 401 {"status":{"code":"not-authorised","message":"A valid login session was not found. Please log in and try again."},"response":{}}

[Killed] BlockStatement
src/posts/diffs.js:144:49
         post[0].content = diffs.reduce(applyPatch, validator.unescape(post[0].content));
 
         const titleDiffs = diffs.filter(d => d.hasOwnProperty('title') && d.title);
-        if (titleDiffs.length && post[0].topic) {
-            post[0].topic.title = validator.unescape(String(titleDiffs[titleDiffs.length - 1].title));
-        }
+        if (titleDiffs.length && post[0].topic) {}
         const tagDiffs = diffs.filter(d => d.hasOwnProperty('tags') && d.tags);
         if (tagDiffs.length && post[0].topic) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/diffs.js:144:13
         post[0].content = diffs.reduce(applyPatch, validator.unescape(post[0].content));
 
         const titleDiffs = diffs.filter(d => d.hasOwnProperty('title') && d.title);
-        if (titleDiffs.length && post[0].topic) {
+        if (titleDiffs.length || post[0].topic) {
             post[0].topic.title = validator.unescape(String(titleDiffs[titleDiffs.length - 1].title));
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/diffs.js:145:72
 
         const titleDiffs = diffs.filter(d => d.hasOwnProperty('title') && d.title);
         if (titleDiffs.length && post[0].topic) {
-            post[0].topic.title = validator.unescape(String(titleDiffs[titleDiffs.length - 1].title));
+            post[0].topic.title = validator.unescape(String(titleDiffs[titleDiffs.length + 1].title));
         }
         const tagDiffs = diffs.filter(d => d.hasOwnProperty('tags') && d.tags);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/diffs.js:147:44
         if (titleDiffs.length && post[0].topic) {
             post[0].topic.title = validator.unescape(String(titleDiffs[titleDiffs.length - 1].title));
         }
-        const tagDiffs = diffs.filter(d => d.hasOwnProperty('tags') && d.tags);
+        const tagDiffs = diffs.filter(d => d.hasOwnProperty('tags') || d.tags);
         if (tagDiffs.length && post[0].topic) {
             const tags = tagDiffs[tagDiffs.length - 1].tags.split(',').map(tag => ({ value: tag }));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/diffs.js:147:26
         if (titleDiffs.length && post[0].topic) {
             post[0].topic.title = validator.unescape(String(titleDiffs[titleDiffs.length - 1].title));
         }
-        const tagDiffs = diffs.filter(d => d.hasOwnProperty('tags') && d.tags);
+        const tagDiffs = diffs;
         if (tagDiffs.length && post[0].topic) {
             const tags = tagDiffs[tagDiffs.length - 1].tags.split(',').map(tag => ({ value: tag }));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:148:13
             post[0].topic.title = validator.unescape(String(titleDiffs[titleDiffs.length - 1].title));
         }
         const tagDiffs = diffs.filter(d => d.hasOwnProperty('tags') && d.tags);
-        if (tagDiffs.length && post[0].topic) {
+        if (false) {
             const tags = tagDiffs[tagDiffs.length - 1].tags.split(',').map(tag => ({ value: tag }));
             post[0].topic.tags = await topics.getTagData(tags);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/diffs.js:148:47
             post[0].topic.title = validator.unescape(String(titleDiffs[titleDiffs.length - 1].title));
         }
         const tagDiffs = diffs.filter(d => d.hasOwnProperty('tags') && d.tags);
-        if (tagDiffs.length && post[0].topic) {
-            const tags = tagDiffs[tagDiffs.length - 1].tags.split(',').map(tag => ({ value: tag }));
-            post[0].topic.tags = await topics.getTagData(tags);
-        }
+        if (tagDiffs.length && post[0].topic) {}
 
         return post[0];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/diffs.js:149:35
         }
         const tagDiffs = diffs.filter(d => d.hasOwnProperty('tags') && d.tags);
         if (tagDiffs.length && post[0].topic) {
-            const tags = tagDiffs[tagDiffs.length - 1].tags.split(',').map(tag => ({ value: tag }));
+            const tags = tagDiffs[tagDiffs.length + 1].tags.split(',').map(tag => ({ value: tag }));
             post[0].topic.tags = await topics.getTagData(tags);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/diffs.js:149:76
         }
         const tagDiffs = diffs.filter(d => d.hasOwnProperty('tags') && d.tags);
         if (tagDiffs.length && post[0].topic) {
-            const tags = tagDiffs[tagDiffs.length - 1].tags.split(',').map(tag => ({ value: tag }));
+            const tags = tagDiffs[tagDiffs.length - 1].tags.split(',').map(() => undefined);
             post[0].topic.tags = await topics.getTagData(tags);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/diffs.js:156:47
         return post[0];
     }
 
-    function getValidatedTimestamp(timestamp) {
-        timestamp = parseInt(timestamp, 10);
-
-        if (isNaN(timestamp)) {
-            throw new Error('[[error:invalid-data]]');
-        }
-
-        return timestamp;
-    }
+    function getValidatedTimestamp(timestamp) {}
 
     function applyPatch(content, aDiff) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/diffs.js:159:31
     function getValidatedTimestamp(timestamp) {
         timestamp = parseInt(timestamp, 10);
 
-        if (isNaN(timestamp)) {
-            throw new Error('[[error:invalid-data]]');
-        }
+        if (isNaN(timestamp)) {}
 
         return timestamp;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:159:13
     function getValidatedTimestamp(timestamp) {
         timestamp = parseInt(timestamp, 10);
 
-        if (isNaN(timestamp)) {
+        if (true) {
             throw new Error('[[error:invalid-data]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/diffs.js:166:41
         return timestamp;
     }
 
-    function applyPatch(content, aDiff) {
-        if (aDiff && aDiff.patch) {
-            const result = diff.applyPatch(content, aDiff.patch, {
-                fuzzFactor: 1,
-            });
-            return typeof result === 'string' ? result : content;
-        }
-        return content;
-    }
+    function applyPatch(content, aDiff) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:167:13
     }
 
     function applyPatch(content, aDiff) {
-        if (aDiff && aDiff.patch) {
+        if (true) {
             const result = diff.applyPatch(content, aDiff.patch, {
                 fuzzFactor: 1,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/diffs.js:167:13
     }
 
     function applyPatch(content, aDiff) {
-        if (aDiff && aDiff.patch) {
+        if (aDiff || aDiff.patch) {
             const result = diff.applyPatch(content, aDiff.patch, {
                 fuzzFactor: 1,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/diffs.js:168:66
 
     function applyPatch(content, aDiff) {
         if (aDiff && aDiff.patch) {
-            const result = diff.applyPatch(content, aDiff.patch, {
-                fuzzFactor: 1,
-            });
+            const result = diff.applyPatch(content, aDiff.patch, {});
             return typeof result === 'string' ? result : content;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/diffs.js:171:20
             const result = diff.applyPatch(content, aDiff.patch, {
                 fuzzFactor: 1,
             });
-            return typeof result === 'string' ? result : content;
+            return true ? result : content;
         }
         return content;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/diffs.js:171:20
             const result = diff.applyPatch(content, aDiff.patch, {
                 fuzzFactor: 1,
             });
-            return typeof result === 'string' ? result : content;
+            return typeof result !== 'string' ? result : content;
         }
         return content;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
