[Killed] ArrayDeclaration
src/posts/user.js:231:26
             bulkRemove.push([`cid:${post.cid}:uid:${post.uid}:tids`, post.tid]);
             bulkRemove.push([`uid:${post.uid}:topics`, post.tid]);
 
-            bulkAdd.push([`cid:${post.cid}:uid:${toUid}:tids`, tidToTopic[post.tid].timestamp, post.tid]);
+            bulkAdd.push([]);
             bulkAdd.push([`uid:${toUid}:topics`, tidToTopic[post.tid].timestamp, post.tid]);
             postsByUser[post.uid] = postsByUser[post.uid] || [];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/user.js:233:37
 
             bulkAdd.push([`cid:${post.cid}:uid:${toUid}:tids`, tidToTopic[post.tid].timestamp, post.tid]);
             bulkAdd.push([`uid:${toUid}:topics`, tidToTopic[post.tid].timestamp, post.tid]);
-            postsByUser[post.uid] = postsByUser[post.uid] || [];
+            postsByUser[post.uid] = postsByUser[post.uid] && [];
             postsByUser[post.uid].push(post);
         });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/user.js:233:37
 
             bulkAdd.push([`cid:${post.cid}:uid:${toUid}:tids`, tidToTopic[post.tid].timestamp, post.tid]);
             bulkAdd.push([`uid:${toUid}:topics`, tidToTopic[post.tid].timestamp, post.tid]);
-            postsByUser[post.uid] = postsByUser[post.uid] || [];
+            postsByUser[post.uid] = false;
             postsByUser[post.uid].push(post);
         });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/user.js:238:45
         });
 
         await Promise.all([
-            db.setObjectField(mainPosts.map(p => `topic:${p.tid}`), 'uid', toUid),
+            db.setObjectField(mainPosts.map(() => undefined), 'uid', toUid),
             db.sortedSetRemoveBulk(bulkRemove),
             db.sortedSetAddBulk(bulkAdd),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:238:69
         });
 
         await Promise.all([
-            db.setObjectField(mainPosts.map(p => `topic:${p.tid}`), 'uid', toUid),
+            db.setObjectField(mainPosts.map(p => `topic:${p.tid}`), "", toUid),
             db.sortedSetRemoveBulk(bulkRemove),
             db.sortedSetAddBulk(bulkAdd),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:241:46
             db.setObjectField(mainPosts.map(p => `topic:${p.tid}`), 'uid', toUid),
             db.sortedSetRemoveBulk(bulkRemove),
             db.sortedSetAddBulk(bulkAdd),
-            user.incrementUserFieldBy(toUid, 'topiccount', mainPosts.length),
+            user.incrementUserFieldBy(toUid, "", mainPosts.length),
             reduceTopicCounts(postsByUser),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/user.js:245:45
             reduceTopicCounts(postsByUser),
         ]);
 
-        const changedTopics = mainPosts.map(p => tidToTopic[p.tid]);
+        const changedTopics = mainPosts.map(() => undefined);
         plugins.hooks.fire('action:topic.changeOwner', {
             topics: _.cloneDeep(changedTopics),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/user.js:246:56
         ]);
 
         const changedTopics = mainPosts.map(p => tidToTopic[p.tid]);
-        plugins.hooks.fire('action:topic.changeOwner', {
-            topics: _.cloneDeep(changedTopics),
-            toUid: toUid,
-        });
+        plugins.hooks.fire('action:topic.changeOwner', {});
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:246:28
         ]);
 
         const changedTopics = mainPosts.map(p => tidToTopic[p.tid]);
-        plugins.hooks.fire('action:topic.changeOwner', {
+        plugins.hooks.fire("", {
             topics: _.cloneDeep(changedTopics),
             toUid: toUid,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:252:51
         });
     }
 
-    async function reduceTopicCounts(postsByUser) {
-        await async.eachSeries(Object.keys(postsByUser), async (uid) => {
-            const posts = postsByUser[uid];
-            const exists = await user.exists(uid);
-            if (exists) {
-                await user.incrementUserFieldBy(uid, 'topiccount', -posts.length);
-            }
-        });
-    }
+    async function reduceTopicCounts(postsByUser) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:253:73
     }
 
     async function reduceTopicCounts(postsByUser) {
-        await async.eachSeries(Object.keys(postsByUser), async (uid) => {
-            const posts = postsByUser[uid];
-            const exists = await user.exists(uid);
-            if (exists) {
-                await user.incrementUserFieldBy(uid, 'topiccount', -posts.length);
-            }
-        });
+        await async.eachSeries(Object.keys(postsByUser), async (uid) => {});
     }
 };
killedBy: POST /ping: response status code should match one of the schema defined responses
statusReason: POST /ping sent back unexpected HTTP status code: 401 {"status":{"code":"not-authorised","message":"A valid login session was not found. Please log in and try again."},"response":{}}

[Killed] ConditionalExpression
src/posts/user.js:256:17
         await async.eachSeries(Object.keys(postsByUser), async (uid) => {
             const posts = postsByUser[uid];
             const exists = await user.exists(uid);
-            if (exists) {
+            if (false) {
                 await user.incrementUserFieldBy(uid, 'topiccount', -posts.length);
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/user.js:256:25
         await async.eachSeries(Object.keys(postsByUser), async (uid) => {
             const posts = postsByUser[uid];
             const exists = await user.exists(uid);
-            if (exists) {
-                await user.incrementUserFieldBy(uid, 'topiccount', -posts.length);
-            }
+            if (exists) {}
         });
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] UnaryOperator
src/posts/user.js:257:68
             const posts = postsByUser[uid];
             const exists = await user.exists(uid);
             if (exists) {
-                await user.incrementUserFieldBy(uid, 'topiccount', -posts.length);
+                await user.incrementUserFieldBy(uid, 'topiccount', +posts.length);
             }
         });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/user.js:257:54
             const posts = postsByUser[uid];
             const exists = await user.exists(uid);
             if (exists) {
-                await user.incrementUserFieldBy(uid, 'topiccount', -posts.length);
+                await user.incrementUserFieldBy(uid, "", -posts.length);
             }
         });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
