[Killed] BlockStatement
src/posts/endorse.js:11:50
 // pid is non-deterministic (could be array or a single object)
 // uid is number for the user ID
 module.exports = function (Posts) {
-    async function toggleEndorse(type, pid, uid) {
-        console.assert(typeof type === 'string');
-        console.assert(typeof uid === 'number');
-
-        if (parseInt(String(uid), 10) <= 0) {
-            throw new Error('[[error:not-logged-in]]');
-        }
-
-        const isEndorsing = type === 'endorse';
-        const postData = await Posts.getPostFields(pid, ['pid', 'endorsed']);
-
-        await db[isEndorsing ? 'setAdd' : 'setRemove'](
-            `pid:${pid}:users_endorsed`,
-            uid
-        );
-        postData.endorsed = await db.setCount(`pid:${pid}:users_endorsed`);
-        await Posts.setPostField(pid, 'endorsed', postData.endorsed);
-
-        return {
-            post: postData,
-            isEndorsed: isEndorsing,
-        };
-    }
+    async function toggleEndorse(type, pid, uid) {}
 
     Posts.endorse = async function (pid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/endorse.js:12:24
 // uid is number for the user ID
 module.exports = function (Posts) {
     async function toggleEndorse(type, pid, uid) {
-        console.assert(typeof type === 'string');
+        console.assert(false);
         console.assert(typeof uid === 'number');
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/endorse.js:12:24
 // uid is number for the user ID
 module.exports = function (Posts) {
     async function toggleEndorse(type, pid, uid) {
-        console.assert(typeof type === 'string');
+        console.assert(typeof type !== 'string');
         console.assert(typeof uid === 'number');
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/endorse.js:13:24
 module.exports = function (Posts) {
     async function toggleEndorse(type, pid, uid) {
         console.assert(typeof type === 'string');
-        console.assert(typeof uid === 'number');
+        console.assert(false);
 
         if (parseInt(String(uid), 10) <= 0) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/endorse.js:13:24
 module.exports = function (Posts) {
     async function toggleEndorse(type, pid, uid) {
         console.assert(typeof type === 'string');
-        console.assert(typeof uid === 'number');
+        console.assert(typeof uid !== 'number');
 
         if (parseInt(String(uid), 10) <= 0) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/endorse.js:15:13
         console.assert(typeof type === 'string');
         console.assert(typeof uid === 'number');
 
-        if (parseInt(String(uid), 10) <= 0) {
+        if (false) {
             throw new Error('[[error:not-logged-in]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/endorse.js:15:45
         console.assert(typeof type === 'string');
         console.assert(typeof uid === 'number');
 
-        if (parseInt(String(uid), 10) <= 0) {
-            throw new Error('[[error:not-logged-in]]');
-        }
+        if (parseInt(String(uid), 10) <= 0) {}
 
         const isEndorsing = type === 'endorse';
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/endorse.js:16:29
         console.assert(typeof uid === 'number');
 
         if (parseInt(String(uid), 10) <= 0) {
-            throw new Error('[[error:not-logged-in]]');
+            throw new Error("");
         }
 
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] ConditionalExpression
src/posts/endorse.js:19:29
             throw new Error('[[error:not-logged-in]]');
         }
 
-        const isEndorsing = type === 'endorse';
+        const isEndorsing = false;
         const postData = await Posts.getPostFields(pid, ['pid', 'endorsed']);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/endorse.js:19:29
             throw new Error('[[error:not-logged-in]]');
         }
 
-        const isEndorsing = type === 'endorse';
+        const isEndorsing = true;
         const postData = await Posts.getPostFields(pid, ['pid', 'endorsed']);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/endorse.js:20:57
         }
 
         const isEndorsing = type === 'endorse';
-        const postData = await Posts.getPostFields(pid, ['pid', 'endorsed']);
+        const postData = await Posts.getPostFields(pid, []);
 
         await db[isEndorsing ? 'setAdd' : 'setRemove'](
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/endorse.js:29:16
         postData.endorsed = await db.setCount(`pid:${pid}:users_endorsed`);
         await Posts.setPostField(pid, 'endorsed', postData.endorsed);
 
-        return {
-            post: postData,
-            isEndorsed: isEndorsing,
-        };
+        return {};
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/endorse.js:35:47
         };
     }
 
-    Posts.endorse = async function (pid, uid) {
-        console.assert(typeof uid === 'number');
-
-        const isInstr = await user.isInstructor(uid);
-        const isAdmin = await user.isAdministrator(uid);
-        if (isInstr || isAdmin) {
-            const result = await toggleEndorse('endorse', pid, uid);
-            return result;
-        }
-        if (!isInstr && !isAdmin) {
-            throw new Error('[[error:not-instructor]]');
-        }
-    };
+    Posts.endorse = async function (pid, uid) {};
 
     Posts.unendorse = async function (pid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/endorse.js:36:24
     }
 
     Posts.endorse = async function (pid, uid) {
-        console.assert(typeof uid === 'number');
+        console.assert(false);
 
         const isInstr = await user.isInstructor(uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/endorse.js:36:24
     }
 
     Posts.endorse = async function (pid, uid) {
-        console.assert(typeof uid === 'number');
+        console.assert(typeof uid !== 'number');
 
         const isInstr = await user.isInstructor(uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/endorse.js:40:13
 
         const isInstr = await user.isInstructor(uid);
         const isAdmin = await user.isAdministrator(uid);
-        if (isInstr || isAdmin) {
+        if (isInstr && isAdmin) {
             const result = await toggleEndorse('endorse', pid, uid);
             return result;
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-category]]

[Killed] BlockStatement
src/posts/endorse.js:40:33
 
         const isInstr = await user.isInstructor(uid);
         const isAdmin = await user.isAdministrator(uid);
-        if (isInstr || isAdmin) {
-            const result = await toggleEndorse('endorse', pid, uid);
-            return result;
-        }
+        if (isInstr || isAdmin) {}
         if (!isInstr && !isAdmin) {
             throw new Error('[[error:not-instructor]]');
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/endorse.js:44:13
             const result = await toggleEndorse('endorse', pid, uid);
             return result;
         }
-        if (!isInstr && !isAdmin) {
+        if (!isInstr || !isAdmin) {
             throw new Error('[[error:not-instructor]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/endorse.js:44:13
             const result = await toggleEndorse('endorse', pid, uid);
             return result;
         }
-        if (!isInstr && !isAdmin) {
+        if (isInstr && !isAdmin) {
             throw new Error('[[error:not-instructor]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/endorse.js:45:29
             return result;
         }
         if (!isInstr && !isAdmin) {
-            throw new Error('[[error:not-instructor]]');
+            throw new Error("");
         }
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/endorse.js:49:49
         }
     };
 
-    Posts.unendorse = async function (pid, uid) {
-        console.assert(typeof uid === 'number');
-
-        const isInstr = await user.isInstructor(uid);
-        const isAdmin = await user.isAdministrator(uid);
-        if (isInstr || isAdmin) {
-            const result = await toggleEndorse('unendorse', pid, uid);
-            return result;
-        }
-        if (!isInstr && !isAdmin) {
-            throw new Error('[[error:not-instructor]]');
-        }
-    };
+    Posts.unendorse = async function (pid, uid) {};
 
     Posts.hasEndorsed = async function (pid, uid) {
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] EqualityOperator
src/posts/endorse.js:50:24
     };
 
     Posts.unendorse = async function (pid, uid) {
-        console.assert(typeof uid === 'number');
+        console.assert(typeof uid !== 'number');
 
         const isInstr = await user.isInstructor(uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/endorse.js:50:24
     };
 
     Posts.unendorse = async function (pid, uid) {
-        console.assert(typeof uid === 'number');
+        console.assert(false);
 
         const isInstr = await user.isInstructor(uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/endorse.js:54:13
 
         const isInstr = await user.isInstructor(uid);
         const isAdmin = await user.isAdministrator(uid);
-        if (isInstr || isAdmin) {
+        if (true) {
             const result = await toggleEndorse('unendorse', pid, uid);
             return result;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/endorse.js:55:48
         const isInstr = await user.isInstructor(uid);
         const isAdmin = await user.isAdministrator(uid);
         if (isInstr || isAdmin) {
-            const result = await toggleEndorse('unendorse', pid, uid);
+            const result = await toggleEndorse("", pid, uid);
             return result;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/endorse.js:58:25
             const result = await toggleEndorse('unendorse', pid, uid);
             return result;
         }
-        if (!isInstr && !isAdmin) {
+        if (!isInstr && isAdmin) {
             throw new Error('[[error:not-instructor]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/endorse.js:58:13
             const result = await toggleEndorse('unendorse', pid, uid);
             return result;
         }
-        if (!isInstr && !isAdmin) {
+        if (true) {
             throw new Error('[[error:not-instructor]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/endorse.js:63:51
         }
     };
 
-    Posts.hasEndorsed = async function (pid, uid) {
-        if (Array.isArray(pid)) {
-            const sets = pid.map(pid => `pid:${pid}:users_endorsed`);
-            return await db.isMemberOfSets(sets, uid);
-        }
-
-        return await db.isSetMember(`pid:${pid}:users_endorsed`, uid);
-    };
+    Posts.hasEndorsed = async function (pid, uid) {};
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/endorse.js:64:13
     };
 
     Posts.hasEndorsed = async function (pid, uid) {
-        if (Array.isArray(pid)) {
+        if (false) {
             const sets = pid.map(pid => `pid:${pid}:users_endorsed`);
             return await db.isMemberOfSets(sets, uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/endorse.js:64:13
     };
 
     Posts.hasEndorsed = async function (pid, uid) {
-        if (Array.isArray(pid)) {
+        if (true) {
             const sets = pid.map(pid => `pid:${pid}:users_endorsed`);
             return await db.isMemberOfSets(sets, uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/endorse.js:65:34
 
     Posts.hasEndorsed = async function (pid, uid) {
         if (Array.isArray(pid)) {
-            const sets = pid.map(pid => `pid:${pid}:users_endorsed`);
+            const sets = pid.map(() => undefined);
             return await db.isMemberOfSets(sets, uid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/endorse.js:65:41
 
     Posts.hasEndorsed = async function (pid, uid) {
         if (Array.isArray(pid)) {
-            const sets = pid.map(pid => `pid:${pid}:users_endorsed`);
+            const sets = pid.map(pid => ``);
             return await db.isMemberOfSets(sets, uid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/endorse.js:69:37
             return await db.isMemberOfSets(sets, uid);
         }
 
-        return await db.isSetMember(`pid:${pid}:users_endorsed`, uid);
+        return await db.isSetMember(``, uid);
     };
 };
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]
