[Killed] StringLiteral
src/posts/parse.js:17:23
 let sanitizeConfig = {
     allowedTags: sanitize.defaults.allowedTags.concat([
         // Some safe-to-use tags to add
-        'sup', 'ins', 'del', 'img', 'button',
+        'sup', 'ins', "", 'img', 'button',
         'video', 'audio', 'iframe', 'embed',
         // 'sup' still necessary until https://github.com/apostrophecms/sanitize-html/pull/422 merged
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/parse.js:17:9
 let sanitizeConfig = {
     allowedTags: sanitize.defaults.allowedTags.concat([
         // Some safe-to-use tags to add
-        'sup', 'ins', 'del', 'img', 'button',
+        "", 'ins', 'del', 'img', 'button',
         'video', 'audio', 'iframe', 'embed',
         // 'sup' still necessary until https://github.com/apostrophecms/sanitize-html/pull/422 merged
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/parse.js:18:18
     allowedTags: sanitize.defaults.allowedTags.concat([
         // Some safe-to-use tags to add
         'sup', 'ins', 'del', 'img', 'button',
-        'video', 'audio', 'iframe', 'embed',
+        'video', "", 'iframe', 'embed',
         // 'sup' still necessary until https://github.com/apostrophecms/sanitize-html/pull/422 merged
     ]),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/parse.js:23:12
     ]),
     allowedAttributes: {
         ...sanitize.defaults.allowedAttributes,
-        a: ['href', 'name', 'hreflang', 'media', 'rel', 'target', 'type'],
+        a: [],
         img: ['alt', 'height', 'ismap', 'src', 'usemap', 'width', 'srcset'],
         iframe: ['height', 'name', 'src', 'width'],
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/parse.js:24:15
     allowedAttributes: {
         ...sanitize.defaults.allowedAttributes,
         a: ['href', 'name', 'hreflang', 'media', 'rel', 'target', 'type'],
-        img: ['alt', 'height', 'ismap', 'src', 'usemap', 'width', 'srcset'],
+        img: ["", 'height', 'ismap', 'src', 'usemap', 'width', 'srcset'],
         iframe: ['height', 'name', 'src', 'width'],
         video: ['autoplay', 'controls', 'height', 'loop', 'muted', 'poster', 'preload', 'src', 'width'],
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/parse.js:25:17
         ...sanitize.defaults.allowedAttributes,
         a: ['href', 'name', 'hreflang', 'media', 'rel', 'target', 'type'],
         img: ['alt', 'height', 'ismap', 'src', 'usemap', 'width', 'srcset'],
-        iframe: ['height', 'name', 'src', 'width'],
+        iframe: [],
         video: ['autoplay', 'controls', 'height', 'loop', 'muted', 'poster', 'preload', 'src', 'width'],
         audio: ['autoplay', 'controls', 'loop', 'muted', 'preload', 'src'],
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/parse.js:26:89
         a: ['href', 'name', 'hreflang', 'media', 'rel', 'target', 'type'],
         img: ['alt', 'height', 'ismap', 'src', 'usemap', 'width', 'srcset'],
         iframe: ['height', 'name', 'src', 'width'],
-        video: ['autoplay', 'controls', 'height', 'loop', 'muted', 'poster', 'preload', 'src', 'width'],
+        video: ['autoplay', 'controls', 'height', 'loop', 'muted', 'poster', 'preload', "", 'width'],
         audio: ['autoplay', 'controls', 'loop', 'muted', 'preload', 'src'],
         embed: ['height', 'src', 'type', 'width'],
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/parse.js:26:41
         a: ['href', 'name', 'hreflang', 'media', 'rel', 'target', 'type'],
         img: ['alt', 'height', 'ismap', 'src', 'usemap', 'width', 'srcset'],
         iframe: ['height', 'name', 'src', 'width'],
-        video: ['autoplay', 'controls', 'height', 'loop', 'muted', 'poster', 'preload', 'src', 'width'],
+        video: ['autoplay', 'controls', "", 'loop', 'muted', 'poster', 'preload', 'src', 'width'],
         audio: ['autoplay', 'controls', 'loop', 'muted', 'preload', 'src'],
         embed: ['height', 'src', 'type', 'width'],
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-user]]

[Killed] StringLiteral
src/posts/parse.js:27:58
         img: ['alt', 'height', 'ismap', 'src', 'usemap', 'width', 'srcset'],
         iframe: ['height', 'name', 'src', 'width'],
         video: ['autoplay', 'controls', 'height', 'loop', 'muted', 'poster', 'preload', 'src', 'width'],
-        audio: ['autoplay', 'controls', 'loop', 'muted', 'preload', 'src'],
+        audio: ['autoplay', 'controls', 'loop', 'muted', "", 'src'],
         embed: ['height', 'src', 'type', 'width'],
     },
killedBy: POST /ping: response status code should match one of the schema defined responses
statusReason: POST /ping sent back unexpected HTTP status code: 401 {"status":{"code":"not-authorised","message":"A valid login session was not found. Please log in and try again."},"response":{}}

[Killed] ArrayDeclaration
src/posts/parse.js:27:16
         img: ['alt', 'height', 'ismap', 'src', 'usemap', 'width', 'srcset'],
         iframe: ['height', 'name', 'src', 'width'],
         video: ['autoplay', 'controls', 'height', 'loop', 'muted', 'poster', 'preload', 'src', 'width'],
-        audio: ['autoplay', 'controls', 'loop', 'muted', 'preload', 'src'],
+        audio: [],
         embed: ['height', 'src', 'type', 'width'],
     },
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/parse.js:30:46
         audio: ['autoplay', 'controls', 'loop', 'muted', 'preload', 'src'],
         embed: ['height', 'src', 'type', 'width'],
     },
-    globalAttributes: ['accesskey', 'class', 'contenteditable', 'dir',
+    globalAttributes: ['accesskey', 'class', "", 'dir',
         'draggable', 'dropzone', 'hidden', 'id', 'lang', 'spellcheck', 'style',
         'tabindex', 'title', 'translate', 'aria-expanded', 'data-*',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/parse.js:30:37
         audio: ['autoplay', 'controls', 'loop', 'muted', 'preload', 'src'],
         embed: ['height', 'src', 'type', 'width'],
     },
-    globalAttributes: ['accesskey', 'class', 'contenteditable', 'dir',
+    globalAttributes: ['accesskey', "", 'contenteditable', 'dir',
         'draggable', 'dropzone', 'hidden', 'id', 'lang', 'spellcheck', 'style',
         'tabindex', 'title', 'translate', 'aria-expanded', 'data-*',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/parse.js:31:9
         embed: ['height', 'src', 'type', 'width'],
     },
     globalAttributes: ['accesskey', 'class', 'contenteditable', 'dir',
-        'draggable', 'dropzone', 'hidden', 'id', 'lang', 'spellcheck', 'style',
+        "", 'dropzone', 'hidden', 'id', 'lang', 'spellcheck', 'style',
         'tabindex', 'title', 'translate', 'aria-expanded', 'data-*',
     ],
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/parse.js:31:44
         embed: ['height', 'src', 'type', 'width'],
     },
     globalAttributes: ['accesskey', 'class', 'contenteditable', 'dir',
-        'draggable', 'dropzone', 'hidden', 'id', 'lang', 'spellcheck', 'style',
+        'draggable', 'dropzone', 'hidden', "", 'lang', 'spellcheck', 'style',
         'tabindex', 'title', 'translate', 'aria-expanded', 'data-*',
     ],
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/parse.js:32:9
     },
     globalAttributes: ['accesskey', 'class', 'contenteditable', 'dir',
         'draggable', 'dropzone', 'hidden', 'id', 'lang', 'spellcheck', 'style',
-        'tabindex', 'title', 'translate', 'aria-expanded', 'data-*',
+        "", 'title', 'translate', 'aria-expanded', 'data-*',
     ],
     allowedClasses: {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/parse.js:32:60
     },
     globalAttributes: ['accesskey', 'class', 'contenteditable', 'dir',
         'draggable', 'dropzone', 'hidden', 'id', 'lang', 'spellcheck', 'style',
-        'tabindex', 'title', 'translate', 'aria-expanded', 'data-*',
+        'tabindex', 'title', 'translate', 'aria-expanded', "",
     ],
     allowedClasses: {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/parse.js:34:21
         'draggable', 'dropzone', 'hidden', 'id', 'lang', 'spellcheck', 'style',
         'tabindex', 'title', 'translate', 'aria-expanded', 'data-*',
     ],
-    allowedClasses: {
-        ...sanitize.defaults.allowedClasses,
-    },
+    allowedClasses: {},
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] Regex
src/posts/parse.js:41:16
 
 module.exports = function (Posts) {
     Posts.urlRegex = {
-        regex: /href="([^"]+)"/g,
+        regex: /href="([^"])"/g,
         length: 6,
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/parse.js:45:22
         length: 6,
     };
 
-    Posts.imgRegex = {
-        regex: /src="([^"]+)"/g,
-        length: 5,
-    };
+    Posts.imgRegex = {};
 
     Posts.parsePost = async function (postData) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:50:49
         length: 5,
     };
 
-    Posts.parsePost = async function (postData) {
-        if (!postData) {
-            return postData;
-        }
-        postData.content = String(postData.content || '');
-        const cache = require('./cache');
-        const pid = String(postData.pid);
-        const cachedContent = cache.get(pid);
-        if (postData.pid && cachedContent !== undefined) {
-            postData.content = cachedContent;
-            return postData;
-        }
-
-        const data = await plugins.hooks.fire('filter:parse.post', { postData: postData });
-        data.postData.content = translator.escape(data.postData.content);
-        if (data.postData.pid) {
-            cache.set(pid, data.postData.content);
-        }
-        return data.postData;
-    };
+    Posts.parsePost = async function (postData) {};
 
     Posts.parseSignature = async function (userData, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/parse.js:51:13
     };
 
     Posts.parsePost = async function (postData) {
-        if (!postData) {
+        if (true) {
             return postData;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:51:24
     };
 
     Posts.parsePost = async function (postData) {
-        if (!postData) {
-            return postData;
-        }
+        if (!postData) {}
         postData.content = String(postData.content || '');
         const cache = require('./cache');
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/parse.js:54:35
         if (!postData) {
             return postData;
         }
-        postData.content = String(postData.content || '');
+        postData.content = String(postData.content && '');
         const cache = require('./cache');
         const pid = String(postData.pid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/parse.js:54:35
         if (!postData) {
             return postData;
         }
-        postData.content = String(postData.content || '');
+        postData.content = String(false);
         const cache = require('./cache');
         const pid = String(postData.pid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/parse.js:58:29
         const cache = require('./cache');
         const pid = String(postData.pid);
         const cachedContent = cache.get(pid);
-        if (postData.pid && cachedContent !== undefined) {
+        if (postData.pid && true) {
             postData.content = cachedContent;
             return postData;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/parse.js:58:13
         const cache = require('./cache');
         const pid = String(postData.pid);
         const cachedContent = cache.get(pid);
-        if (postData.pid && cachedContent !== undefined) {
+        if (postData.pid || cachedContent !== undefined) {
             postData.content = cachedContent;
             return postData;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:65:32
 
         const data = await plugins.hooks.fire('filter:parse.post', { postData: postData });
         data.postData.content = translator.escape(data.postData.content);
-        if (data.postData.pid) {
-            cache.set(pid, data.postData.content);
-        }
+        if (data.postData.pid) {}
         return data.postData;
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/parse.js:65:13
 
         const data = await plugins.hooks.fire('filter:parse.post', { postData: postData });
         data.postData.content = translator.escape(data.postData.content);
-        if (data.postData.pid) {
+        if (false) {
             cache.set(pid, data.postData.content);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:71:59
         return data.postData;
     };
 
-    Posts.parseSignature = async function (userData, uid) {
-        userData.signature = sanitizeSignature(userData.signature || '');
-        return await plugins.hooks.fire('filter:parse.signature', { userData: userData, uid: uid });
-    };
+    Posts.parseSignature = async function (userData, uid) {};
 
     Posts.relativeToAbsolute = function (content, regex) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/parse.js:72:48
     };
 
     Posts.parseSignature = async function (userData, uid) {
-        userData.signature = sanitizeSignature(userData.signature || '');
+        userData.signature = sanitizeSignature(userData.signature && '');
         return await plugins.hooks.fire('filter:parse.signature', { userData: userData, uid: uid });
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/parse.js:72:48
     };
 
     Posts.parseSignature = async function (userData, uid) {
-        userData.signature = sanitizeSignature(userData.signature || '');
+        userData.signature = sanitizeSignature(true);
         return await plugins.hooks.fire('filter:parse.signature', { userData: userData, uid: uid });
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/parse.js:73:67
 
     Posts.parseSignature = async function (userData, uid) {
         userData.signature = sanitizeSignature(userData.signature || '');
-        return await plugins.hooks.fire('filter:parse.signature', { userData: userData, uid: uid });
+        return await plugins.hooks.fire('filter:parse.signature', {});
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/parse.js:78:13
 
     Posts.relativeToAbsolute = function (content, regex) {
         // Turns relative links in content to absolute urls
-        if (!content) {
+        if (content) {
             return content;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/parse.js:78:13
 
     Posts.relativeToAbsolute = function (content, regex) {
         // Turns relative links in content to absolute urls
-        if (!content) {
+        if (false) {
             return content;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/parse.js:84:16
         let parsed;
         let current = regex.regex.exec(content);
         let absolute;
-        while (current !== null) {
+        while (false) {
             if (current[1]) {
                 try {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:84:34
         let parsed;
         let current = regex.regex.exec(content);
         let absolute;
-        while (current !== null) {
-            if (current[1]) {
-                try {
-                    parsed = url.parse(current[1]);
-                    if (!parsed.protocol) {
-                        if (current[1].startsWith('/')) {
-                            // Internal link
-                            absolute = nconf.get('base_url') + current[1];
-                        } else {
-                            // External link
-                            absolute = `//${current[1]}`;
-                        }
-
-                        content = content.slice(0, current.index + regex.length) +
-                        absolute +
-                        content.slice(current.index + regex.length + current[1].length);
-                    }
-                } catch (err) {
-                    winston.verbose(err.messsage);
-                }
-            }
-            current = regex.regex.exec(content);
-        }
+        while (current !== null) {}
 
         return content;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/parse.js:85:17
         let current = regex.regex.exec(content);
         let absolute;
         while (current !== null) {
-            if (current[1]) {
+            if (false) {
                 try {
                     parsed = url.parse(current[1]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/parse.js:85:17
         let current = regex.regex.exec(content);
         let absolute;
         while (current !== null) {
-            if (current[1]) {
+            if (true) {
                 try {
                     parsed = url.parse(current[1]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:86:21
         let absolute;
         while (current !== null) {
             if (current[1]) {
-                try {
-                    parsed = url.parse(current[1]);
-                    if (!parsed.protocol) {
-                        if (current[1].startsWith('/')) {
-                            // Internal link
-                            absolute = nconf.get('base_url') + current[1];
-                        } else {
-                            // External link
-                            absolute = `//${current[1]}`;
-                        }
-
-                        content = content.slice(0, current.index + regex.length) +
-                        absolute +
-                        content.slice(current.index + regex.length + current[1].length);
-                    }
-                } catch (err) {
+                try {} catch (err) {
                     winston.verbose(err.messsage);
                 }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/parse.js:88:25
             if (current[1]) {
                 try {
                     parsed = url.parse(current[1]);
-                    if (!parsed.protocol) {
+                    if (false) {
                         if (current[1].startsWith('/')) {
                             // Internal link
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] BooleanLiteral
src/posts/parse.js:88:25
             if (current[1]) {
                 try {
                     parsed = url.parse(current[1]);
-                    if (!parsed.protocol) {
+                    if (parsed.protocol) {
                         if (current[1].startsWith('/')) {
                             // Internal link
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:89:57
                 try {
                     parsed = url.parse(current[1]);
                     if (!parsed.protocol) {
-                        if (current[1].startsWith('/')) {
-                            // Internal link
-                            absolute = nconf.get('base_url') + current[1];
-                        } else {
+                        if (current[1].startsWith('/')) {} else {
                             // External link
                             absolute = `//${current[1]}`;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/parse.js:89:29
                 try {
                     parsed = url.parse(current[1]);
                     if (!parsed.protocol) {
-                        if (current[1].startsWith('/')) {
+                        if (current[1].endsWith('/')) {
                             // Internal link
                             absolute = nconf.get('base_url') + current[1];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/parse.js:91:40
                     if (!parsed.protocol) {
                         if (current[1].startsWith('/')) {
                             // Internal link
-                            absolute = nconf.get('base_url') + current[1];
+                            absolute = nconf.get('base_url') - current[1];
                         } else {
                             // External link
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:92:32
                         if (current[1].startsWith('/')) {
                             // Internal link
                             absolute = nconf.get('base_url') + current[1];
-                        } else {
-                            // External link
-                            absolute = `//${current[1]}`;
-                        }
+                        } else {}
 
                         content = content.slice(0, current.index + regex.length) +
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/parse.js:97:52
                             absolute = `//${current[1]}`;
                         }
 
-                        content = content.slice(0, current.index + regex.length) +
+                        content = content.slice(0, current.index - regex.length) +
                         absolute +
                         content.slice(current.index + regex.length + current[1].length);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/parse.js:97:35
                             absolute = `//${current[1]}`;
                         }
 
-                        content = content.slice(0, current.index + regex.length) +
-                        absolute +
+                        content = content.slice(0, current.index + regex.length) - absolute +
                         content.slice(current.index + regex.length + current[1].length);
                     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/parse.js:99:39
 
                         content = content.slice(0, current.index + regex.length) +
                         absolute +
-                        content.slice(current.index + regex.length + current[1].length);
+                        content.slice(current.index + regex.length - current[1].length);
                     }
                 } catch (err) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/parse.js:99:25
 
                         content = content.slice(0, current.index + regex.length) +
                         absolute +
-                        content.slice(current.index + regex.length + current[1].length);
+                        content;
                     }
                 } catch (err) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:101:31
                         absolute +
                         content.slice(current.index + regex.length + current[1].length);
                     }
-                } catch (err) {
-                    winston.verbose(err.messsage);
-                }
+                } catch (err) {}
             }
             current = regex.regex.exec(content);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:111:41
         return content;
     };
 
-    Posts.sanitize = function (content) {
-        return sanitize(content, {
-            allowedTags: sanitizeConfig.allowedTags,
-            allowedAttributes: sanitizeConfig.allowedAttributes,
-            allowedClasses: sanitizeConfig.allowedClasses,
-        });
-    };
+    Posts.sanitize = function (content) {};
 
     Posts.configureSanitize = async () => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:119:43
         });
     };
 
-    Posts.configureSanitize = async () => {
-        // Each allowed tags should have some common global attributes...
-        sanitizeConfig.allowedTags.forEach((tag) => {
-            sanitizeConfig.allowedAttributes[tag] = _.union(
-                sanitizeConfig.allowedAttributes[tag],
-                sanitizeConfig.globalAttributes
-            );
-        });
-
-        // Some plugins might need to adjust or whitelist their own tags...
-        sanitizeConfig = await plugins.hooks.fire('filter:sanitize.config', sanitizeConfig);
-    };
+    Posts.configureSanitize = async () => {};
 
     Posts.registerHooks = () => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:121:53
 
     Posts.configureSanitize = async () => {
         // Each allowed tags should have some common global attributes...
-        sanitizeConfig.allowedTags.forEach((tag) => {
-            sanitizeConfig.allowedAttributes[tag] = _.union(
-                sanitizeConfig.allowedAttributes[tag],
-                sanitizeConfig.globalAttributes
-            );
-        });
+        sanitizeConfig.allowedTags.forEach((tag) => {});
 
         // Some plugins might need to adjust or whitelist their own tags...
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
