[Killed] BlockStatement
src/posts/votes.js:15:46
 module.exports = function (Posts) {
     const votesInProgress = {};
 
-    Posts.upvote = async function (pid, uid) {
-        if (meta.config['reputation:disabled']) {
-            throw new Error('[[error:reputation-system-disabled]]');
-        }
-        const canUpvote = await privileges.posts.can('posts:upvote', pid, uid);
-        if (!canUpvote) {
-            throw new Error('[[error:no-privileges]]');
-        }
-
-        if (voteInProgress(pid, uid)) {
-            throw new Error('[[error:already-voting-for-this-post]]');
-        }
-        putVoteInProgress(pid, uid);
-
-        try {
-            return await toggleVote('upvote', pid, uid);
-        } finally {
-            clearVoteProgress(pid, uid);
-        }
-    };
+    Posts.upvote = async function (pid, uid) {};
 
     Posts.downvote = async function (pid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:16:13
     const votesInProgress = {};
 
     Posts.upvote = async function (pid, uid) {
-        if (meta.config['reputation:disabled']) {
+        if (false) {
             throw new Error('[[error:reputation-system-disabled]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:16:49
     const votesInProgress = {};
 
     Posts.upvote = async function (pid, uid) {
-        if (meta.config['reputation:disabled']) {
-            throw new Error('[[error:reputation-system-disabled]]');
-        }
+        if (meta.config['reputation:disabled']) {}
         const canUpvote = await privileges.posts.can('posts:upvote', pid, uid);
         if (!canUpvote) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:17:29
 
     Posts.upvote = async function (pid, uid) {
         if (meta.config['reputation:disabled']) {
-            throw new Error('[[error:reputation-system-disabled]]');
+            throw new Error("");
         }
         const canUpvote = await privileges.posts.can('posts:upvote', pid, uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/votes.js:20:13
             throw new Error('[[error:reputation-system-disabled]]');
         }
         const canUpvote = await privileges.posts.can('posts:upvote', pid, uid);
-        if (!canUpvote) {
+        if (canUpvote) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:20:25
             throw new Error('[[error:reputation-system-disabled]]');
         }
         const canUpvote = await privileges.posts.can('posts:upvote', pid, uid);
-        if (!canUpvote) {
-            throw new Error('[[error:no-privileges]]');
-        }
+        if (!canUpvote) {}
 
         if (voteInProgress(pid, uid)) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:24:13
             throw new Error('[[error:no-privileges]]');
         }
 
-        if (voteInProgress(pid, uid)) {
+        if (true) {
             throw new Error('[[error:already-voting-for-this-post]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:24:13
             throw new Error('[[error:no-privileges]]');
         }
 
-        if (voteInProgress(pid, uid)) {
+        if (false) {
             throw new Error('[[error:already-voting-for-this-post]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:29:13
         }
         putVoteInProgress(pid, uid);
 
-        try {
-            return await toggleVote('upvote', pid, uid);
-        } finally {
+        try {} finally {
             clearVoteProgress(pid, uid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:31:19
 
         try {
             return await toggleVote('upvote', pid, uid);
-        } finally {
-            clearVoteProgress(pid, uid);
-        }
+        } finally {}
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:36:48
         }
     };
 
-    Posts.downvote = async function (pid, uid) {
-        if (meta.config['reputation:disabled']) {
-            throw new Error('[[error:reputation-system-disabled]]');
-        }
-
-        if (meta.config['downvote:disabled']) {
-            throw new Error('[[error:downvoting-disabled]]');
-        }
-        const canDownvote = await privileges.posts.can('posts:downvote', pid, uid);
-        if (!canDownvote) {
-            throw new Error('[[error:no-privileges]]');
-        }
-
-        if (voteInProgress(pid, uid)) {
-            throw new Error('[[error:already-voting-for-this-post]]');
-        }
-
-        putVoteInProgress(pid, uid);
-        try {
-            return await toggleVote('downvote', pid, uid);
-        } finally {
-            clearVoteProgress(pid, uid);
-        }
-    };
+    Posts.downvote = async function (pid, uid) {};
 
     Posts.unvote = async function (pid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:37:13
     };
 
     Posts.downvote = async function (pid, uid) {
-        if (meta.config['reputation:disabled']) {
+        if (false) {
             throw new Error('[[error:reputation-system-disabled]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:37:49
     };
 
     Posts.downvote = async function (pid, uid) {
-        if (meta.config['reputation:disabled']) {
-            throw new Error('[[error:reputation-system-disabled]]');
-        }
+        if (meta.config['reputation:disabled']) {}
 
         if (meta.config['downvote:disabled']) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:41:13
             throw new Error('[[error:reputation-system-disabled]]');
         }
 
-        if (meta.config['downvote:disabled']) {
+        if (true) {
             throw new Error('[[error:downvoting-disabled]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:41:13
             throw new Error('[[error:reputation-system-disabled]]');
         }
 
-        if (meta.config['downvote:disabled']) {
+        if (false) {
             throw new Error('[[error:downvoting-disabled]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:42:29
         }
 
         if (meta.config['downvote:disabled']) {
-            throw new Error('[[error:downvoting-disabled]]');
+            throw new Error("");
         }
         const canDownvote = await privileges.posts.can('posts:downvote', pid, uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:44:56
         if (meta.config['downvote:disabled']) {
             throw new Error('[[error:downvoting-disabled]]');
         }
-        const canDownvote = await privileges.posts.can('posts:downvote', pid, uid);
+        const canDownvote = await privileges.posts.can("", pid, uid);
         if (!canDownvote) {
             throw new Error('[[error:no-privileges]]');
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:45:13
             throw new Error('[[error:downvoting-disabled]]');
         }
         const canDownvote = await privileges.posts.can('posts:downvote', pid, uid);
-        if (!canDownvote) {
+        if (false) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:45:13
             throw new Error('[[error:downvoting-disabled]]');
         }
         const canDownvote = await privileges.posts.can('posts:downvote', pid, uid);
-        if (!canDownvote) {
+        if (true) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:49:39
             throw new Error('[[error:no-privileges]]');
         }
 
-        if (voteInProgress(pid, uid)) {
-            throw new Error('[[error:already-voting-for-this-post]]');
-        }
+        if (voteInProgress(pid, uid)) {}
 
         putVoteInProgress(pid, uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:50:29
         }
 
         if (voteInProgress(pid, uid)) {
-            throw new Error('[[error:already-voting-for-this-post]]');
+            throw new Error("");
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:54:13
         }
 
         putVoteInProgress(pid, uid);
-        try {
-            return await toggleVote('downvote', pid, uid);
-        } finally {
+        try {} finally {
             clearVoteProgress(pid, uid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:55:37
 
         putVoteInProgress(pid, uid);
         try {
-            return await toggleVote('downvote', pid, uid);
+            return await toggleVote("", pid, uid);
         } finally {
             clearVoteProgress(pid, uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:56:19
         putVoteInProgress(pid, uid);
         try {
             return await toggleVote('downvote', pid, uid);
-        } finally {
-            clearVoteProgress(pid, uid);
-        }
+        } finally {}
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:61:46
         }
     };
 
-    Posts.unvote = async function (pid, uid) {
-        if (voteInProgress(pid, uid)) {
-            throw new Error('[[error:already-voting-for-this-post]]');
-        }
-
-        putVoteInProgress(pid, uid);
-        try {
-            const voteStatus = await Posts.hasVoted(pid, uid);
-            return await unvote(pid, uid, 'unvote', voteStatus);
-        } finally {
-            clearVoteProgress(pid, uid);
-        }
-    };
+    Posts.unvote = async function (pid, uid) {};
 
     Posts.hasVoted = async function (pid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:62:13
     };
 
     Posts.unvote = async function (pid, uid) {
-        if (voteInProgress(pid, uid)) {
+        if (true) {
             throw new Error('[[error:already-voting-for-this-post]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:62:13
     };
 
     Posts.unvote = async function (pid, uid) {
-        if (voteInProgress(pid, uid)) {
+        if (false) {
             throw new Error('[[error:already-voting-for-this-post]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:67:13
         }
 
         putVoteInProgress(pid, uid);
-        try {
-            const voteStatus = await Posts.hasVoted(pid, uid);
-            return await unvote(pid, uid, 'unvote', voteStatus);
-        } finally {
+        try {} finally {
             clearVoteProgress(pid, uid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:70:19
         try {
             const voteStatus = await Posts.hasVoted(pid, uid);
             return await unvote(pid, uid, 'unvote', voteStatus);
-        } finally {
-            clearVoteProgress(pid, uid);
-        }
+        } finally {}
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:75:48
         }
     };
 
-    Posts.hasVoted = async function (pid, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return { upvoted: false, downvoted: false };
-        }
-        const hasVoted = await db.isMemberOfSets([`pid:${pid}:upvote`, `pid:${pid}:downvote`], uid);
-        return { upvoted: hasVoted[0], downvoted: hasVoted[1] };
-    };
+    Posts.hasVoted = async function (pid, uid) {};
 
     Posts.getVoteStatusByPostIDs = async function (pids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:76:37
     };
 
     Posts.hasVoted = async function (pid, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return { upvoted: false, downvoted: false };
-        }
+        if (parseInt(uid, 10) <= 0) {}
         const hasVoted = await db.isMemberOfSets([`pid:${pid}:upvote`, `pid:${pid}:downvote`], uid);
         return { upvoted: hasVoted[0], downvoted: hasVoted[1] };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:76:13
     };
 
     Posts.hasVoted = async function (pid, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (false) {
             return { upvoted: false, downvoted: false };
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/votes.js:77:31
 
     Posts.hasVoted = async function (pid, uid) {
         if (parseInt(uid, 10) <= 0) {
-            return { upvoted: false, downvoted: false };
+            return { upvoted: true, downvoted: false };
         }
         const hasVoted = await db.isMemberOfSets([`pid:${pid}:upvote`, `pid:${pid}:downvote`], uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/votes.js:77:49
 
     Posts.hasVoted = async function (pid, uid) {
         if (parseInt(uid, 10) <= 0) {
-            return { upvoted: false, downvoted: false };
+            return { upvoted: false, downvoted: true };
         }
         const hasVoted = await db.isMemberOfSets([`pid:${pid}:upvote`, `pid:${pid}:downvote`], uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:79:51
         if (parseInt(uid, 10) <= 0) {
             return { upvoted: false, downvoted: false };
         }
-        const hasVoted = await db.isMemberOfSets([`pid:${pid}:upvote`, `pid:${pid}:downvote`], uid);
+        const hasVoted = await db.isMemberOfSets([``, `pid:${pid}:downvote`], uid);
         return { upvoted: hasVoted[0], downvoted: hasVoted[1] };
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:83:63
         return { upvoted: hasVoted[0], downvoted: hasVoted[1] };
     };
 
-    Posts.getVoteStatusByPostIDs = async function (pids, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            const data = pids.map(() => false);
-            return { upvotes: data, downvotes: data };
-        }
-        const upvoteSets = pids.map(pid => `pid:${pid}:upvote`);
-        const downvoteSets = pids.map(pid => `pid:${pid}:downvote`);
-        const data = await db.isMemberOfSets(upvoteSets.concat(downvoteSets), uid);
-        return {
-            upvotes: data.slice(0, pids.length),
-            downvotes: data.slice(pids.length, pids.length * 2),
-        };
-    };
+    Posts.getVoteStatusByPostIDs = async function (pids, uid) {};
 
     Posts.getUpvotedUidsByPids = async function (pids) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/votes.js:84:13
     };
 
     Posts.getVoteStatusByPostIDs = async function (pids, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (parseInt(uid, 10) < 0) {
             const data = pids.map(() => false);
             return { upvotes: data, downvotes: data };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:84:37
     };
 
     Posts.getVoteStatusByPostIDs = async function (pids, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            const data = pids.map(() => false);
-            return { upvotes: data, downvotes: data };
-        }
+        if (parseInt(uid, 10) <= 0) {}
         const upvoteSets = pids.map(pid => `pid:${pid}:upvote`);
         const downvoteSets = pids.map(pid => `pid:${pid}:downvote`);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/votes.js:85:35
 
     Posts.getVoteStatusByPostIDs = async function (pids, uid) {
         if (parseInt(uid, 10) <= 0) {
-            const data = pids.map(() => false);
+            const data = pids.map(() => undefined);
             return { upvotes: data, downvotes: data };
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/votes.js:85:41
 
     Posts.getVoteStatusByPostIDs = async function (pids, uid) {
         if (parseInt(uid, 10) <= 0) {
-            const data = pids.map(() => false);
+            const data = pids.map(() => true);
             return { upvotes: data, downvotes: data };
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/votes.js:86:20
     Posts.getVoteStatusByPostIDs = async function (pids, uid) {
         if (parseInt(uid, 10) <= 0) {
             const data = pids.map(() => false);
-            return { upvotes: data, downvotes: data };
+            return {};
         }
         const upvoteSets = pids.map(pid => `pid:${pid}:upvote`);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/votes.js:88:37
             const data = pids.map(() => false);
             return { upvotes: data, downvotes: data };
         }
-        const upvoteSets = pids.map(pid => `pid:${pid}:upvote`);
+        const upvoteSets = pids.map(() => undefined);
         const downvoteSets = pids.map(pid => `pid:${pid}:downvote`);
         const data = await db.isMemberOfSets(upvoteSets.concat(downvoteSets), uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:88:44
             const data = pids.map(() => false);
             return { upvotes: data, downvotes: data };
         }
-        const upvoteSets = pids.map(pid => `pid:${pid}:upvote`);
+        const upvoteSets = pids.map(pid => ``);
         const downvoteSets = pids.map(pid => `pid:${pid}:downvote`);
         const data = await db.isMemberOfSets(upvoteSets.concat(downvoteSets), uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/votes.js:89:39
             return { upvotes: data, downvotes: data };
         }
         const upvoteSets = pids.map(pid => `pid:${pid}:upvote`);
-        const downvoteSets = pids.map(pid => `pid:${pid}:downvote`);
+        const downvoteSets = pids.map(() => undefined);
         const data = await db.isMemberOfSets(upvoteSets.concat(downvoteSets), uid);
         return {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/votes.js:91:16
         const upvoteSets = pids.map(pid => `pid:${pid}:upvote`);
         const downvoteSets = pids.map(pid => `pid:${pid}:downvote`);
         const data = await db.isMemberOfSets(upvoteSets.concat(downvoteSets), uid);
-        return {
-            upvotes: data.slice(0, pids.length),
-            downvotes: data.slice(pids.length, pids.length * 2),
-        };
+        return {};
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/votes.js:92:22
         const downvoteSets = pids.map(pid => `pid:${pid}:downvote`);
         const data = await db.isMemberOfSets(upvoteSets.concat(downvoteSets), uid);
         return {
-            upvotes: data.slice(0, pids.length),
+            upvotes: data,
             downvotes: data.slice(pids.length, pids.length * 2),
         };
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-privileges]]

[Killed] MethodExpression
src/posts/votes.js:93:24
         const data = await db.isMemberOfSets(upvoteSets.concat(downvoteSets), uid);
         return {
             upvotes: data.slice(0, pids.length),
-            downvotes: data.slice(pids.length, pids.length * 2),
+            downvotes: data,
         };
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/votes.js:93:48
         const data = await db.isMemberOfSets(upvoteSets.concat(downvoteSets), uid);
         return {
             upvotes: data.slice(0, pids.length),
-            downvotes: data.slice(pids.length, pids.length * 2),
+            downvotes: data.slice(pids.length, pids.length / 2),
         };
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:97:56
         };
     };
 
-    Posts.getUpvotedUidsByPids = async function (pids) {
-        return await db.getSetsMembers(pids.map(pid => `pid:${pid}:upvote`));
-    };
+    Posts.getUpvotedUidsByPids = async function (pids) {};
 
     function voteInProgress(pid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/votes.js:98:49
     };
 
     Posts.getUpvotedUidsByPids = async function (pids) {
-        return await db.getSetsMembers(pids.map(pid => `pid:${pid}:upvote`));
+        return await db.getSetsMembers(pids.map(() => undefined));
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:101:39
         return await db.getSetsMembers(pids.map(pid => `pid:${pid}:upvote`));
     };
 
-    function voteInProgress(pid, uid) {
-        return Array.isArray(votesInProgress[uid]) && votesInProgress[uid].includes(parseInt(pid, 10));
-    }
+    function voteInProgress(pid, uid) {}
 
     function putVoteInProgress(pid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/votes.js:102:16
     };
 
     function voteInProgress(pid, uid) {
-        return Array.isArray(votesInProgress[uid]) && votesInProgress[uid].includes(parseInt(pid, 10));
+        return Array.isArray(votesInProgress[uid]) || votesInProgress[uid].includes(parseInt(pid, 10));
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:102:16
     };
 
     function voteInProgress(pid, uid) {
-        return Array.isArray(votesInProgress[uid]) && votesInProgress[uid].includes(parseInt(pid, 10));
+        return false;
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:105:42
         return Array.isArray(votesInProgress[uid]) && votesInProgress[uid].includes(parseInt(pid, 10));
     }
 
-    function putVoteInProgress(pid, uid) {
-        votesInProgress[uid] = votesInProgress[uid] || [];
-        votesInProgress[uid].push(parseInt(pid, 10));
-    }
+    function putVoteInProgress(pid, uid) {}
 
     function clearVoteProgress(pid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:106:32
     }
 
     function putVoteInProgress(pid, uid) {
-        votesInProgress[uid] = votesInProgress[uid] || [];
+        votesInProgress[uid] = false;
         votesInProgress[uid].push(parseInt(pid, 10));
     }
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-user]]

[Killed] LogicalOperator
src/posts/votes.js:106:32
     }
 
     function putVoteInProgress(pid, uid) {
-        votesInProgress[uid] = votesInProgress[uid] || [];
+        votesInProgress[uid] = votesInProgress[uid] && [];
         votesInProgress[uid].push(parseInt(pid, 10));
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:110:42
         votesInProgress[uid].push(parseInt(pid, 10));
     }
 
-    function clearVoteProgress(pid, uid) {
-        if (Array.isArray(votesInProgress[uid])) {
-            const index = votesInProgress[uid].indexOf(parseInt(pid, 10));
-            if (index !== -1) {
-                votesInProgress[uid].splice(index, 1);
-            }
-        }
-    }
+    function clearVoteProgress(pid, uid) {}
 
     async function toggleVote(type, pid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:111:13
     }
 
     function clearVoteProgress(pid, uid) {
-        if (Array.isArray(votesInProgress[uid])) {
+        if (false) {
             const index = votesInProgress[uid].indexOf(parseInt(pid, 10));
             if (index !== -1) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:111:50
     }
 
     function clearVoteProgress(pid, uid) {
-        if (Array.isArray(votesInProgress[uid])) {
-            const index = votesInProgress[uid].indexOf(parseInt(pid, 10));
-            if (index !== -1) {
-                votesInProgress[uid].splice(index, 1);
-            }
-        }
+        if (Array.isArray(votesInProgress[uid])) {}
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:113:17
     function clearVoteProgress(pid, uid) {
         if (Array.isArray(votesInProgress[uid])) {
             const index = votesInProgress[uid].indexOf(parseInt(pid, 10));
-            if (index !== -1) {
+            if (false) {
                 votesInProgress[uid].splice(index, 1);
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
