[Killed] EqualityOperator
src/posts/votes.js:113:17
     function clearVoteProgress(pid, uid) {
         if (Array.isArray(votesInProgress[uid])) {
             const index = votesInProgress[uid].indexOf(parseInt(pid, 10));
-            if (index !== -1) {
+            if (index === -1) {
                 votesInProgress[uid].splice(index, 1);
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:119:47
         }
     }
 
-    async function toggleVote(type, pid, uid) {
-        const voteStatus = await Posts.hasVoted(pid, uid);
-        await unvote(pid, uid, type, voteStatus);
-        return await vote(type, false, pid, uid, voteStatus);
-    }
+    async function toggleVote(type, pid, uid) {}
 
     async function unvote(pid, uid, type, voteStatus) {
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-user]]

[Killed] BooleanLiteral
src/posts/votes.js:122:33
     async function toggleVote(type, pid, uid) {
         const voteStatus = await Posts.hasVoted(pid, uid);
         await unvote(pid, uid, type, voteStatus);
-        return await vote(type, false, pid, uid, voteStatus);
+        return await vote(type, true, pid, uid, voteStatus);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:125:55
         return await vote(type, false, pid, uid, voteStatus);
     }
 
-    async function unvote(pid, uid, type, voteStatus) {
-        const owner = await Posts.getPostField(pid, 'uid');
-        if (parseInt(uid, 10) === parseInt(owner, 10)) {
-            throw new Error('[[error:self-vote]]');
-        }
-
-        if (type === 'downvote' || type === 'upvote') {
-            await checkVoteLimitation(pid, uid, type);
-        }
-
-        if (!voteStatus || (!voteStatus.upvoted && !voteStatus.downvoted)) {
-            return;
-        }
-
-        return await vote(voteStatus.upvoted ? 'downvote' : 'upvote', true, pid, uid, voteStatus);
-    }
+    async function unvote(pid, uid, type, voteStatus) {}
 
     async function checkVoteLimitation(pid, uid, type) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:127:56
 
     async function unvote(pid, uid, type, voteStatus) {
         const owner = await Posts.getPostField(pid, 'uid');
-        if (parseInt(uid, 10) === parseInt(owner, 10)) {
-            throw new Error('[[error:self-vote]]');
-        }
+        if (parseInt(uid, 10) === parseInt(owner, 10)) {}
 
         if (type === 'downvote' || type === 'upvote') {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/votes.js:127:13
 
     async function unvote(pid, uid, type, voteStatus) {
         const owner = await Posts.getPostField(pid, 'uid');
-        if (parseInt(uid, 10) === parseInt(owner, 10)) {
+        if (parseInt(uid, 10) !== parseInt(owner, 10)) {
             throw new Error('[[error:self-vote]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:131:36
             throw new Error('[[error:self-vote]]');
         }
 
-        if (type === 'downvote' || type === 'upvote') {
+        if (type === 'downvote' || false) {
             await checkVoteLimitation(pid, uid, type);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:131:55
             throw new Error('[[error:self-vote]]');
         }
 
-        if (type === 'downvote' || type === 'upvote') {
-            await checkVoteLimitation(pid, uid, type);
-        }
+        if (type === 'downvote' || type === 'upvote') {}
 
         if (!voteStatus || (!voteStatus.upvoted && !voteStatus.downvoted)) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:135:13
             await checkVoteLimitation(pid, uid, type);
         }
 
-        if (!voteStatus || (!voteStatus.upvoted && !voteStatus.downvoted)) {
+        if (true) {
             return;
         }
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-category]]

[Killed] BlockStatement
src/posts/votes.js:135:76
             await checkVoteLimitation(pid, uid, type);
         }
 
-        if (!voteStatus || (!voteStatus.upvoted && !voteStatus.downvoted)) {
-            return;
-        }
+        if (!voteStatus || (!voteStatus.upvoted && !voteStatus.downvoted)) {}
 
         return await vote(voteStatus.upvoted ? 'downvote' : 'upvote', true, pid, uid, voteStatus);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/votes.js:139:71
             return;
         }
 
-        return await vote(voteStatus.upvoted ? 'downvote' : 'upvote', true, pid, uid, voteStatus);
+        return await vote(voteStatus.upvoted ? 'downvote' : 'upvote', false, pid, uid, voteStatus);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:139:48
             return;
         }
 
-        return await vote(voteStatus.upvoted ? 'downvote' : 'upvote', true, pid, uid, voteStatus);
+        return await vote(voteStatus.upvoted ? "" : 'upvote', true, pid, uid, voteStatus);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:146:36
         // type = 'upvote' or 'downvote'
         const oneDay = 86400000;
         const [reputation, targetUid, votedPidsToday] = await Promise.all([
-            user.getUserField(uid, 'reputation'),
+            user.getUserField(uid, ""),
             Posts.getPostField(pid, 'uid'),
             db.getSortedSetRevRangeByScore(
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/votes.js:149:54
             user.getUserField(uid, 'reputation'),
             Posts.getPostField(pid, 'uid'),
             db.getSortedSetRevRangeByScore(
-                `uid:${uid}:${type}`, 0, -1, '+inf', Date.now() - oneDay
+                `uid:${uid}:${type}`, 0, -1, '+inf', Date.now() + oneDay
             ),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] UnaryOperator
src/posts/votes.js:149:42
             user.getUserField(uid, 'reputation'),
             Posts.getPostField(pid, 'uid'),
             db.getSortedSetRevRangeByScore(
-                `uid:${uid}:${type}`, 0, -1, '+inf', Date.now() - oneDay
+                `uid:${uid}:${type}`, 0, +1, '+inf', Date.now() - oneDay
             ),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:153:13
             ),
         ]);
 
-        if (reputation < meta.config[`min:rep:${type}`]) {
+        if (false) {
             throw new Error(`[[error:not-enough-reputation-to-${type}, ${meta.config[`min:rep:${type}`]}]]`);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/votes.js:153:13
             ),
         ]);
 
-        if (reputation < meta.config[`min:rep:${type}`]) {
+        if (reputation >= meta.config[`min:rep:${type}`]) {
             throw new Error(`[[error:not-enough-reputation-to-${type}, ${meta.config[`min:rep:${type}`]}]]`);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:154:86
         ]);
 
         if (reputation < meta.config[`min:rep:${type}`]) {
-            throw new Error(`[[error:not-enough-reputation-to-${type}, ${meta.config[`min:rep:${type}`]}]]`);
+            throw new Error(`[[error:not-enough-reputation-to-${type}, ${meta.config[``]}]]`);
         }
         const votesToday = meta.config[`${type}sPerDay`];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:157:13
             throw new Error(`[[error:not-enough-reputation-to-${type}, ${meta.config[`min:rep:${type}`]}]]`);
         }
         const votesToday = meta.config[`${type}sPerDay`];
-        if (votesToday && votedPidsToday.length >= votesToday) {
+        if (true) {
             throw new Error(`[[error:too-many-${type}s-today, ${votesToday}]]`);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/votes.js:157:27
             throw new Error(`[[error:not-enough-reputation-to-${type}, ${meta.config[`min:rep:${type}`]}]]`);
         }
         const votesToday = meta.config[`${type}sPerDay`];
-        if (votesToday && votedPidsToday.length >= votesToday) {
+        if (votesToday && votedPidsToday.length < votesToday) {
             throw new Error(`[[error:too-many-${type}s-today, ${votesToday}]]`);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:161:32
             throw new Error(`[[error:too-many-${type}s-today, ${votesToday}]]`);
         }
         const voterPerUserToday = meta.config[`${type}sPerUserPerDay`];
-        if (voterPerUserToday) {
-            const postData = await Posts.getPostsFields(votedPidsToday, ['uid']);
-            const targetUpVotes = postData.filter(p => p.uid === targetUid).length;
-            if (targetUpVotes >= voterPerUserToday) {
-                throw new Error(`[[error:too-many-${type}s-today-user, ${voterPerUserToday}]]`);
-            }
-        }
+        if (voterPerUserToday) {}
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:161:13
             throw new Error(`[[error:too-many-${type}s-today, ${votesToday}]]`);
         }
         const voterPerUserToday = meta.config[`${type}sPerUserPerDay`];
-        if (voterPerUserToday) {
+        if (true) {
             const postData = await Posts.getPostsFields(votedPidsToday, ['uid']);
             const targetUpVotes = postData.filter(p => p.uid === targetUid).length;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/votes.js:162:73
         }
         const voterPerUserToday = meta.config[`${type}sPerUserPerDay`];
         if (voterPerUserToday) {
-            const postData = await Posts.getPostsFields(votedPidsToday, ['uid']);
+            const postData = await Posts.getPostsFields(votedPidsToday, []);
             const targetUpVotes = postData.filter(p => p.uid === targetUid).length;
             if (targetUpVotes >= voterPerUserToday) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:162:74
         }
         const voterPerUserToday = meta.config[`${type}sPerUserPerDay`];
         if (voterPerUserToday) {
-            const postData = await Posts.getPostsFields(votedPidsToday, ['uid']);
+            const postData = await Posts.getPostsFields(votedPidsToday, [""]);
             const targetUpVotes = postData.filter(p => p.uid === targetUid).length;
             if (targetUpVotes >= voterPerUserToday) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:163:56
         const voterPerUserToday = meta.config[`${type}sPerUserPerDay`];
         if (voterPerUserToday) {
             const postData = await Posts.getPostsFields(votedPidsToday, ['uid']);
-            const targetUpVotes = postData.filter(p => p.uid === targetUid).length;
+            const targetUpVotes = postData.filter(p => false).length;
             if (targetUpVotes >= voterPerUserToday) {
                 throw new Error(`[[error:too-many-${type}s-today-user, ${voterPerUserToday}]]`);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:163:56
         const voterPerUserToday = meta.config[`${type}sPerUserPerDay`];
         if (voterPerUserToday) {
             const postData = await Posts.getPostsFields(votedPidsToday, ['uid']);
-            const targetUpVotes = postData.filter(p => p.uid === targetUid).length;
+            const targetUpVotes = postData.filter(p => true).length;
             if (targetUpVotes >= voterPerUserToday) {
                 throw new Error(`[[error:too-many-${type}s-today-user, ${voterPerUserToday}]]`);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:164:53
         if (voterPerUserToday) {
             const postData = await Posts.getPostsFields(votedPidsToday, ['uid']);
             const targetUpVotes = postData.filter(p => p.uid === targetUid).length;
-            if (targetUpVotes >= voterPerUserToday) {
-                throw new Error(`[[error:too-many-${type}s-today-user, ${voterPerUserToday}]]`);
-            }
+            if (targetUpVotes >= voterPerUserToday) {}
         }
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:164:17
         if (voterPerUserToday) {
             const postData = await Posts.getPostsFields(votedPidsToday, ['uid']);
             const targetUpVotes = postData.filter(p => p.uid === targetUid).length;
-            if (targetUpVotes >= voterPerUserToday) {
+            if (true) {
                 throw new Error(`[[error:too-many-${type}s-today-user, ${voterPerUserToday}]]`);
             }
killedBy: POST /ping: response status code should match one of the schema defined responses
statusReason: POST /ping sent back unexpected HTTP status code: 401 {"status":{"code":"not-authorised","message":"A valid login session was not found. Please log in and try again."},"response":{}}

[Killed] EqualityOperator
src/posts/votes.js:172:13
 
     async function vote(type, unvote, pid, uid, voteStatus) {
         uid = parseInt(uid, 10);
-        if (uid <= 0) {
+        if (uid < 0) {
             throw new Error('[[error:not-logged-in]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/votes.js:177:13
         }
         const now = Date.now();
 
-        if (type === 'upvote' && !unvote) {
+        if (type !== 'upvote' && !unvote) {
             await db.sortedSetAdd(`uid:${uid}:upvote`, now, pid);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:177:13
         }
         const now = Date.now();
 
-        if (type === 'upvote' && !unvote) {
+        if (true) {
             await db.sortedSetAdd(`uid:${uid}:upvote`, now, pid);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:178:35
         const now = Date.now();
 
         if (type === 'upvote' && !unvote) {
-            await db.sortedSetAdd(`uid:${uid}:upvote`, now, pid);
+            await db.sortedSetAdd(``, now, pid);
         } else {
             await db.sortedSetRemove(`uid:${uid}:upvote`, pid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:179:16
 
         if (type === 'upvote' && !unvote) {
             await db.sortedSetAdd(`uid:${uid}:upvote`, now, pid);
-        } else {
-            await db.sortedSetRemove(`uid:${uid}:upvote`, pid);
-        }
+        } else {}
 
         if (type === 'upvote' || unvote) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:183:42
             await db.sortedSetRemove(`uid:${uid}:upvote`, pid);
         }
 
-        if (type === 'upvote' || unvote) {
-            await db.sortedSetRemove(`uid:${uid}:downvote`, pid);
-        } else {
+        if (type === 'upvote' || unvote) {} else {
             await db.sortedSetAdd(`uid:${uid}:downvote`, now, pid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/votes.js:183:13
             await db.sortedSetRemove(`uid:${uid}:upvote`, pid);
         }
 
-        if (type === 'upvote' || unvote) {
+        if (type !== 'upvote' || unvote) {
             await db.sortedSetRemove(`uid:${uid}:downvote`, pid);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:184:38
         }
 
         if (type === 'upvote' || unvote) {
-            await db.sortedSetRemove(`uid:${uid}:downvote`, pid);
+            await db.sortedSetRemove(``, pid);
         } else {
             await db.sortedSetAdd(`uid:${uid}:downvote`, now, pid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:185:16
 
         if (type === 'upvote' || unvote) {
             await db.sortedSetRemove(`uid:${uid}:downvote`, pid);
-        } else {
-            await db.sortedSetAdd(`uid:${uid}:downvote`, now, pid);
-        }
+        } else {}
 
         const postData = await Posts.getPostFields(pid, ['pid', 'uid', 'tid']);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:189:72
             await db.sortedSetAdd(`uid:${uid}:downvote`, now, pid);
         }
 
-        const postData = await Posts.getPostFields(pid, ['pid', 'uid', 'tid']);
+        const postData = await Posts.getPostFields(pid, ['pid', 'uid', ""]);
         const newReputation = await user.incrementUserReputationBy(postData.uid, type === 'upvote' ? 1 : -1);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/votes.js:189:57
             await db.sortedSetAdd(`uid:${uid}:downvote`, now, pid);
         }
 
-        const postData = await Posts.getPostFields(pid, ['pid', 'uid', 'tid']);
+        const postData = await Posts.getPostFields(pid, []);
         const newReputation = await user.incrementUserReputationBy(postData.uid, type === 'upvote' ? 1 : -1);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:190:82
         }
 
         const postData = await Posts.getPostFields(pid, ['pid', 'uid', 'tid']);
-        const newReputation = await user.incrementUserReputationBy(postData.uid, type === 'upvote' ? 1 : -1);
+        const newReputation = await user.incrementUserReputationBy(postData.uid, false ? 1 : -1);
 
         await adjustPostVotes(postData, uid, type, unvote);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:190:82
         }
 
         const postData = await Posts.getPostFields(pid, ['pid', 'uid', 'tid']);
-        const newReputation = await user.incrementUserReputationBy(postData.uid, type === 'upvote' ? 1 : -1);
+        const newReputation = await user.incrementUserReputationBy(postData.uid, true ? 1 : -1);
 
         await adjustPostVotes(postData, uid, type, unvote);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/votes.js:197:19
         await fireVoteHook(postData, uid, type, unvote, voteStatus);
 
         return {
-            user: {
-                reputation: newReputation,
-            },
+            user: {},
             fromuid: uid,
             post: postData,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/votes.js:202:42
             },
             fromuid: uid,
             post: postData,
-            upvote: type === 'upvote' && !unvote,
+            upvote: type === 'upvote' && unvote,
             downvote: type === 'downvote' && !unvote,
         };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:202:21
             },
             fromuid: uid,
             post: postData,
-            upvote: type === 'upvote' && !unvote,
+            upvote: false,
             downvote: type === 'downvote' && !unvote,
         };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/votes.js:203:23
             fromuid: uid,
             post: postData,
             upvote: type === 'upvote' && !unvote,
-            downvote: type === 'downvote' && !unvote,
+            downvote: type !== 'downvote' && !unvote,
         };
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/votes.js:203:23
             fromuid: uid,
             post: postData,
             upvote: type === 'upvote' && !unvote,
-            downvote: type === 'downvote' && !unvote,
+            downvote: type === 'downvote' || !unvote,
         };
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:207:74
         };
     }
 
-    async function fireVoteHook(postData, uid, type, unvote, voteStatus) {
-        let hook = type;
-        let current = voteStatus.upvoted ? 'upvote' : 'downvote';
-        if (unvote) { // e.g. unvoting, removing a upvote or downvote
-            hook = 'unvote';
-        } else { // e.g. User *has not* voted, clicks upvote or downvote
-            current = 'unvote';
-        }
-        // action:post.upvote
-        // action:post.downvote
-        // action:post.unvote
-        plugins.hooks.fire(`action:post.${hook}`, {
-            pid: postData.pid,
-            uid: uid,
-            owner: postData.uid,
-            current: current,
-        });
-    }
+    async function fireVoteHook(postData, uid, type, unvote, voteStatus) {}
 
     async function adjustPostVotes(postData, uid, type, unvote) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:209:55
 
     async function fireVoteHook(postData, uid, type, unvote, voteStatus) {
         let hook = type;
-        let current = voteStatus.upvoted ? 'upvote' : 'downvote';
+        let current = voteStatus.upvoted ? 'upvote' : "";
         if (unvote) { // e.g. unvoting, removing a upvote or downvote
             hook = 'unvote';
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:210:13
     async function fireVoteHook(postData, uid, type, unvote, voteStatus) {
         let hook = type;
         let current = voteStatus.upvoted ? 'upvote' : 'downvote';
-        if (unvote) { // e.g. unvoting, removing a upvote or downvote
+        if (true) { // e.g. unvoting, removing a upvote or downvote
             hook = 'unvote';
         } else { // e.g. User *has not* voted, clicks upvote or downvote
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:210:21
     async function fireVoteHook(postData, uid, type, unvote, voteStatus) {
         let hook = type;
         let current = voteStatus.upvoted ? 'upvote' : 'downvote';
-        if (unvote) { // e.g. unvoting, removing a upvote or downvote
-            hook = 'unvote';
-        } else { // e.g. User *has not* voted, clicks upvote or downvote
+        if (unvote) {} else { // e.g. User *has not* voted, clicks upvote or downvote
             current = 'unvote';
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:212:16
         let current = voteStatus.upvoted ? 'upvote' : 'downvote';
         if (unvote) { // e.g. unvoting, removing a upvote or downvote
             hook = 'unvote';
-        } else { // e.g. User *has not* voted, clicks upvote or downvote
-            current = 'unvote';
-        }
+        } else {}
         // action:post.upvote
         // action:post.downvote
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/votes.js:218:51
         // action:post.upvote
         // action:post.downvote
         // action:post.unvote
-        plugins.hooks.fire(`action:post.${hook}`, {
-            pid: postData.pid,
-            uid: uid,
-            owner: postData.uid,
-            current: current,
-        });
+        plugins.hooks.fire(`action:post.${hook}`, {});
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:218:28
         // action:post.upvote
         // action:post.downvote
         // action:post.unvote
-        plugins.hooks.fire(`action:post.${hook}`, {
+        plugins.hooks.fire(``, {
             pid: postData.pid,
             uid: uid,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:226:65
         });
     }
 
-    async function adjustPostVotes(postData, uid, type, unvote) {
-        const notType = (type === 'upvote' ? 'downvote' : 'upvote');
-        if (unvote) {
-            await db.setRemove(`pid:${postData.pid}:${type}`, uid);
-        } else {
-            await db.setAdd(`pid:${postData.pid}:${type}`, uid);
-        }
-        await db.setRemove(`pid:${postData.pid}:${notType}`, uid);
-
-        const [upvotes, downvotes] = await Promise.all([
-            db.setCount(`pid:${postData.pid}:upvote`),
-            db.setCount(`pid:${postData.pid}:downvote`),
-        ]);
-        postData.upvotes = upvotes;
-        postData.downvotes = downvotes;
-        postData.votes = postData.upvotes - postData.downvotes;
-        await Posts.updatePostVoteCount(postData);
-    }
+    async function adjustPostVotes(postData, uid, type, unvote) {}
 
     Posts.updatePostVoteCount = async function (postData) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/votes.js:227:26
     }
 
     async function adjustPostVotes(postData, uid, type, unvote) {
-        const notType = (type === 'upvote' ? 'downvote' : 'upvote');
+        const notType = (type !== 'upvote' ? 'downvote' : 'upvote');
         if (unvote) {
             await db.setRemove(`pid:${postData.pid}:${type}`, uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:227:26
     }
 
     async function adjustPostVotes(postData, uid, type, unvote) {
-        const notType = (type === 'upvote' ? 'downvote' : 'upvote');
+        const notType = (false ? 'downvote' : 'upvote');
         if (unvote) {
             await db.setRemove(`pid:${postData.pid}:${type}`, uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
