[Killed] StringLiteral
src/posts/parse.js:133:32
     };
 
     Posts.registerHooks = () => {
-        plugins.hooks.register('core', {
+        plugins.hooks.register("", {
             hook: 'filter:parse.post',
             method: async (data) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/parse.js:134:19
 
     Posts.registerHooks = () => {
         plugins.hooks.register('core', {
-            hook: 'filter:parse.post',
+            hook: "",
             method: async (data) => {
                 data.postData.content = Posts.sanitize(data.postData.content);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:135:37
     Posts.registerHooks = () => {
         plugins.hooks.register('core', {
             hook: 'filter:parse.post',
-            method: async (data) => {
-                data.postData.content = Posts.sanitize(data.postData.content);
-                return data;
-            },
+            method: async (data) => {},
         });
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/parse.js:143:21
 
         plugins.hooks.register('core', {
             hook: 'filter:parse.raw',
-            method: async content => Posts.sanitize(content),
+            method: () => undefined,
         });
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/parse.js:146:40
             method: async content => Posts.sanitize(content),
         });
 
-        plugins.hooks.register('core', {
-            hook: 'filter:parse.aboutme',
-            method: async content => Posts.sanitize(content),
-        });
+        plugins.hooks.register('core', {});
 
         plugins.hooks.register('core', {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/parse.js:148:21
 
         plugins.hooks.register('core', {
             hook: 'filter:parse.aboutme',
-            method: async content => Posts.sanitize(content),
+            method: () => undefined,
         });
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/parse.js:151:40
             method: async content => Posts.sanitize(content),
         });
 
-        plugins.hooks.register('core', {
-            hook: 'filter:parse.signature',
-            method: async (data) => {
-                data.userData.signature = Posts.sanitize(data.userData.signature);
-                return data;
-            },
-        });
+        plugins.hooks.register('core', {});
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/parse.js:152:19
         });
 
         plugins.hooks.register('core', {
-            hook: 'filter:parse.signature',
+            hook: "",
             method: async (data) => {
                 data.userData.signature = Posts.sanitize(data.userData.signature);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:153:37
 
         plugins.hooks.register('core', {
             hook: 'filter:parse.signature',
-            method: async (data) => {
-                data.userData.signature = Posts.sanitize(data.userData.signature);
-                return data;
-            },
+            method: async (data) => {},
         });
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:160:43
         });
     };
 
-    function sanitizeSignature(signature) {
-        signature = translator.escape(signature);
-        const tagsToStrip = [];
-
-        if (meta.config['signatures:disableLinks']) {
-            tagsToStrip.push('a');
-        }
-
-        if (meta.config['signatures:disableImages']) {
-            tagsToStrip.push('img');
-        }
-
-        return utils.stripHTMLTags(signature, tagsToStrip);
-    }
+    function sanitizeSignature(signature) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/parse.js:164:13
         signature = translator.escape(signature);
         const tagsToStrip = [];
 
-        if (meta.config['signatures:disableLinks']) {
+        if (true) {
             tagsToStrip.push('a');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/parse.js:164:13
         signature = translator.escape(signature);
         const tagsToStrip = [];
 
-        if (meta.config['signatures:disableLinks']) {
+        if (false) {
             tagsToStrip.push('a');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/parse.js:165:30
         const tagsToStrip = [];
 
         if (meta.config['signatures:disableLinks']) {
-            tagsToStrip.push('a');
+            tagsToStrip.push("");
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/parse.js:168:54
             tagsToStrip.push('a');
         }
 
-        if (meta.config['signatures:disableImages']) {
-            tagsToStrip.push('img');
-        }
+        if (meta.config['signatures:disableImages']) {}
 
         return utils.stripHTMLTags(signature, tagsToStrip);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/parse.js:168:13
             tagsToStrip.push('a');
         }
 
-        if (meta.config['signatures:disableImages']) {
+        if (true) {
             tagsToStrip.push('img');
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
