[Killed] LogicalOperator
src/posts/summary.js:15:13
 
 module.exports = function (Posts) {
     Posts.getPostSummaryByPids = async function (pids, uid, options) {
-        if (!Array.isArray(pids) || !pids.length) {
+        if (!Array.isArray(pids) && !pids.length) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/summary.js:15:13
 
 module.exports = function (Posts) {
     Posts.getPostSummaryByPids = async function (pids, uid, options) {
-        if (!Array.isArray(pids) || !pids.length) {
+        if (true) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/summary.js:19:87
             return [];
         }
 
-        options.stripTags = options.hasOwnProperty('stripTags') ? options.stripTags : false;
+        options.stripTags = options.hasOwnProperty('stripTags') ? options.stripTags : true;
         options.parse = options.hasOwnProperty('parse') ? options.parse : true;
         options.extraFields = options.hasOwnProperty('extraFields') ? options.extraFields : [];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/summary.js:20:75
         }
 
         options.stripTags = options.hasOwnProperty('stripTags') ? options.stripTags : false;
-        options.parse = options.hasOwnProperty('parse') ? options.parse : true;
+        options.parse = options.hasOwnProperty('parse') ? options.parse : false;
         options.extraFields = options.hasOwnProperty('extraFields') ? options.extraFields : [];
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/summary.js:23:92
         options.parse = options.hasOwnProperty('parse') ? options.parse : true;
         options.extraFields = options.hasOwnProperty('extraFields') ? options.extraFields : [];
 
-        const fields = ['pid', 'tid', 'content', 'uid', 'timestamp', 'deleted', 'upvotes', 'downvotes', 'replies', 'handle'].concat(options.extraFields);
+        const fields = ['pid', 'tid', 'content', 'uid', 'timestamp', 'deleted', 'upvotes', "", 'replies', 'handle'].concat(options.extraFields);
 
         let posts = await Posts.getPostsFields(pids, fields);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/summary.js:23:57
         options.parse = options.hasOwnProperty('parse') ? options.parse : true;
         options.extraFields = options.hasOwnProperty('extraFields') ? options.extraFields : [];
 
-        const fields = ['pid', 'tid', 'content', 'uid', 'timestamp', 'deleted', 'upvotes', 'downvotes', 'replies', 'handle'].concat(options.extraFields);
+        const fields = ['pid', 'tid', 'content', 'uid', "", 'deleted', 'upvotes', 'downvotes', 'replies', 'handle'].concat(options.extraFields);
 
         let posts = await Posts.getPostsFields(pids, fields);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/summary.js:26:17
         const fields = ['pid', 'tid', 'content', 'uid', 'timestamp', 'deleted', 'upvotes', 'downvotes', 'replies', 'handle'].concat(options.extraFields);
 
         let posts = await Posts.getPostsFields(pids, fields);
-        posts = posts.filter(Boolean);
+        posts = posts;
         posts = await user.blocks.filter(uid, posts);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/summary.js:27:23
 
         let posts = await Posts.getPostsFields(pids, fields);
         posts = posts.filter(Boolean);
-        posts = await user.blocks.filter(uid, posts);
+        posts = await user.blocks;
 
         const uids = _.uniq(posts.map(p => p && p.uid));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/summary.js:29:44
         posts = posts.filter(Boolean);
         posts = await user.blocks.filter(uid, posts);
 
-        const uids = _.uniq(posts.map(p => p && p.uid));
+        const uids = _.uniq(posts.map(p => false));
         const tids = _.uniq(posts.map(p => p && p.tid));
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/summary.js:29:44
         posts = posts.filter(Boolean);
         posts = await user.blocks.filter(uid, posts);
 
-        const uids = _.uniq(posts.map(p => p && p.uid));
+        const uids = _.uniq(posts.map(p => true));
         const tids = _.uniq(posts.map(p => p && p.tid));
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/summary.js:30:44
         posts = await user.blocks.filter(uid, posts);
 
         const uids = _.uniq(posts.map(p => p && p.uid));
-        const tids = _.uniq(posts.map(p => p && p.tid));
+        const tids = _.uniq(posts.map(p => true));
 
         const [users, topicsAndCategories] = await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/summary.js:30:44
         posts = await user.blocks.filter(uid, posts);
 
         const uids = _.uniq(posts.map(p => p && p.uid));
-        const tids = _.uniq(posts.map(p => p && p.tid));
+        const tids = _.uniq(posts.map(p => false));
 
         const [users, topicsAndCategories] = await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/summary.js:32:64
         const uids = _.uniq(posts.map(p => p && p.uid));
         const tids = _.uniq(posts.map(p => p && p.tid));
 
-        const [users, topicsAndCategories] = await Promise.all([
-            user.getUsersFields(uids, ['uid', 'username', 'userslug', 'picture', 'status']),
-            getTopicAndCategories(tids),
-        ]);
+        const [users, topicsAndCategories] = await Promise.all([]);
 
         const uidToUser = toObject('uid', users);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/summary.js:33:59
         const tids = _.uniq(posts.map(p => p && p.tid));
 
         const [users, topicsAndCategories] = await Promise.all([
-            user.getUsersFields(uids, ['uid', 'username', 'userslug', 'picture', 'status']),
+            user.getUsersFields(uids, ['uid', 'username', "", 'picture', 'status']),
             getTopicAndCategories(tids),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/summary.js:33:71
         const tids = _.uniq(posts.map(p => p && p.tid));
 
         const [users, topicsAndCategories] = await Promise.all([
-            user.getUsersFields(uids, ['uid', 'username', 'userslug', 'picture', 'status']),
+            user.getUsersFields(uids, ['uid', 'username', 'userslug', "", 'status']),
             getTopicAndCategories(tids),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/summary.js:41:33
         const tidToTopic = toObject('tid', topicsAndCategories.topics);
         const cidToCategory = toObject('cid', topicsAndCategories.categories);
 
-        posts.forEach((post) => {
-            // If the post author isn't represented in the retrieved users' data,
-            // then it means they were deleted, assume guest.
-            if (!uidToUser.hasOwnProperty(post.uid)) {
-                post.uid = 0;
-            }
-            post.user = uidToUser[post.uid];
-            Posts.overrideGuestHandle(post, post.handle);
-            post.handle = undefined;
-            post.topic = tidToTopic[post.tid];
-            post.category = post.topic && cidToCategory[post.topic.cid];
-            post.isMainPost = post.topic && post.pid === post.topic.mainPid;
-            post.deleted = post.deleted === 1;
-            post.timestampISO = utils.toISOString(post.timestamp);
-        });
+        posts.forEach((post) => {});
 
         posts = posts.filter(post => tidToTopic[post.tid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/summary.js:44:17
         posts.forEach((post) => {
             // If the post author isn't represented in the retrieved users' data,
             // then it means they were deleted, assume guest.
-            if (!uidToUser.hasOwnProperty(post.uid)) {
+            if (true) {
                 post.uid = 0;
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/summary.js:44:54
         posts.forEach((post) => {
             // If the post author isn't represented in the retrieved users' data,
             // then it means they were deleted, assume guest.
-            if (!uidToUser.hasOwnProperty(post.uid)) {
-                post.uid = 0;
-            }
+            if (!uidToUser.hasOwnProperty(post.uid)) {}
             post.user = uidToUser[post.uid];
             Posts.overrideGuestHandle(post, post.handle);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/summary.js:51:29
             Posts.overrideGuestHandle(post, post.handle);
             post.handle = undefined;
             post.topic = tidToTopic[post.tid];
-            post.category = post.topic && cidToCategory[post.topic.cid];
+            post.category = post.topic || cidToCategory[post.topic.cid];
             post.isMainPost = post.topic && post.pid === post.topic.mainPid;
             post.deleted = post.deleted === 1;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/summary.js:51:29
             Posts.overrideGuestHandle(post, post.handle);
             post.handle = undefined;
             post.topic = tidToTopic[post.tid];
-            post.category = post.topic && cidToCategory[post.topic.cid];
+            post.category = true;
             post.isMainPost = post.topic && post.pid === post.topic.mainPid;
             post.deleted = post.deleted === 1;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/summary.js:52:31
             post.handle = undefined;
             post.topic = tidToTopic[post.tid];
             post.category = post.topic && cidToCategory[post.topic.cid];
-            post.isMainPost = post.topic && post.pid === post.topic.mainPid;
+            post.isMainPost = post.topic || post.pid === post.topic.mainPid;
             post.deleted = post.deleted === 1;
             post.timestampISO = utils.toISOString(post.timestamp);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/summary.js:52:45
             post.handle = undefined;
             post.topic = tidToTopic[post.tid];
             post.category = post.topic && cidToCategory[post.topic.cid];
-            post.isMainPost = post.topic && post.pid === post.topic.mainPid;
+            post.isMainPost = post.topic && post.pid !== post.topic.mainPid;
             post.deleted = post.deleted === 1;
             post.timestampISO = utils.toISOString(post.timestamp);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/summary.js:53:28
             post.topic = tidToTopic[post.tid];
             post.category = post.topic && cidToCategory[post.topic.cid];
             post.isMainPost = post.topic && post.pid === post.topic.mainPid;
-            post.deleted = post.deleted === 1;
+            post.deleted = true;
             post.timestampISO = utils.toISOString(post.timestamp);
         });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/summary.js:53:28
             post.topic = tidToTopic[post.tid];
             post.category = post.topic && cidToCategory[post.topic.cid];
             post.isMainPost = post.topic && post.pid === post.topic.mainPid;
-            post.deleted = post.deleted === 1;
+            post.deleted = false;
             post.timestampISO = utils.toISOString(post.timestamp);
         });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/summary.js:57:30
             post.timestampISO = utils.toISOString(post.timestamp);
         });
 
-        posts = posts.filter(post => tidToTopic[post.tid]);
+        posts = posts.filter(() => undefined);
 
         posts = await parsePosts(posts, options);
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] MethodExpression
src/posts/summary.js:57:17
             post.timestampISO = utils.toISOString(post.timestamp);
         });
 
-        posts = posts.filter(post => tidToTopic[post.tid]);
+        posts = posts;
 
         posts = await parsePosts(posts, options);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/summary.js:60:49
         posts = posts.filter(post => tidToTopic[post.tid]);
 
         posts = await parsePosts(posts, options);
-        const result = await plugins.hooks.fire('filter:post.getPostSummaryByPids', { posts: posts, uid: uid });
+        const result = await plugins.hooks.fire("", { posts: posts, uid: uid });
         return result.posts;
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/summary.js:60:85
         posts = posts.filter(post => tidToTopic[post.tid]);
 
         posts = await parsePosts(posts, options);
-        const result = await plugins.hooks.fire('filter:post.getPostSummaryByPids', { posts: posts, uid: uid });
+        const result = await plugins.hooks.fire('filter:post.getPostSummaryByPids', {});
         return result.posts;
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/summary.js:64:47
         return result.posts;
     };
 
-    async function parsePosts(posts, options) {
-        return await Promise.all(posts.map(async (post) => {
-            if (!post.content || !options.parse) {
-                post.content = post.content ? validator.escape(String(post.content)) : post.content;
-                return post;
-            }
-            post = await Posts.parsePost(post);
-            if (options.stripTags) {
-                post.content = stripTags(post.content);
-            }
-            return post;
-        }));
-    }
+    async function parsePosts(posts, options) {}
 
     async function getTopicAndCategories(tids) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/summary.js:65:60
     };
 
     async function parsePosts(posts, options) {
-        return await Promise.all(posts.map(async (post) => {
-            if (!post.content || !options.parse) {
-                post.content = post.content ? validator.escape(String(post.content)) : post.content;
-                return post;
-            }
-            post = await Posts.parsePost(post);
-            if (options.stripTags) {
-                post.content = stripTags(post.content);
-            }
-            return post;
-        }));
+        return await Promise.all(posts.map(async (post) => {}));
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/summary.js:66:50
 
     async function parsePosts(posts, options) {
         return await Promise.all(posts.map(async (post) => {
-            if (!post.content || !options.parse) {
-                post.content = post.content ? validator.escape(String(post.content)) : post.content;
-                return post;
-            }
+            if (!post.content || !options.parse) {}
             post = await Posts.parsePost(post);
             if (options.stripTags) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/summary.js:66:34
 
     async function parsePosts(posts, options) {
         return await Promise.all(posts.map(async (post) => {
-            if (!post.content || !options.parse) {
+            if (!post.content || options.parse) {
                 post.content = post.content ? validator.escape(String(post.content)) : post.content;
                 return post;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/summary.js:71:36
                 return post;
             }
             post = await Posts.parsePost(post);
-            if (options.stripTags) {
-                post.content = stripTags(post.content);
-            }
+            if (options.stripTags) {}
             return post;
         }));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/summary.js:71:17
                 return post;
             }
             post = await Posts.parsePost(post);
-            if (options.stripTags) {
+            if (false) {
                 post.content = stripTags(post.content);
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/summary.js:78:48
         }));
     }
 
-    async function getTopicAndCategories(tids) {
-        const topicsData = await topics.getTopicsFields(tids, [
-            'uid', 'tid', 'title', 'cid', 'tags', 'slug',
-            'deleted', 'scheduled', 'postcount', 'mainPid', 'teaserPid',
-        ]);
-        const cids = _.uniq(topicsData.map(topic => topic && topic.cid));
-        const categoriesData = await categories.getCategoriesFields(cids, [
-            'cid', 'name', 'icon', 'slug', 'parentCid',
-            'bgColor', 'color', 'backgroundImage', 'imageClass',
-        ]);
-        return { topics: topicsData, categories: categoriesData };
-    }
+    async function getTopicAndCategories(tids) {}
 
     function toObject(key, data) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/summary.js:79:63
     }
 
     async function getTopicAndCategories(tids) {
-        const topicsData = await topics.getTopicsFields(tids, [
-            'uid', 'tid', 'title', 'cid', 'tags', 'slug',
-            'deleted', 'scheduled', 'postcount', 'mainPid', 'teaserPid',
-        ]);
+        const topicsData = await topics.getTopicsFields(tids, []);
         const cids = _.uniq(topicsData.map(topic => topic && topic.cid));
         const categoriesData = await categories.getCategoriesFields(cids, [
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/summary.js:80:51
 
     async function getTopicAndCategories(tids) {
         const topicsData = await topics.getTopicsFields(tids, [
-            'uid', 'tid', 'title', 'cid', 'tags', 'slug',
+            'uid', 'tid', 'title', 'cid', 'tags', "",
             'deleted', 'scheduled', 'postcount', 'mainPid', 'teaserPid',
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/summary.js:80:36
 
     async function getTopicAndCategories(tids) {
         const topicsData = await topics.getTopicsFields(tids, [
-            'uid', 'tid', 'title', 'cid', 'tags', 'slug',
+            'uid', 'tid', 'title', "", 'tags', 'slug',
             'deleted', 'scheduled', 'postcount', 'mainPid', 'teaserPid',
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/summary.js:83:44
             'uid', 'tid', 'title', 'cid', 'tags', 'slug',
             'deleted', 'scheduled', 'postcount', 'mainPid', 'teaserPid',
         ]);
-        const cids = _.uniq(topicsData.map(topic => topic && topic.cid));
+        const cids = _.uniq(topicsData.map(() => undefined));
         const categoriesData = await categories.getCategoriesFields(cids, [
             'cid', 'name', 'icon', 'slug', 'parentCid',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/summary.js:83:53
             'uid', 'tid', 'title', 'cid', 'tags', 'slug',
             'deleted', 'scheduled', 'postcount', 'mainPid', 'teaserPid',
         ]);
-        const cids = _.uniq(topicsData.map(topic => topic && topic.cid));
+        const cids = _.uniq(topicsData.map(topic => true));
         const categoriesData = await categories.getCategoriesFields(cids, [
             'cid', 'name', 'icon', 'slug', 'parentCid',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/summary.js:86:33
         const cids = _.uniq(topicsData.map(topic => topic && topic.cid));
         const categoriesData = await categories.getCategoriesFields(cids, [
             'cid', 'name', 'icon', 'slug', 'parentCid',
-            'bgColor', 'color', 'backgroundImage', 'imageClass',
+            'bgColor', 'color', "", 'imageClass',
         ]);
         return { topics: topicsData, categories: categoriesData };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/summary.js:88:16
             'cid', 'name', 'icon', 'slug', 'parentCid',
             'bgColor', 'color', 'backgroundImage', 'imageClass',
         ]);
-        return { topics: topicsData, categories: categoriesData };
+        return {};
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/summary.js:91:34
         return { topics: topicsData, categories: categoriesData };
     }
 
-    function toObject(key, data) {
-        const obj = {};
-        for (let i = 0; i < data.length; i += 1) {
-            obj[data[i][key]] = data[i];
-        }
-        return obj;
-    }
+    function toObject(key, data) {}
 
     function stripTags(content) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/summary.js:93:50
 
     function toObject(key, data) {
         const obj = {};
-        for (let i = 0; i < data.length; i += 1) {
-            obj[data[i][key]] = data[i];
-        }
+        for (let i = 0; i < data.length; i += 1) {}
         return obj;
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/summary.js:93:25
 
     function toObject(key, data) {
         const obj = {};
-        for (let i = 0; i < data.length; i += 1) {
+        for (let i = 0; i >= data.length; i += 1) {
             obj[data[i][key]] = data[i];
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/summary.js:99:33
         return obj;
     }
 
-    function stripTags(content) {
-        if (content) {
-            return utils.stripHTMLTags(content, utils.stripTags);
-        }
-        return content;
-    }
+    function stripTags(content) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/summary.js:100:13
     }
 
     function stripTags(content) {
-        if (content) {
+        if (true) {
             return utils.stripHTMLTags(content, utils.stripTags);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/summary.js:100:22
     }
 
     function stripTags(content) {
-        if (content) {
-            return utils.stripHTMLTags(content, utils.stripTags);
-        }
+        if (content) {}
         return content;
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
