[Killed] BlockStatement
src/posts/votes.js:228:21
 
     async function adjustPostVotes(postData, uid, type, unvote) {
         const notType = (type === 'upvote' ? 'downvote' : 'upvote');
-        if (unvote) {
-            await db.setRemove(`pid:${postData.pid}:${type}`, uid);
-        } else {
+        if (unvote) {} else {
             await db.setAdd(`pid:${postData.pid}:${type}`, uid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:228:13
 
     async function adjustPostVotes(postData, uid, type, unvote) {
         const notType = (type === 'upvote' ? 'downvote' : 'upvote');
-        if (unvote) {
+        if (true) {
             await db.setRemove(`pid:${postData.pid}:${type}`, uid);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:229:32
     async function adjustPostVotes(postData, uid, type, unvote) {
         const notType = (type === 'upvote' ? 'downvote' : 'upvote');
         if (unvote) {
-            await db.setRemove(`pid:${postData.pid}:${type}`, uid);
+            await db.setRemove(``, uid);
         } else {
             await db.setAdd(`pid:${postData.pid}:${type}`, uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:230:16
         const notType = (type === 'upvote' ? 'downvote' : 'upvote');
         if (unvote) {
             await db.setRemove(`pid:${postData.pid}:${type}`, uid);
-        } else {
-            await db.setAdd(`pid:${postData.pid}:${type}`, uid);
-        }
+        } else {}
         await db.setRemove(`pid:${postData.pid}:${notType}`, uid);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:231:29
         if (unvote) {
             await db.setRemove(`pid:${postData.pid}:${type}`, uid);
         } else {
-            await db.setAdd(`pid:${postData.pid}:${type}`, uid);
+            await db.setAdd(``, uid);
         }
         await db.setRemove(`pid:${postData.pid}:${notType}`, uid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/votes.js:235:56
         }
         await db.setRemove(`pid:${postData.pid}:${notType}`, uid);
 
-        const [upvotes, downvotes] = await Promise.all([
-            db.setCount(`pid:${postData.pid}:upvote`),
-            db.setCount(`pid:${postData.pid}:downvote`),
-        ]);
+        const [upvotes, downvotes] = await Promise.all([]);
         postData.upvotes = upvotes;
         postData.downvotes = downvotes;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:236:25
         await db.setRemove(`pid:${postData.pid}:${notType}`, uid);
 
         const [upvotes, downvotes] = await Promise.all([
-            db.setCount(`pid:${postData.pid}:upvote`),
+            db.setCount(``),
             db.setCount(`pid:${postData.pid}:downvote`),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/votes.js:241:26
         ]);
         postData.upvotes = upvotes;
         postData.downvotes = downvotes;
-        postData.votes = postData.upvotes - postData.downvotes;
+        postData.votes = postData.upvotes + postData.downvotes;
         await Posts.updatePostVoteCount(postData);
     }
killedBy: POST /ping: response status code should match one of the schema defined responses
statusReason: POST /ping sent back unexpected HTTP status code: 401 {"status":{"code":"not-authorised","message":"A valid login session was not found. Please log in and try again."},"response":{}}

[Killed] BlockStatement
src/posts/votes.js:245:59
         await Posts.updatePostVoteCount(postData);
     }
 
-    Posts.updatePostVoteCount = async function (postData) {
-        if (!postData || !postData.pid || !postData.tid) {
-            return;
-        }
-        const threshold = meta.config['flags:autoFlagOnDownvoteThreshold'];
-        if (threshold && postData.votes <= (-threshold)) {
-            const adminUid = await user.getFirstAdminUid();
-            const reportMsg = await translator.translate(`[[flags:auto-flagged, ${-postData.votes}]]`);
-            const flagObj = await flags.create('post', postData.pid, adminUid, reportMsg, null, true);
-            await flags.notify(flagObj, adminUid, true);
-        }
-        await Promise.all([
-            updateTopicVoteCount(postData),
-            db.sortedSetAdd('posts:votes', postData.votes, postData.pid),
-            Posts.setPostFields(postData.pid, {
-                upvotes: postData.upvotes,
-                downvotes: postData.downvotes,
-            }),
-        ]);
-        plugins.hooks.fire('action:post.updatePostVoteCount', { post: postData });
-    };
+    Posts.updatePostVoteCount = async function (postData) {};
 
     async function updateTopicVoteCount(postData) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:246:58
     }
 
     Posts.updatePostVoteCount = async function (postData) {
-        if (!postData || !postData.pid || !postData.tid) {
-            return;
-        }
+        if (!postData || !postData.pid || !postData.tid) {}
         const threshold = meta.config['flags:autoFlagOnDownvoteThreshold'];
         if (threshold && postData.votes <= (-threshold)) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:246:13
     }
 
     Posts.updatePostVoteCount = async function (postData) {
-        if (!postData || !postData.pid || !postData.tid) {
+        if (false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:249:39
         if (!postData || !postData.pid || !postData.tid) {
             return;
         }
-        const threshold = meta.config['flags:autoFlagOnDownvoteThreshold'];
+        const threshold = meta.config[""];
         if (threshold && postData.votes <= (-threshold)) {
             const adminUid = await user.getFirstAdminUid();
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:250:58
             return;
         }
         const threshold = meta.config['flags:autoFlagOnDownvoteThreshold'];
-        if (threshold && postData.votes <= (-threshold)) {
-            const adminUid = await user.getFirstAdminUid();
-            const reportMsg = await translator.translate(`[[flags:auto-flagged, ${-postData.votes}]]`);
-            const flagObj = await flags.create('post', postData.pid, adminUid, reportMsg, null, true);
-            await flags.notify(flagObj, adminUid, true);
-        }
+        if (threshold && postData.votes <= (-threshold)) {}
         await Promise.all([
             updateTopicVoteCount(postData),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:250:26
             return;
         }
         const threshold = meta.config['flags:autoFlagOnDownvoteThreshold'];
-        if (threshold && postData.votes <= (-threshold)) {
+        if (threshold && true) {
             const adminUid = await user.getFirstAdminUid();
             const reportMsg = await translator.translate(`[[flags:auto-flagged, ${-postData.votes}]]`);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] UnaryOperator
src/posts/votes.js:252:83
         const threshold = meta.config['flags:autoFlagOnDownvoteThreshold'];
         if (threshold && postData.votes <= (-threshold)) {
             const adminUid = await user.getFirstAdminUid();
-            const reportMsg = await translator.translate(`[[flags:auto-flagged, ${-postData.votes}]]`);
+            const reportMsg = await translator.translate(`[[flags:auto-flagged, ${+postData.votes}]]`);
             const flagObj = await flags.create('post', postData.pid, adminUid, reportMsg, null, true);
             await flags.notify(flagObj, adminUid, true);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/votes.js:253:97
         if (threshold && postData.votes <= (-threshold)) {
             const adminUid = await user.getFirstAdminUid();
             const reportMsg = await translator.translate(`[[flags:auto-flagged, ${-postData.votes}]]`);
-            const flagObj = await flags.create('post', postData.pid, adminUid, reportMsg, null, true);
+            const flagObj = await flags.create('post', postData.pid, adminUid, reportMsg, null, false);
             await flags.notify(flagObj, adminUid, true);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/votes.js:254:51
             const adminUid = await user.getFirstAdminUid();
             const reportMsg = await translator.translate(`[[flags:auto-flagged, ${-postData.votes}]]`);
             const flagObj = await flags.create('post', postData.pid, adminUid, reportMsg, null, true);
-            await flags.notify(flagObj, adminUid, true);
+            await flags.notify(flagObj, adminUid, false);
         }
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/votes.js:259:47
         await Promise.all([
             updateTopicVoteCount(postData),
             db.sortedSetAdd('posts:votes', postData.votes, postData.pid),
-            Posts.setPostFields(postData.pid, {
-                upvotes: postData.upvotes,
-                downvotes: postData.downvotes,
-            }),
+            Posts.setPostFields(postData.pid, {}),
         ]);
         plugins.hooks.fire('action:post.updatePostVoteCount', { post: postData });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/votes.js:264:63
                 downvotes: postData.downvotes,
             }),
         ]);
-        plugins.hooks.fire('action:post.updatePostVoteCount', { post: postData });
+        plugins.hooks.fire('action:post.updatePostVoteCount', {});
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:270:13
     async function updateTopicVoteCount(postData) {
         const topicData = await topics.getTopicFields(postData.tid, ['mainPid', 'cid', 'pinned']);
 
-        if (postData.uid) {
+        if (false) {
             if (postData.votes !== 0) {
                 await db.sortedSetAdd(`cid:${topicData.cid}:uid:${postData.uid}:pids:votes`, postData.votes, postData.pid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/votes.js:270:27
     async function updateTopicVoteCount(postData) {
         const topicData = await topics.getTopicFields(postData.tid, ['mainPid', 'cid', 'pinned']);
 
-        if (postData.uid) {
-            if (postData.votes !== 0) {
-                await db.sortedSetAdd(`cid:${topicData.cid}:uid:${postData.uid}:pids:votes`, postData.votes, postData.pid);
-            } else {
-                await db.sortedSetRemove(`cid:${topicData.cid}:uid:${postData.uid}:pids:votes`, postData.pid);
-            }
-        }
+        if (postData.uid) {}
 
         if (parseInt(topicData.mainPid, 10) !== parseInt(postData.pid, 10)) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:271:17
         const topicData = await topics.getTopicFields(postData.tid, ['mainPid', 'cid', 'pinned']);
 
         if (postData.uid) {
-            if (postData.votes !== 0) {
+            if (true) {
                 await db.sortedSetAdd(`cid:${topicData.cid}:uid:${postData.uid}:pids:votes`, postData.votes, postData.pid);
             } else {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/votes.js:271:17
         const topicData = await topics.getTopicFields(postData.tid, ['mainPid', 'cid', 'pinned']);
 
         if (postData.uid) {
-            if (postData.votes !== 0) {
+            if (postData.votes === 0) {
                 await db.sortedSetAdd(`cid:${topicData.cid}:uid:${postData.uid}:pids:votes`, postData.votes, postData.pid);
             } else {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:272:39
 
         if (postData.uid) {
             if (postData.votes !== 0) {
-                await db.sortedSetAdd(`cid:${topicData.cid}:uid:${postData.uid}:pids:votes`, postData.votes, postData.pid);
+                await db.sortedSetAdd(``, postData.votes, postData.pid);
             } else {
                 await db.sortedSetRemove(`cid:${topicData.cid}:uid:${postData.uid}:pids:votes`, postData.pid);
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] BlockStatement
src/posts/votes.js:273:20
         if (postData.uid) {
             if (postData.votes !== 0) {
                 await db.sortedSetAdd(`cid:${topicData.cid}:uid:${postData.uid}:pids:votes`, postData.votes, postData.pid);
-            } else {
-                await db.sortedSetRemove(`cid:${topicData.cid}:uid:${postData.uid}:pids:votes`, postData.pid);
-            }
+            } else {}
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/votes.js:278:13
             }
         }
 
-        if (parseInt(topicData.mainPid, 10) !== parseInt(postData.pid, 10)) {
+        if (parseInt(topicData.mainPid, 10) === parseInt(postData.pid, 10)) {
             return await db.sortedSetAdd(`tid:${postData.tid}:posts:votes`, postData.votes, postData.pid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:278:13
             }
         }
 
-        if (parseInt(topicData.mainPid, 10) !== parseInt(postData.pid, 10)) {
+        if (true) {
             return await db.sortedSetAdd(`tid:${postData.tid}:posts:votes`, postData.votes, postData.pid);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:279:42
         }
 
         if (parseInt(topicData.mainPid, 10) !== parseInt(postData.pid, 10)) {
-            return await db.sortedSetAdd(`tid:${postData.tid}:posts:votes`, postData.votes, postData.pid);
+            return await db.sortedSetAdd(``, postData.votes, postData.pid);
         }
         const promises = [
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/votes.js:286:29
                 upvotes: postData.upvotes,
                 downvotes: postData.downvotes,
             }),
-            db.sortedSetAdd('topics:votes', postData.votes, postData.tid),
+            db.sortedSetAdd("", postData.votes, postData.tid),
         ];
         if (!topicData.pinned) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:288:13
             }),
             db.sortedSetAdd('topics:votes', postData.votes, postData.tid),
         ];
-        if (!topicData.pinned) {
+        if (true) {
             promises.push(db.sortedSetAdd(`cid:${topicData.cid}:tids:votes`, postData.votes, postData.tid));
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/votes.js:288:13
             }),
             db.sortedSetAdd('topics:votes', postData.votes, postData.tid),
         ];
-        if (!topicData.pinned) {
+        if (false) {
             promises.push(db.sortedSetAdd(`cid:${topicData.cid}:tids:votes`, postData.votes, postData.tid));
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
