[Killed] BlockStatement
src/posts/topics.js:9:77
 const utils = require('../utils');
 
 module.exports = function (Posts) {
-    Posts.getPostsFromSet = async function (set, start, stop, uid, reverse) {
-        const pids = await Posts.getPidsFromSet(set, start, stop, reverse);
-        const posts = await Posts.getPostsByPids(pids, uid);
-        return await user.blocks.filter(uid, posts);
-    };
+    Posts.getPostsFromSet = async function (set, start, stop, uid, reverse) {};
 
     Posts.isMain = async function (pids) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/topics.js:12:22
     Posts.getPostsFromSet = async function (set, start, stop, uid, reverse) {
         const pids = await Posts.getPidsFromSet(set, start, stop, reverse);
         const posts = await Posts.getPostsByPids(pids, uid);
-        return await user.blocks.filter(uid, posts);
+        return await user.blocks;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/topics.js:15:42
         return await user.blocks.filter(uid, posts);
     };
 
-    Posts.isMain = async function (pids) {
-        const isArray = Array.isArray(pids);
-        pids = isArray ? pids : [pids];
-        const postData = await Posts.getPostsFields(pids, ['tid']);
-        const topicData = await topics.getTopicsFields(postData.map(t => t.tid), ['mainPid']);
-        const result = pids.map((pid, i) => parseInt(pid, 10) === parseInt(topicData[i].mainPid, 10));
-        return isArray ? result : result[0];
-    };
+    Posts.isMain = async function (pids) {};
 
     Posts.getTopicFields = async function (pid, fields) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/topics.js:19:69
         const isArray = Array.isArray(pids);
         pids = isArray ? pids : [pids];
         const postData = await Posts.getPostsFields(pids, ['tid']);
-        const topicData = await topics.getTopicsFields(postData.map(t => t.tid), ['mainPid']);
+        const topicData = await topics.getTopicsFields(postData.map(() => undefined), ['mainPid']);
         const result = pids.map((pid, i) => parseInt(pid, 10) === parseInt(topicData[i].mainPid, 10));
         return isArray ? result : result[0];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/topics.js:19:83
         const isArray = Array.isArray(pids);
         pids = isArray ? pids : [pids];
         const postData = await Posts.getPostsFields(pids, ['tid']);
-        const topicData = await topics.getTopicsFields(postData.map(t => t.tid), ['mainPid']);
+        const topicData = await topics.getTopicsFields(postData.map(t => t.tid), [""]);
         const result = pids.map((pid, i) => parseInt(pid, 10) === parseInt(topicData[i].mainPid, 10));
         return isArray ? result : result[0];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/topics.js:20:33
         pids = isArray ? pids : [pids];
         const postData = await Posts.getPostsFields(pids, ['tid']);
         const topicData = await topics.getTopicsFields(postData.map(t => t.tid), ['mainPid']);
-        const result = pids.map((pid, i) => parseInt(pid, 10) === parseInt(topicData[i].mainPid, 10));
+        const result = pids.map(() => undefined);
         return isArray ? result : result[0];
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/topics.js:20:45
         pids = isArray ? pids : [pids];
         const postData = await Posts.getPostsFields(pids, ['tid']);
         const topicData = await topics.getTopicsFields(postData.map(t => t.tid), ['mainPid']);
-        const result = pids.map((pid, i) => parseInt(pid, 10) === parseInt(topicData[i].mainPid, 10));
+        const result = pids.map((pid, i) => false);
         return isArray ? result : result[0];
     };
killedBy: POST /ping: response status code should match one of the schema defined responses
statusReason: POST /ping sent back unexpected HTTP status code: 401 {"status":{"code":"not-authorised","message":"A valid login session was not found. Please log in and try again."},"response":{}}

[Killed] BlockStatement
src/posts/topics.js:24:57
         return isArray ? result : result[0];
     };
 
-    Posts.getTopicFields = async function (pid, fields) {
-        const tid = await Posts.getPostField(pid, 'tid');
-        return await topics.getTopicFields(tid, fields);
-    };
+    Posts.getTopicFields = async function (pid, fields) {};
 
     Posts.generatePostPath = async function (pid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/topics.js:25:51
     };
 
     Posts.getTopicFields = async function (pid, fields) {
-        const tid = await Posts.getPostField(pid, 'tid');
+        const tid = await Posts.getPostField(pid, "");
         return await topics.getTopicFields(tid, fields);
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/topics.js:29:56
         return await topics.getTopicFields(tid, fields);
     };
 
-    Posts.generatePostPath = async function (pid, uid) {
-        const paths = await Posts.generatePostPaths([pid], uid);
-        return Array.isArray(paths) && paths.length ? paths[0] : null;
-    };
+    Posts.generatePostPath = async function (pid, uid) {};
 
     Posts.generatePostPaths = async function (pids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/topics.js:30:53
     };
 
     Posts.generatePostPath = async function (pid, uid) {
-        const paths = await Posts.generatePostPaths([pid], uid);
+        const paths = await Posts.generatePostPaths([], uid);
         return Array.isArray(paths) && paths.length ? paths[0] : null;
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/topics.js:31:16
 
     Posts.generatePostPath = async function (pid, uid) {
         const paths = await Posts.generatePostPaths([pid], uid);
-        return Array.isArray(paths) && paths.length ? paths[0] : null;
+        return false ? paths[0] : null;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/topics.js:31:16
 
     Posts.generatePostPath = async function (pid, uid) {
         const paths = await Posts.generatePostPaths([pid], uid);
-        return Array.isArray(paths) && paths.length ? paths[0] : null;
+        return true ? paths[0] : null;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/topics.js:34:58
         return Array.isArray(paths) && paths.length ? paths[0] : null;
     };
 
-    Posts.generatePostPaths = async function (pids, uid) {
-        const postData = await Posts.getPostsFields(pids, ['pid', 'tid']);
-        const tids = postData.map(post => post && post.tid);
-        const [indices, topicData] = await Promise.all([
-            Posts.getPostIndices(postData, uid),
-            topics.getTopicsFields(tids, ['slug']),
-        ]);
-
-        const paths = pids.map((pid, index) => {
-            const slug = topicData[index] ? topicData[index].slug : null;
-            const postIndex = utils.isNumber(indices[index]) ? parseInt(indices[index], 10) + 1 : null;
-
-            if (slug && postIndex) {
-                return `/topic/${slug}/${postIndex}`;
-            }
-            return null;
-        });
-
-        return paths;
-    };
+    Posts.generatePostPaths = async function (pids, uid) {};
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/topics.js:36:35
 
     Posts.generatePostPaths = async function (pids, uid) {
         const postData = await Posts.getPostsFields(pids, ['pid', 'tid']);
-        const tids = postData.map(post => post && post.tid);
+        const tids = postData.map(() => undefined);
         const [indices, topicData] = await Promise.all([
             Posts.getPostIndices(postData, uid),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/topics.js:36:43
 
     Posts.generatePostPaths = async function (pids, uid) {
         const postData = await Posts.getPostsFields(pids, ['pid', 'tid']);
-        const tids = postData.map(post => post && post.tid);
+        const tids = postData.map(post => post || post.tid);
         const [indices, topicData] = await Promise.all([
             Posts.getPostIndices(postData, uid),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/topics.js:42:48
             topics.getTopicsFields(tids, ['slug']),
         ]);
 
-        const paths = pids.map((pid, index) => {
-            const slug = topicData[index] ? topicData[index].slug : null;
-            const postIndex = utils.isNumber(indices[index]) ? parseInt(indices[index], 10) + 1 : null;
-
-            if (slug && postIndex) {
-                return `/topic/${slug}/${postIndex}`;
-            }
-            return null;
-        });
+        const paths = pids.map((pid, index) => {});
 
         return paths;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/topics.js:44:64
 
         const paths = pids.map((pid, index) => {
             const slug = topicData[index] ? topicData[index].slug : null;
-            const postIndex = utils.isNumber(indices[index]) ? parseInt(indices[index], 10) + 1 : null;
+            const postIndex = utils.isNumber(indices[index]) ? parseInt(indices[index], 10) - 1 : null;
 
             if (slug && postIndex) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/topics.js:46:17
             const slug = topicData[index] ? topicData[index].slug : null;
             const postIndex = utils.isNumber(indices[index]) ? parseInt(indices[index], 10) + 1 : null;
 
-            if (slug && postIndex) {
+            if (slug || postIndex) {
                 return `/topic/${slug}/${postIndex}`;
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/topics.js:46:17
             const slug = topicData[index] ? topicData[index].slug : null;
             const postIndex = utils.isNumber(indices[index]) ? parseInt(indices[index], 10) + 1 : null;
 
-            if (slug && postIndex) {
+            if (false) {
                 return `/topic/${slug}/${postIndex}`;
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
