[Killed] ArrowFunction
src/posts/uploads.js:23:17
 module.exports = function (Posts) {
     Posts.uploads = {};
 
-    const md5 = filename => crypto.createHash('md5').update(filename).digest('hex');
+    const md5 = () => undefined;
     const pathPrefix = path.join(nconf.get('upload_path'));
     const searchRegex = /\/assets\/uploads\/(files\/[^\s")]+\.?[\w]*)/g;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] Regex
src/posts/uploads.js:25:25
 
     const md5 = filename => crypto.createHash('md5').update(filename).digest('hex');
     const pathPrefix = path.join(nconf.get('upload_path'));
-    const searchRegex = /\/assets\/uploads\/(files\/[^\s")]+\.?[\w]*)/g;
+    const searchRegex = /\/assets\/uploads\/(files\/[^\s")]\.?[\w]*)/g;
 
     const _getFullPath = relativePath => path.join(pathPrefix, relativePath);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] Regex
src/posts/uploads.js:25:25
 
     const md5 = filename => crypto.createHash('md5').update(filename).digest('hex');
     const pathPrefix = path.join(nconf.get('upload_path'));
-    const searchRegex = /\/assets\/uploads\/(files\/[^\s")]+\.?[\w]*)/g;
+    const searchRegex = /\/assets\/uploads\/(files\/[^\s")]+\.?[^\w]*)/g;
 
     const _getFullPath = relativePath => path.join(pathPrefix, relativePath);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:27:26
     const pathPrefix = path.join(nconf.get('upload_path'));
     const searchRegex = /\/assets\/uploads\/(files\/[^\s")]+\.?[\w]*)/g;
 
-    const _getFullPath = relativePath => path.join(pathPrefix, relativePath);
+    const _getFullPath = () => undefined;
     const _filterValidPaths = async filePaths => (await Promise.all(filePaths.map(async (filePath) => {
         const fullPath = _getFullPath(filePath);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:28:31
     const searchRegex = /\/assets\/uploads\/(files\/[^\s")]+\.?[\w]*)/g;
 
     const _getFullPath = relativePath => path.join(pathPrefix, relativePath);
-    const _filterValidPaths = async filePaths => (await Promise.all(filePaths.map(async (filePath) => {
-        const fullPath = _getFullPath(filePath);
-        return fullPath.startsWith(pathPrefix) && await file.exists(fullPath) ? filePath : false;
-    }))).filter(Boolean);
+    const _filterValidPaths = () => undefined;
 
     const runJobs = nconf.get('runJobs');
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:28:103
     const searchRegex = /\/assets\/uploads\/(files\/[^\s")]+\.?[\w]*)/g;
 
     const _getFullPath = relativePath => path.join(pathPrefix, relativePath);
-    const _filterValidPaths = async filePaths => (await Promise.all(filePaths.map(async (filePath) => {
-        const fullPath = _getFullPath(filePath);
-        return fullPath.startsWith(pathPrefix) && await file.exists(fullPath) ? filePath : false;
-    }))).filter(Boolean);
+    const _filterValidPaths = async filePaths => (await Promise.all(filePaths.map(async (filePath) => {}))).filter(Boolean);
 
     const runJobs = nconf.get('runJobs');
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/uploads.js:30:16
     const _getFullPath = relativePath => path.join(pathPrefix, relativePath);
     const _filterValidPaths = async filePaths => (await Promise.all(filePaths.map(async (filePath) => {
         const fullPath = _getFullPath(filePath);
-        return fullPath.startsWith(pathPrefix) && await file.exists(fullPath) ? filePath : false;
+        return fullPath.startsWith(pathPrefix) || (await file.exists(fullPath)) ? filePath : false;
     }))).filter(Boolean);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/uploads.js:30:16
     const _getFullPath = relativePath => path.join(pathPrefix, relativePath);
     const _filterValidPaths = async filePaths => (await Promise.all(filePaths.map(async (filePath) => {
         const fullPath = _getFullPath(filePath);
-        return fullPath.startsWith(pathPrefix) && await file.exists(fullPath) ? filePath : false;
+        return fullPath.endsWith(pathPrefix) && await file.exists(fullPath) ? filePath : false;
     }))).filter(Boolean);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:34:18
     }))).filter(Boolean);
 
     const runJobs = nconf.get('runJobs');
-    if (runJobs) {
-        new cronJob('0 2 * * 0', async () => {
-            const orphans = await Posts.uploads.cleanOrphans();
-            if (orphans.length) {
-                winston.info(`[posts/uploads] Deleting ${orphans.length} orphaned uploads...`);
-                orphans.forEach((relPath) => {
-                    process.stdout.write(`${chalk.red('  - ')} ${relPath}`);
-                });
-            }
-        }, null, true);
-    }
+    if (runJobs) {}
 
     Posts.uploads.sync = async function (pid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:34:9
     }))).filter(Boolean);
 
     const runJobs = nconf.get('runJobs');
-    if (runJobs) {
+    if (true) {
         new cronJob('0 2 * * 0', async () => {
             const orphans = await Posts.uploads.cleanOrphans();
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:35:46
 
     const runJobs = nconf.get('runJobs');
     if (runJobs) {
-        new cronJob('0 2 * * 0', async () => {
-            const orphans = await Posts.uploads.cleanOrphans();
-            if (orphans.length) {
-                winston.info(`[posts/uploads] Deleting ${orphans.length} orphaned uploads...`);
-                orphans.forEach((relPath) => {
-                    process.stdout.write(`${chalk.red('  - ')} ${relPath}`);
-                });
-            }
-        }, null, true);
+        new cronJob('0 2 * * 0', async () => {}, null, true);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/uploads.js:35:21
 
     const runJobs = nconf.get('runJobs');
     if (runJobs) {
-        new cronJob('0 2 * * 0', async () => {
+        new cronJob("", async () => {
             const orphans = await Posts.uploads.cleanOrphans();
             if (orphans.length) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:37:17
     if (runJobs) {
         new cronJob('0 2 * * 0', async () => {
             const orphans = await Posts.uploads.cleanOrphans();
-            if (orphans.length) {
+            if (false) {
                 winston.info(`[posts/uploads] Deleting ${orphans.length} orphaned uploads...`);
                 orphans.forEach((relPath) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:37:33
     if (runJobs) {
         new cronJob('0 2 * * 0', async () => {
             const orphans = await Posts.uploads.cleanOrphans();
-            if (orphans.length) {
-                winston.info(`[posts/uploads] Deleting ${orphans.length} orphaned uploads...`);
-                orphans.forEach((relPath) => {
-                    process.stdout.write(`${chalk.red('  - ')} ${relPath}`);
-                });
-            }
+            if (orphans.length) {}
         }, null, true);
     }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:39:46
             const orphans = await Posts.uploads.cleanOrphans();
             if (orphans.length) {
                 winston.info(`[posts/uploads] Deleting ${orphans.length} orphaned uploads...`);
-                orphans.forEach((relPath) => {
-                    process.stdout.write(`${chalk.red('  - ')} ${relPath}`);
-                });
+                orphans.forEach((relPath) => {});
             }
         }, null, true);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/uploads.js:40:55
             if (orphans.length) {
                 winston.info(`[posts/uploads] Deleting ${orphans.length} orphaned uploads...`);
                 orphans.forEach((relPath) => {
-                    process.stdout.write(`${chalk.red('  - ')} ${relPath}`);
+                    process.stdout.write(`${chalk.red("")} ${relPath}`);
                 });
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/uploads.js:43:18
                     process.stdout.write(`${chalk.red('  - ')} ${relPath}`);
                 });
             }
-        }, null, true);
+        }, null, false);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/uploads.js:57:25
 
         // Extract upload file paths from post content
         let match = searchRegex.exec(content);
-        const uploads = [];
+        const uploads = ["Stryker was here"];
         while (match) {
             uploads.push(match[1].replace('-resized', ''));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:58:23
         // Extract upload file paths from post content
         let match = searchRegex.exec(content);
         const uploads = [];
-        while (match) {
-            uploads.push(match[1].replace('-resized', ''));
-            match = searchRegex.exec(content);
-        }
+        while (match) {}
 
         // Main posts can contain topic thumbs, which are also tracked by pid
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:58:16
         // Extract upload file paths from post content
         let match = searchRegex.exec(content);
         const uploads = [];
-        while (match) {
+        while (false) {
             uploads.push(match[1].replace('-resized', ''));
             match = searchRegex.exec(content);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:64:13
         }
 
         // Main posts can contain topic thumbs, which are also tracked by pid
-        if (isMainPost) {
+        if (false) {
             const tid = await Posts.getPostField(pid, 'tid');
             let thumbs = await topics.thumbs.get(tid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:64:13
         }
 
         // Main posts can contain topic thumbs, which are also tracked by pid
-        if (isMainPost) {
+        if (true) {
             const tid = await Posts.getPostField(pid, 'tid');
             let thumbs = await topics.thumbs.get(tid);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/uploads.js:67:49
         if (isMainPost) {
             const tid = await Posts.getPostField(pid, 'tid');
             let thumbs = await topics.thumbs.get(tid);
-            const replacePath = path.posix.join(`${nconf.get('relative_path')}${nconf.get('upload_url')}/`);
+            const replacePath = path.posix.join(``);
             thumbs = thumbs.map(thumb => thumb.url.replace(replacePath, '')).filter(path => !validator.isURL(path, {
                 require_protocol: true,
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/uploads.js:68:22
             const tid = await Posts.getPostField(pid, 'tid');
             let thumbs = await topics.thumbs.get(tid);
             const replacePath = path.posix.join(`${nconf.get('relative_path')}${nconf.get('upload_url')}/`);
-            thumbs = thumbs.map(thumb => thumb.url.replace(replacePath, '')).filter(path => !validator.isURL(path, {
-                require_protocol: true,
-            }));
+            thumbs = thumbs.map(thumb => thumb.url.replace(replacePath, ''));
             uploads.push(...thumbs);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:68:85
             const tid = await Posts.getPostField(pid, 'tid');
             let thumbs = await topics.thumbs.get(tid);
             const replacePath = path.posix.join(`${nconf.get('relative_path')}${nconf.get('upload_url')}/`);
-            thumbs = thumbs.map(thumb => thumb.url.replace(replacePath, '')).filter(path => !validator.isURL(path, {
-                require_protocol: true,
-            }));
+            thumbs = thumbs.map(thumb => thumb.url.replace(replacePath, '')).filter(() => undefined);
             uploads.push(...thumbs);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/uploads.js:69:35
             let thumbs = await topics.thumbs.get(tid);
             const replacePath = path.posix.join(`${nconf.get('relative_path')}${nconf.get('upload_url')}/`);
             thumbs = thumbs.map(thumb => thumb.url.replace(replacePath, '')).filter(path => !validator.isURL(path, {
-                require_protocol: true,
+                require_protocol: false,
             }));
             uploads.push(...thumbs);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:75:36
         }
 
         // Create add/remove sets
-        const add = uploads.filter(path => !currentUploads.includes(path));
+        const add = uploads.filter(() => undefined);
         const remove = currentUploads.filter(path => !uploads.includes(path));
         await Promise.all([
killedBy: GET /ping: should not error out when called
statusReason: [[error:no-user]]

[Killed] MethodExpression
src/posts/uploads.js:75:21
         }
 
         // Create add/remove sets
-        const add = uploads.filter(path => !currentUploads.includes(path));
+        const add = uploads;
         const remove = currentUploads.filter(path => !uploads.includes(path));
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:76:46
 
         // Create add/remove sets
         const add = uploads.filter(path => !currentUploads.includes(path));
-        const remove = currentUploads.filter(path => !uploads.includes(path));
+        const remove = currentUploads.filter(() => undefined);
         await Promise.all([
             Posts.uploads.associate(pid, add),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/uploads.js:76:24
 
         // Create add/remove sets
         const add = uploads.filter(path => !currentUploads.includes(path));
-        const remove = currentUploads.filter(path => !uploads.includes(path));
+        const remove = currentUploads;
         await Promise.all([
             Posts.uploads.associate(pid, add),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:83:47
         ]);
     };
 
-    Posts.uploads.list = async function (pid) {
-        return await db.getSortedSetMembers(`post:${pid}:uploads`);
-    };
+    Posts.uploads.list = async function (pid) {};
 
     Posts.uploads.listWithSizes = async function (pid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/uploads.js:84:45
     };
 
     Posts.uploads.list = async function (pid) {
-        return await db.getSortedSetMembers(`post:${pid}:uploads`);
+        return await db.getSortedSetMembers(``);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:87:56
         return await db.getSortedSetMembers(`post:${pid}:uploads`);
     };
 
-    Posts.uploads.listWithSizes = async function (pid) {
-        const paths = await Posts.uploads.list(pid);
-        const sizes = await db.getObjects(paths.map(path => `upload:${md5(path)}`)) || [];
-
-        return sizes.map((sizeObj, idx) => ({
-            ...sizeObj,
-            name: paths[idx],
-        }));
-    };
+    Posts.uploads.listWithSizes = async function (pid) {};
 
     Posts.uploads.getOrphans = async () => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:89:23
 
     Posts.uploads.listWithSizes = async function (pid) {
         const paths = await Posts.uploads.list(pid);
-        const sizes = await db.getObjects(paths.map(path => `upload:${md5(path)}`)) || [];
+        const sizes = true;
 
         return sizes.map((sizeObj, idx) => ({
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:89:23
 
     Posts.uploads.listWithSizes = async function (pid) {
         const paths = await Posts.uploads.list(pid);
-        const sizes = await db.getObjects(paths.map(path => `upload:${md5(path)}`)) || [];
+        const sizes = false;
 
         return sizes.map((sizeObj, idx) => ({
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:91:26
         const paths = await Posts.uploads.list(pid);
         const sizes = await db.getObjects(paths.map(path => `upload:${md5(path)}`)) || [];
 
-        return sizes.map((sizeObj, idx) => ({
-            ...sizeObj,
-            name: paths[idx],
-        }));
+        return sizes.map(() => undefined);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:97:44
         }));
     };
 
-    Posts.uploads.getOrphans = async () => {
-        let files = await fs.readdir(_getFullPath('/files'));
-        files = files.filter(filename => filename !== '.gitignore');
-
-        // Exclude non-timestamped files (e.g. group covers; see gh#10783/gh#10705)
-        const tsPrefix = /^\d{13}-/;
-        files = files.filter(filename => tsPrefix.test(filename));
-
-        files = await Promise.all(files.map(async filename => (await Posts.uploads.isOrphan(`files/${filename}`) ? `files/${filename}` : null)));
-        files = files.filter(Boolean);
-
-        return files;
-    };
+    Posts.uploads.getOrphans = async () => {};
 
     Posts.uploads.cleanOrphans = async () => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/uploads.js:98:51
     };
 
     Posts.uploads.getOrphans = async () => {
-        let files = await fs.readdir(_getFullPath('/files'));
+        let files = await fs.readdir(_getFullPath(""));
         files = files.filter(filename => filename !== '.gitignore');
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:99:30
 
     Posts.uploads.getOrphans = async () => {
         let files = await fs.readdir(_getFullPath('/files'));
-        files = files.filter(filename => filename !== '.gitignore');
+        files = files.filter(() => undefined);
 
         // Exclude non-timestamped files (e.g. group covers; see gh#10783/gh#10705)
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:99:42
 
     Posts.uploads.getOrphans = async () => {
         let files = await fs.readdir(_getFullPath('/files'));
-        files = files.filter(filename => filename !== '.gitignore');
+        files = files.filter(filename => false);
 
         // Exclude non-timestamped files (e.g. group covers; see gh#10783/gh#10705)
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:103:30
 
         // Exclude non-timestamped files (e.g. group covers; see gh#10783/gh#10705)
         const tsPrefix = /^\d{13}-/;
-        files = files.filter(filename => tsPrefix.test(filename));
+        files = files.filter(() => undefined);
 
         files = await Promise.all(files.map(async filename => (await Posts.uploads.isOrphan(`files/${filename}`) ? `files/${filename}` : null)));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/uploads.js:103:17
 
         // Exclude non-timestamped files (e.g. group covers; see gh#10783/gh#10705)
         const tsPrefix = /^\d{13}-/;
-        files = files.filter(filename => tsPrefix.test(filename));
+        files = files;
 
         files = await Promise.all(files.map(async filename => (await Posts.uploads.isOrphan(`files/${filename}`) ? `files/${filename}` : null)));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:105:45
         const tsPrefix = /^\d{13}-/;
         files = files.filter(filename => tsPrefix.test(filename));
 
-        files = await Promise.all(files.map(async filename => (await Posts.uploads.isOrphan(`files/${filename}`) ? `files/${filename}` : null)));
+        files = await Promise.all(files.map(() => undefined));
         files = files.filter(Boolean);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/uploads.js:105:116
         const tsPrefix = /^\d{13}-/;
         files = files.filter(filename => tsPrefix.test(filename));
 
-        files = await Promise.all(files.map(async filename => (await Posts.uploads.isOrphan(`files/${filename}`) ? `files/${filename}` : null)));
+        files = await Promise.all(files.map(async filename => (await Posts.uploads.isOrphan(`files/${filename}`) ? `` : null)));
         files = files.filter(Boolean);
 
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] MethodExpression
src/posts/uploads.js:106:17
         files = files.filter(filename => tsPrefix.test(filename));
 
         files = await Promise.all(files.map(async filename => (await Posts.uploads.isOrphan(`files/${filename}`) ? `files/${filename}` : null)));
-        files = files.filter(Boolean);
+        files = files;
 
         return files;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:111:46
         return files;
     };
 
-    Posts.uploads.cleanOrphans = async () => {
-        const now = Date.now();
-        const expiration = now - (1000 * 60 * 60 * 24 * meta.config.orphanExpiryDays);
-        const days = meta.config.orphanExpiryDays;
-        if (!days) {
-            return [];
-        }
-
-        let orphans = await Posts.uploads.getOrphans();
-
-        orphans = await Promise.all(orphans.map(async (relPath) => {
-            const { mtimeMs } = await fs.stat(_getFullPath(relPath));
-            return mtimeMs < expiration ? relPath : null;
-        }));
-        orphans = orphans.filter(Boolean);
-
-        // Note: no await. Deletion not guaranteed by method end.
-        orphans.forEach((relPath) => {
-            file.delete(_getFullPath(relPath));
-        });
-
-        return orphans;
-    };
+    Posts.uploads.cleanOrphans = async () => {};
 
     Posts.uploads.isOrphan = async function (filePath) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/uploads.js:113:35
 
     Posts.uploads.cleanOrphans = async () => {
         const now = Date.now();
-        const expiration = now - (1000 * 60 * 60 * 24 * meta.config.orphanExpiryDays);
+        const expiration = now - (1000 * 60 * 60 / 24 * meta.config.orphanExpiryDays);
         const days = meta.config.orphanExpiryDays;
         if (!days) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/posts/uploads.js:113:35
 
     Posts.uploads.cleanOrphans = async () => {
         const now = Date.now();
-        const expiration = now - (1000 * 60 * 60 * 24 * meta.config.orphanExpiryDays);
+        const expiration = now - (1000 * 60 / 60 * 24 * meta.config.orphanExpiryDays);
         const days = meta.config.orphanExpiryDays;
         if (!days) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:115:20
         const now = Date.now();
         const expiration = now - (1000 * 60 * 60 * 24 * meta.config.orphanExpiryDays);
         const days = meta.config.orphanExpiryDays;
-        if (!days) {
-            return [];
-        }
+        if (!days) {}
 
         let orphans = await Posts.uploads.getOrphans();
killedBy: GET /ping: should not error out when called
statusReason: [[error:invalid-email]]

[Killed] BooleanLiteral
src/posts/uploads.js:115:13
         const now = Date.now();
         const expiration = now - (1000 * 60 * 60 * 24 * meta.config.orphanExpiryDays);
         const days = meta.config.orphanExpiryDays;
-        if (!days) {
+        if (days) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:121:68
 
         let orphans = await Posts.uploads.getOrphans();
 
-        orphans = await Promise.all(orphans.map(async (relPath) => {
-            const { mtimeMs } = await fs.stat(_getFullPath(relPath));
-            return mtimeMs < expiration ? relPath : null;
-        }));
+        orphans = await Promise.all(orphans.map(async (relPath) => {}));
         orphans = orphans.filter(Boolean);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:123:20
 
         orphans = await Promise.all(orphans.map(async (relPath) => {
             const { mtimeMs } = await fs.stat(_getFullPath(relPath));
-            return mtimeMs < expiration ? relPath : null;
+            return true ? relPath : null;
         }));
         orphans = orphans.filter(Boolean);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:123:20
 
         orphans = await Promise.all(orphans.map(async (relPath) => {
             const { mtimeMs } = await fs.stat(_getFullPath(relPath));
-            return mtimeMs < expiration ? relPath : null;
+            return false ? relPath : null;
         }));
         orphans = orphans.filter(Boolean);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/uploads.js:125:19
             const { mtimeMs } = await fs.stat(_getFullPath(relPath));
             return mtimeMs < expiration ? relPath : null;
         }));
-        orphans = orphans.filter(Boolean);
+        orphans = orphans;
 
         // Note: no await. Deletion not guaranteed by method end.
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
