[Killed] BlockStatement
src/posts/uploads.js:128:38
         orphans = orphans.filter(Boolean);
 
         // Note: no await. Deletion not guaranteed by method end.
-        orphans.forEach((relPath) => {
-            file.delete(_getFullPath(relPath));
-        });
+        orphans.forEach((relPath) => {});
 
         return orphans;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:135:56
         return orphans;
     };
 
-    Posts.uploads.isOrphan = async function (filePath) {
-        const length = await db.sortedSetCard(`upload:${md5(filePath)}:pids`);
-        return length === 0;
-    };
+    Posts.uploads.isOrphan = async function (filePath) {};
 
     Posts.uploads.getUsage = async function (filePaths) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:137:16
 
     Posts.uploads.isOrphan = async function (filePath) {
         const length = await db.sortedSetCard(`upload:${md5(filePath)}:pids`);
-        return length === 0;
+        return false;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/posts/uploads.js:137:16
 
     Posts.uploads.isOrphan = async function (filePath) {
         const length = await db.sortedSetCard(`upload:${md5(filePath)}:pids`);
-        return length === 0;
+        return length !== 0;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:140:57
         return length === 0;
     };
 
-    Posts.uploads.getUsage = async function (filePaths) {
-        // Given an array of file names, determines which pids they are used in
-        if (!Array.isArray(filePaths)) {
-            filePaths = [filePaths];
-        }
-
-        const keys = filePaths.map(fileObj => `upload:${md5(fileObj.path.replace('-resized', ''))}:pids`);
-        return await Promise.all(keys.map(k => db.getSortedSetRange(k, 0, -1)));
-    };
+    Posts.uploads.getUsage = async function (filePaths) {};
 
     Posts.uploads.associate = async function (pid, filePaths) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:142:40
 
     Posts.uploads.getUsage = async function (filePaths) {
         // Given an array of file names, determines which pids they are used in
-        if (!Array.isArray(filePaths)) {
-            filePaths = [filePaths];
-        }
+        if (!Array.isArray(filePaths)) {}
 
         const keys = filePaths.map(fileObj => `upload:${md5(fileObj.path.replace('-resized', ''))}:pids`);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:142:13
 
     Posts.uploads.getUsage = async function (filePaths) {
         // Given an array of file names, determines which pids they are used in
-        if (!Array.isArray(filePaths)) {
+        if (true) {
             filePaths = [filePaths];
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/uploads.js:143:25
     Posts.uploads.getUsage = async function (filePaths) {
         // Given an array of file names, determines which pids they are used in
         if (!Array.isArray(filePaths)) {
-            filePaths = [filePaths];
+            filePaths = [];
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:146:36
             filePaths = [filePaths];
         }
 
-        const keys = filePaths.map(fileObj => `upload:${md5(fileObj.path.replace('-resized', ''))}:pids`);
+        const keys = filePaths.map(() => undefined);
         return await Promise.all(keys.map(k => db.getSortedSetRange(k, 0, -1)));
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/uploads.js:146:47
             filePaths = [filePaths];
         }
 
-        const keys = filePaths.map(fileObj => `upload:${md5(fileObj.path.replace('-resized', ''))}:pids`);
+        const keys = filePaths.map(fileObj => ``);
         return await Promise.all(keys.map(k => db.getSortedSetRange(k, 0, -1)));
     };
killedBy: POST /ping: response status code should match one of the schema defined responses
statusReason: POST /ping sent back unexpected HTTP status code: 401 {"status":{"code":"not-authorised","message":"A valid login session was not found. Please log in and try again."},"response":{}}

[Killed] ArrowFunction
src/posts/uploads.js:147:43
         }
 
         const keys = filePaths.map(fileObj => `upload:${md5(fileObj.path.replace('-resized', ''))}:pids`);
-        return await Promise.all(keys.map(k => db.getSortedSetRange(k, 0, -1)));
+        return await Promise.all(keys.map(() => undefined));
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] UnaryOperator
src/posts/uploads.js:147:75
         }
 
         const keys = filePaths.map(fileObj => `upload:${md5(fileObj.path.replace('-resized', ''))}:pids`);
-        return await Promise.all(keys.map(k => db.getSortedSetRange(k, 0, -1)));
+        return await Promise.all(keys.map(k => db.getSortedSetRange(k, 0, +1)));
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:150:63
         return await Promise.all(keys.map(k => db.getSortedSetRange(k, 0, -1)));
     };
 
-    Posts.uploads.associate = async function (pid, filePaths) {
-        // Adds an upload to a post's sorted set of uploads
-        filePaths = !Array.isArray(filePaths) ? [filePaths] : filePaths;
-        if (!filePaths.length) {
-            return;
-        }
-
-        // Only process files that exist and are within uploads directory
-        filePaths = await _filterValidPaths(filePaths);
-
-        const now = Date.now();
-        const scores = filePaths.map(() => now);
-        const bulkAdd = filePaths.map(path => [`upload:${md5(path)}:pids`, now, pid]);
-        await Promise.all([
-            db.sortedSetAdd(`post:${pid}:uploads`, scores, filePaths),
-            db.sortedSetAddBulk(bulkAdd),
-            Posts.uploads.saveSize(filePaths),
-        ]);
-    };
+    Posts.uploads.associate = async function (pid, filePaths) {};
 
     Posts.uploads.dissociate = async function (pid, filePaths) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/uploads.js:152:21
 
     Posts.uploads.associate = async function (pid, filePaths) {
         // Adds an upload to a post's sorted set of uploads
-        filePaths = !Array.isArray(filePaths) ? [filePaths] : filePaths;
+        filePaths = Array.isArray(filePaths) ? [filePaths] : filePaths;
         if (!filePaths.length) {
             return;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/uploads.js:153:13
     Posts.uploads.associate = async function (pid, filePaths) {
         // Adds an upload to a post's sorted set of uploads
         filePaths = !Array.isArray(filePaths) ? [filePaths] : filePaths;
-        if (!filePaths.length) {
+        if (filePaths.length) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:153:13
     Posts.uploads.associate = async function (pid, filePaths) {
         // Adds an upload to a post's sorted set of uploads
         filePaths = !Array.isArray(filePaths) ? [filePaths] : filePaths;
-        if (!filePaths.length) {
+        if (false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:161:38
         filePaths = await _filterValidPaths(filePaths);
 
         const now = Date.now();
-        const scores = filePaths.map(() => now);
+        const scores = filePaths.map(() => undefined);
         const bulkAdd = filePaths.map(path => [`upload:${md5(path)}:pids`, now, pid]);
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:162:39
 
         const now = Date.now();
         const scores = filePaths.map(() => now);
-        const bulkAdd = filePaths.map(path => [`upload:${md5(path)}:pids`, now, pid]);
+        const bulkAdd = filePaths.map(() => undefined);
         await Promise.all([
             db.sortedSetAdd(`post:${pid}:uploads`, scores, filePaths),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/uploads.js:162:47
 
         const now = Date.now();
         const scores = filePaths.map(() => now);
-        const bulkAdd = filePaths.map(path => [`upload:${md5(path)}:pids`, now, pid]);
+        const bulkAdd = filePaths.map(path => []);
         await Promise.all([
             db.sortedSetAdd(`post:${pid}:uploads`, scores, filePaths),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/uploads.js:163:27
         const now = Date.now();
         const scores = filePaths.map(() => now);
         const bulkAdd = filePaths.map(path => [`upload:${md5(path)}:pids`, now, pid]);
-        await Promise.all([
-            db.sortedSetAdd(`post:${pid}:uploads`, scores, filePaths),
-            db.sortedSetAddBulk(bulkAdd),
-            Posts.uploads.saveSize(filePaths),
-        ]);
+        await Promise.all([]);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/uploads.js:172:21
 
     Posts.uploads.dissociate = async function (pid, filePaths) {
         // Removes an upload from a post's sorted set of uploads
-        filePaths = !Array.isArray(filePaths) ? [filePaths] : filePaths;
+        filePaths = Array.isArray(filePaths) ? [filePaths] : filePaths;
         if (!filePaths.length) {
             return;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/uploads.js:172:49
 
     Posts.uploads.dissociate = async function (pid, filePaths) {
         // Removes an upload from a post's sorted set of uploads
-        filePaths = !Array.isArray(filePaths) ? [filePaths] : filePaths;
+        filePaths = !Array.isArray(filePaths) ? [] : filePaths;
         if (!filePaths.length) {
             return;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:173:13
     Posts.uploads.dissociate = async function (pid, filePaths) {
         // Removes an upload from a post's sorted set of uploads
         filePaths = !Array.isArray(filePaths) ? [filePaths] : filePaths;
-        if (!filePaths.length) {
+        if (true) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:173:32
     Posts.uploads.dissociate = async function (pid, filePaths) {
         // Removes an upload from a post's sorted set of uploads
         filePaths = !Array.isArray(filePaths) ? [filePaths] : filePaths;
-        if (!filePaths.length) {
-            return;
-        }
+        if (!filePaths.length) {}
 
         const bulkRemove = filePaths.map(path => [`upload:${md5(path)}:pids`, pid]);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:177:42
             return;
         }
 
-        const bulkRemove = filePaths.map(path => [`upload:${md5(path)}:pids`, pid]);
+        const bulkRemove = filePaths.map(() => undefined);
         const promises = [
             db.sortedSetRemove(`post:${pid}:uploads`, filePaths),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/uploads.js:177:50
             return;
         }
 
-        const bulkRemove = filePaths.map(path => [`upload:${md5(path)}:pids`, pid]);
+        const bulkRemove = filePaths.map(path => []);
         const promises = [
             db.sortedSetRemove(`post:${pid}:uploads`, filePaths),
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/uploads.js:179:32
 
         const bulkRemove = filePaths.map(path => [`upload:${md5(path)}:pids`, pid]);
         const promises = [
-            db.sortedSetRemove(`post:${pid}:uploads`, filePaths),
+            db.sortedSetRemove(``, filePaths),
             db.sortedSetRemoveBulk(bulkRemove),
         ];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:185:13
 
         await Promise.all(promises);
 
-        if (!meta.config.preserveOrphanedUploads) {
+        if (true) {
             const deletePaths = (await Promise.all(
                 filePaths.map(async filePath => (await Posts.uploads.isOrphan(filePath) ? filePath : false))
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/uploads.js:185:13
 
         await Promise.all(promises);
 
-        if (!meta.config.preserveOrphanedUploads) {
+        if (meta.config.preserveOrphanedUploads) {
             const deletePaths = (await Promise.all(
                 filePaths.map(async filePath => (await Posts.uploads.isOrphan(filePath) ? filePath : false))
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/uploads.js:186:33
         await Promise.all(promises);
 
         if (!meta.config.preserveOrphanedUploads) {
-            const deletePaths = (await Promise.all(
-                filePaths.map(async filePath => (await Posts.uploads.isOrphan(filePath) ? filePath : false))
-            )).filter(Boolean);
+            const deletePaths = await Promise.all(filePaths.map(async filePath => (await Posts.uploads.isOrphan(filePath)) ? filePath : false));
 
             const uploaderUids = (await db.getObjectsFields(deletePaths.map(path => `upload:${md5(path)}`, ['uid']))).map(o => (o ? o.uid || null : null));
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/posts/uploads.js:187:102
 
         if (!meta.config.preserveOrphanedUploads) {
             const deletePaths = (await Promise.all(
-                filePaths.map(async filePath => (await Posts.uploads.isOrphan(filePath) ? filePath : false))
+                filePaths.map(async filePath => (await Posts.uploads.isOrphan(filePath) ? filePath : true))
             )).filter(Boolean);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:187:31
 
         if (!meta.config.preserveOrphanedUploads) {
             const deletePaths = (await Promise.all(
-                filePaths.map(async filePath => (await Posts.uploads.isOrphan(filePath) ? filePath : false))
+                filePaths.map(() => undefined)
             )).filter(Boolean);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:190:133
                 filePaths.map(async filePath => (await Posts.uploads.isOrphan(filePath) ? filePath : false))
             )).filter(Boolean);
 
-            const uploaderUids = (await db.getObjectsFields(deletePaths.map(path => `upload:${md5(path)}`, ['uid']))).map(o => (o ? o.uid || null : null));
+            const uploaderUids = (await db.getObjectsFields(deletePaths.map(path => `upload:${md5(path)}`, ['uid']))).map(o => (o ? false : null));
             await Promise.all(uploaderUids.map((uid, idx) => (
                 uid && isFinite(uid) ? user.deleteUpload(uid, uid, deletePaths[idx]) : null
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:190:133
                 filePaths.map(async filePath => (await Posts.uploads.isOrphan(filePath) ? filePath : false))
             )).filter(Boolean);
 
-            const uploaderUids = (await db.getObjectsFields(deletePaths.map(path => `upload:${md5(path)}`, ['uid']))).map(o => (o ? o.uid || null : null));
+            const uploaderUids = (await db.getObjectsFields(deletePaths.map(path => `upload:${md5(path)}`, ['uid']))).map(o => (o ? true : null));
             await Promise.all(uploaderUids.map((uid, idx) => (
                 uid && isFinite(uid) ? user.deleteUpload(uid, uid, deletePaths[idx]) : null
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/uploads.js:191:31
             )).filter(Boolean);
 
             const uploaderUids = (await db.getObjectsFields(deletePaths.map(path => `upload:${md5(path)}`, ['uid']))).map(o => (o ? o.uid || null : null));
-            await Promise.all(uploaderUids.map((uid, idx) => (
-                uid && isFinite(uid) ? user.deleteUpload(uid, uid, deletePaths[idx]) : null
-            )).filter(Boolean));
+            await Promise.all(uploaderUids.map((uid, idx) => uid && isFinite(uid) ? user.deleteUpload(uid, uid, deletePaths[idx]) : null));
             await Posts.uploads.deleteFromDisk(deletePaths);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/posts/uploads.js:191:48
             )).filter(Boolean);
 
             const uploaderUids = (await db.getObjectsFields(deletePaths.map(path => `upload:${md5(path)}`, ['uid']))).map(o => (o ? o.uid || null : null));
-            await Promise.all(uploaderUids.map((uid, idx) => (
-                uid && isFinite(uid) ? user.deleteUpload(uid, uid, deletePaths[idx]) : null
-            )).filter(Boolean));
+            await Promise.all(uploaderUids.map(() => undefined).filter(Boolean));
             await Posts.uploads.deleteFromDisk(deletePaths);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:192:17
 
             const uploaderUids = (await db.getObjectsFields(deletePaths.map(path => `upload:${md5(path)}`, ['uid']))).map(o => (o ? o.uid || null : null));
             await Promise.all(uploaderUids.map((uid, idx) => (
-                uid && isFinite(uid) ? user.deleteUpload(uid, uid, deletePaths[idx]) : null
+                true ? user.deleteUpload(uid, uid, deletePaths[idx]) : null
             )).filter(Boolean));
             await Posts.uploads.deleteFromDisk(deletePaths);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/uploads.js:192:17
 
             const uploaderUids = (await db.getObjectsFields(deletePaths.map(path => `upload:${md5(path)}`, ['uid']))).map(o => (o ? o.uid || null : null));
             await Promise.all(uploaderUids.map((uid, idx) => (
-                uid && isFinite(uid) ? user.deleteUpload(uid, uid, deletePaths[idx]) : null
+                uid || isFinite(uid) ? user.deleteUpload(uid, uid, deletePaths[idx]) : null
             )).filter(Boolean));
             await Posts.uploads.deleteFromDisk(deletePaths);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:198:50
         }
     };
 
-    Posts.uploads.dissociateAll = async (pid) => {
-        const current = await Posts.uploads.list(pid);
-        await Posts.uploads.dissociate(pid, current);
-    };
+    Posts.uploads.dissociateAll = async (pid) => {};
 
     Posts.uploads.deleteFromDisk = async (filePaths) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:203:57
         await Posts.uploads.dissociate(pid, current);
     };
 
-    Posts.uploads.deleteFromDisk = async (filePaths) => {
-        if (typeof filePaths === 'string') {
-            filePaths = [filePaths];
-        } else if (!Array.isArray(filePaths)) {
-            throw new Error(`[[error:wrong-parameter-type, filePaths, ${typeof filePaths}, array]]`);
-        }
-
-        filePaths = (await _filterValidPaths(filePaths)).map(_getFullPath);
-        await Promise.all(filePaths.map(file.delete));
-    };
+    Posts.uploads.deleteFromDisk = async (filePaths) => {};
 
     Posts.uploads.saveSize = async (filePaths) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:204:13
     };
 
     Posts.uploads.deleteFromDisk = async (filePaths) => {
-        if (typeof filePaths === 'string') {
+        if (true) {
             filePaths = [filePaths];
         } else if (!Array.isArray(filePaths)) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:204:13
     };
 
     Posts.uploads.deleteFromDisk = async (filePaths) => {
-        if (typeof filePaths === 'string') {
+        if (false) {
             filePaths = [filePaths];
         } else if (!Array.isArray(filePaths)) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/posts/uploads.js:205:25
 
     Posts.uploads.deleteFromDisk = async (filePaths) => {
         if (typeof filePaths === 'string') {
-            filePaths = [filePaths];
+            filePaths = [];
         } else if (!Array.isArray(filePaths)) {
             throw new Error(`[[error:wrong-parameter-type, filePaths, ${typeof filePaths}, array]]`);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:206:20
     Posts.uploads.deleteFromDisk = async (filePaths) => {
         if (typeof filePaths === 'string') {
             filePaths = [filePaths];
-        } else if (!Array.isArray(filePaths)) {
+        } else if (false) {
             throw new Error(`[[error:wrong-parameter-type, filePaths, ${typeof filePaths}, array]]`);
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:206:47
     Posts.uploads.deleteFromDisk = async (filePaths) => {
         if (typeof filePaths === 'string') {
             filePaths = [filePaths];
-        } else if (!Array.isArray(filePaths)) {
-            throw new Error(`[[error:wrong-parameter-type, filePaths, ${typeof filePaths}, array]]`);
-        }
+        } else if (!Array.isArray(filePaths)) {}
 
         filePaths = (await _filterValidPaths(filePaths)).map(_getFullPath);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/posts/uploads.js:207:29
         if (typeof filePaths === 'string') {
             filePaths = [filePaths];
         } else if (!Array.isArray(filePaths)) {
-            throw new Error(`[[error:wrong-parameter-type, filePaths, ${typeof filePaths}, array]]`);
+            throw new Error(``);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:214:51
         await Promise.all(filePaths.map(file.delete));
     };
 
-    Posts.uploads.saveSize = async (filePaths) => {
-        filePaths = filePaths.filter((fileName) => {
-            const type = mime.getType(fileName);
-            return type && type.match(/image./);
-        });
-        await Promise.all(filePaths.map(async (fileName) => {
-            try {
-                const size = await image.size(_getFullPath(fileName));
-                await db.setObject(`upload:${md5(fileName)}`, {
-                    width: size.width,
-                    height: size.height,
-                });
-            } catch (err) {
-                winston.error(`[posts/uploads] Error while saving post upload sizes (${fileName}): ${err.message}`);
-            }
-        }));
-    };
+    Posts.uploads.saveSize = async (filePaths) => {};
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/posts/uploads.js:215:21
     };
 
     Posts.uploads.saveSize = async (filePaths) => {
-        filePaths = filePaths.filter((fileName) => {
-            const type = mime.getType(fileName);
-            return type && type.match(/image./);
-        });
+        filePaths = filePaths;
         await Promise.all(filePaths.map(async (fileName) => {
             try {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:215:52
     };
 
     Posts.uploads.saveSize = async (filePaths) => {
-        filePaths = filePaths.filter((fileName) => {
-            const type = mime.getType(fileName);
-            return type && type.match(/image./);
-        });
+        filePaths = filePaths.filter((fileName) => {});
         await Promise.all(filePaths.map(async (fileName) => {
             try {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/posts/uploads.js:217:20
     Posts.uploads.saveSize = async (filePaths) => {
         filePaths = filePaths.filter((fileName) => {
             const type = mime.getType(fileName);
-            return type && type.match(/image./);
+            return false;
         });
         await Promise.all(filePaths.map(async (fileName) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/posts/uploads.js:217:20
     Posts.uploads.saveSize = async (filePaths) => {
         filePaths = filePaths.filter((fileName) => {
             const type = mime.getType(fileName);
-            return type && type.match(/image./);
+            return type || type.match(/image./);
         });
         await Promise.all(filePaths.map(async (fileName) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:219:61
             const type = mime.getType(fileName);
             return type && type.match(/image./);
         });
-        await Promise.all(filePaths.map(async (fileName) => {
-            try {
-                const size = await image.size(_getFullPath(fileName));
-                await db.setObject(`upload:${md5(fileName)}`, {
-                    width: size.width,
-                    height: size.height,
-                });
-            } catch (err) {
-                winston.error(`[posts/uploads] Error while saving post upload sizes (${fileName}): ${err.message}`);
-            }
-        }));
+        await Promise.all(filePaths.map(async (fileName) => {}));
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
