[Killed] BlockStatement
src/posts/uploads.js:220:17
             return type && type.match(/image./);
         });
         await Promise.all(filePaths.map(async (fileName) => {
-            try {
-                const size = await image.size(_getFullPath(fileName));
-                await db.setObject(`upload:${md5(fileName)}`, {
-                    width: size.width,
-                    height: size.height,
-                });
-            } catch (err) {
+            try {} catch (err) {
                 winston.error(`[posts/uploads] Error while saving post upload sizes (${fileName}): ${err.message}`);
             }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/posts/uploads.js:222:63
         await Promise.all(filePaths.map(async (fileName) => {
             try {
                 const size = await image.size(_getFullPath(fileName));
-                await db.setObject(`upload:${md5(fileName)}`, {
-                    width: size.width,
-                    height: size.height,
-                });
+                await db.setObject(`upload:${md5(fileName)}`, {});
             } catch (err) {
                 winston.error(`[posts/uploads] Error while saving post upload sizes (${fileName}): ${err.message}`);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/posts/uploads.js:226:27
                     width: size.width,
                     height: size.height,
                 });
-            } catch (err) {
-                winston.error(`[posts/uploads] Error while saving post upload sizes (${fileName}): ${err.message}`);
-            }
+            } catch (err) {}
         }));
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
